[
    "Scooby and the gang face their most challenging mystery ever: a plot to unleash the ghost dog Cerberus upon the world. As they race to stop this dogpocalypse, the gang discovers that Scooby has an epic destiny greater than anyone imagined.",
    "The second installment of the \"Fantastic Beasts\" series featuring the adventures of Magizoologist Newt Scamander.",
    "Anna, Elsa, Kristoff, Olaf and Sven leave Arendelle to travel to an ancient, autumn-bound forest of an enchanted land. They set out to find the origin of Elsa's powers in order to save their kingdom.",
    "Dr. Eggman transports Sonic and friends to the real world, Station Square, where they must retrieve the Seven Chaos Emeralds before Eggman does, in order to stop the evil Doctor from unleashing an ancient water god of destruction onto the world, Chaos, from flooding over civilization, while trying to find a way back to their world.",
    "Maleficent and her goddaughter Aurora begin to question the complex family ties that bind them as they are pulled in different directions by impending nuptials, unexpected allies and dark new forces at play.",
    "Dogs Best Friend is about a 12-year-old tech prodigy whose science experiment goes awry and he forges a telepathic connection with his best friend, his dog. The duo join forces and use their unique perspectives on life to comically overcome complications of family and school.",
    "When a devastating event befalls the city of San Fransokyo and catapults Hiro into the midst of danger, he turns to Baymax and his close friends adrenaline junkie Go Go Tomago, neatnik Wasabi, chemistry whiz Honey Lemon and fanboy Fred. Determined to uncover the mystery, Hiro transforms his friends into a band of high-tech heroes called \"Big Hero 6.\"",
    "Princes who have been turned into Dwarfs seek the red shoes of a lady in order to break the spell, although it will not be easy. A parody with a twist.",
    "Marty McFly, a typical American teenager of the Eighties, is accidentally sent back to 1955 in a plutonium-powered DeLorean \"time machine\" invented by a slightly mad scientist. During his often hysterical, always amazing trip back in time, Marty must make certain his teenage parents-to-be meet and fall in love - so he can get back to the future.",
    "Growing up can be a bumpy road, and it's no exception for Riley, who is uprooted from her Midwest life when her father starts a new job in San Francisco. Like all of us, Riley is guided by her emotions - Joy, Fear, Anger, Disgust and Sadness. The emotions live in Headquarters, the control center inside Riley's mind, where they help advise her through everyday life. As Riley and her emotions struggle to adjust to a new life in San Francisco, turmoil ensues in Headquarters. Although Joy, Riley's main and most important emotion, tries to keep things positive, the emotions conflict on how best to navigate a new city, house and school.",
    "Based on the New York Times bestseller, WONDER tells the incredibly inspiring and heartwarming story of August Pullman. Born with facial differences that, up until now, have prevented him from going to a mainstream school, Auggie becomes the most unlikely of heroes when he enters the local fifth grade. As his family, his new classmates, and the larger community all struggle to discover their compassion and acceptance, Auggie's extraordinary journey will unite them all and prove you can't blend in when you were born to stand out.",
    "A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?",
    "Anna, a fearless optimist, sets off on an epic journey - teaming up with rugged mountain man Kristoff and his loyal reindeer Sven - to find her sister Elsa, whose icy powers have trapped the kingdom of Arendelle in eternal winter. Encountering Everest-like conditions, mystical trolls and a hilarious snowman named Olaf, Anna and Kristoff battle the elements in a race to save the kingdom. From the outside Anna's sister, Elsa looks poised, regal and reserved, but in reality, she lives in fear as she wrestles with a mighty secret-she was born with the power to create ice and snow. It's a beautiful ability, but also extremely dangerous. Haunted by the moment her magic nearly killed her younger sister Anna, Elsa has isolated herself, spending every waking minute trying to suppress her growing powers. Her mounting emotions trigger the magic, accidentally setting off an eternal winter that she can't stop. She fears she's becoming a monster and that no one, not even her sister, can help her.",
    "When the Queen of the Hard Rock Trolls tries to take over all the Troll kingdoms, Queen Poppy and her friends try different ways to save all the Trolls.",
    "The sea underworld is shaken up when the son of the shark mob boss is found dead and a young fish named Oscar is found at the scene. Being a bottom feeder, Oscar takes advantage of the situation and makes himself look like he killed the finned mobster. Oscar soon comes to realize that his claim may have serious consequences.",
    "From the largest elephant to the smallest shrew, the city of Zootopia is a mammal metropolis where various animals live and thrive. When Judy Hopps becomes the first rabbit to join the police force, she quickly learns how tough it is to enforce the law. Determined to prove herself, Judy jumps at the opportunity to solve a mysterious case. Unfortunately, that means working with Nick Wilde, a wily fox who makes her job even harder.",
    "Two young girls, Satsuki and her younger sister Mei, move into a house in the country with their father to be closer to their hospitalized mother. Satsuki and Mei discover that the nearby forest is inhabited by magical creatures called Totoros (pronounced toe-toe-ro). They soon befriend these Totoros, and have several magical adventures.",
    "Mikey Walsh and Brandon Walsh are brothers whose family is preparing to move because developers want to build a golf course in the place of their neighborhood -- unless enough money is raised to stop the construction of the golf course, and that's quite doubtful. But when Mikey stumbles upon a treasure map of the famed \"One-Eyed\" Willy's hidden fortune, Mikey, Brandon, and their friends Lawrence \"Chunk\" Cohen, Clark \"Mouth\" Devereaux, Andrea \"Andy\" Carmichael, Stefanie \"Stef\" Steinbrenner, and Richard \"Data\" Wang, calling themselves The Goonies, set out on a quest to find the treasure in hopes of saving their neighborhood. The treasure is in a cavern, but the entrance to the cavern is under the restaurant of evil thief Mama Fratelli and her sons Jake Fratelli, Francis Fratelli, and the severely disfigured Lotney \"Sloth\" Fratelli. Sloth befriends the Goonies and decides to help them.",
    "Chihiro and her parents are moving to a small Japanese town in the countryside, much to Chihiro's dismay. On the way to their new home, Chihiro's father makes a wrong turn and drives down a lonely one-lane road which dead-ends in front of a tunnel. Her parents decide to stop the car and explore the area. They go through the tunnel and find an abandoned amusement park on the other side, with its own little town. When her parents see a restaurant with great-smelling food but no staff, they decide to eat and pay later. However, Chihiro refuses to eat and decides to explore the theme park a bit more. She meets a boy named Haku who tells her that Chihiro and her parents are in danger, and they must leave immediately. She runs to the restaurant and finds that her parents have turned into pigs. In addition, the theme park turns out to be a town inhabited by demons, spirits, and evil gods. At the center of the town is a bathhouse where these creatures go to relax. The owner of the bathhouse is the evil witch Yubaba, who is intent on keeping all trespassers as captive workers, including Chihiro. Chihiro must rely on Haku to save her parents in hopes of returning to their world.",
    "A little boy named Andy loves to be in his room, playing with his toys, especially his doll named \"Woody\". But, what do the toys do when Andy is not with them, they come to life. Woody believes that he has life (as a toy) good. However, he must worry about Andy's family moving, and what Woody does not know is about Andy's birthday party. Woody does not realize that Andy's mother gave him an action figure known as Buzz Lightyear, who does not believe that he is a toy, and quickly becomes Andy's new favorite toy. Woody, who is now consumed with jealousy, tries to get rid of Buzz. Then, both Woody and Buzz are now lost. They must find a way to get back to Andy before he moves without them, but they will have to pass through a ruthless toy killer, Sid Phillips.",
    "A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land. Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal - an act that begins to turn her pure heart to stone. Bent on revenge, Maleficent faces a battle with the invading king's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and perhaps to Maleficent's true happiness as well.",
    "Having lived a life in selfishness, a young prince is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Years later, his chance shows itself when a young maiden named Belle offers to take her ill father's place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, an unscrupulous hunter has his own plans for Belle.",
    "Holding a mysterious leather suitcase in his hand, Newt Scamander, a young activist wizard from England, visits New York while he is on his way to Arizona. Inside his expanding suitcase hides a wide array of diverse, magical creatures that exist among us, ranging from tiny, twig-like ones, to majestic and humongous ones. It is the middle of the 20s and times are troubled since the already fragile equilibrium of secrecy between the unseen world of wizards and the ordinary or \"No-Maj\" people that the MACUSA Congress struggles to maintain, is at risk of being unsettled. In the meantime, the voices against wizardry keep growing with daily protests led by Mary Lou Barebone and fuelled by the increasing disasters ascribed to a dark wizard, Gellert Grindelwald. At the same time, by a twist of fate, Newt's precious suitcase will be switched with the identical one of an aspiring No-Maj baker, Jacob Kowalski, while demoted Auror, Tina Goldstein, arrests Newt for being an unregistered wizard. To make matters worse, with the suitcase in the wrong hands, several creatures manage to escape to unknown directions. Before long, this situation will catch Senior Auror Percival Graves' attention who will target both Tina and Newt amid panic caused by an invisible, devastating and utterly unpredictable menace that still wreaks havoc in New York's 5th Avenue. Is there a hidden agenda behind Graves' intentions and ultimately, what will happen to the remaining magical creatures still loose in the streets?",
    "When a new toy called \"Forky\" joins Woody and the gang, a road trip alongside old and new friends reveals how big the world can be for a toy.",
    "The son of a sailor, 5-year old Sosuke lives a quiet life on an oceanside cliff with his mother Lisa. One fateful day, he finds a beautiful goldfish trapped in a bottle on the beach and upon rescuing her, names her Ponyo. But she is no ordinary goldfish. The daughter of a masterful wizard and a sea goddess, Ponyo uses her father's magic to transform herself into a young girl and quickly falls in love with Sosuke, but the use of such powerful sorcery causes a dangerous imbalance in the world. As the moon steadily draws nearer to the earth and Ponyo's father sends the ocean's mighty waves to find his daughter, the two children embark on an adventure of a lifetime to save the world and fulfill Ponyo's dreams of becoming human.",
    "Aladdin is a poor street urchin who spends his time stealing food from the marketplace in the city of Agrabah. His adventures begin when he meets a young girl who happens to be Princess Jasmine, who is forced to be married by her wacky yet estranged father. Aladdin's luck suddenly changes when he retrieves a magical lamp from the Cave of Wonders. What he unwittingly gets is a fun-loving genie who only wishes to have his freedom. Little do they know is that the Sultan's sinister advisor Jafar has his own plans for both Aladdin and the lamp.",
    "When a green ogre named Shrek discovers his swamp has been 'swamped' with all sorts of fairytale creatures by the scheming Lord Farquaad, Shrek sets out with a very loud donkey by his side to 'persuade' Farquaad to give Shrek his swamp back. Instead, a deal is made. Farquaad, who wants to become the King, sends Shrek to rescue Princess Fiona, who is awaiting her true love in a tower guarded by a fire-breathing dragon. But once they head back with Fiona, it starts to become apparent that not only does Shrek, an ugly ogre, begin to fall in love with the lovely princess, but Fiona is also hiding a huge secret.",
    "Three teenagers must help a Yeti return to his family while avoiding a wealthy man and a zoologist who want him for their own needs.",
    "A rat named Remy dreams of becoming a great French chef despite his family's wishes and the obvious problem of being a rat in a decidedly rodent-phobic profession. When fate places Remy in the sewers of Paris, he finds himself ideally situated beneath a restaurant made famous by his culinary hero, Auguste Gusteau. Despite the apparent dangers of being an unlikely - and certainly unwanted - visitor in the kitchen of a fine French restaurant, Remy's passion for cooking soon sets into motion a hilarious and exciting rat race that turns the culinary world of Paris upside down.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "In the depths of the 1930's, Annie is a fiery young orphan girl who must live in a miserable orphanage run by the tyrannical Miss Hannigan. Her seemingly hopeless situation changes dramatically when she is selected to spend a short time at the residence of the wealthy munitions industrialist, Oliver Warbucks. Quickly, she charms the hearts of the household staff and even the seemingly cold-hearted Warbucks cannot help but learn to love this wonderful girl. He decides to help Annie find her long lost parents by offering a reward if they would come to him and prove their identity. However, Miss Hannigan, her evil brother, Rooster, and a female accomplice, plan to impersonate those people to get the reward for themselves which put Annie in great danger.",
    "It all begins when young Will Stronghold, the son of the two famous superheroes: Steve and Josie, A.K.A. the incredibly strong, seemingly invulnerable Commander and and the high-speed flying Jetstream. However, Will does not actually know if he has any powers of his own, and has not told his parents this. He and his best friend, Layla are facing their first day of a secret school in the clouds like none on earth: Sky High, the first and only high school for kids with super-human powers going through crime-fighting puberty. But with no apparent superpowers of his own, however, Will seems destined to grow up a mere sidekick. But as he discovers his true strengths, he'll also learn that it takes loyalty and teamwork to truly become a hero!",
    "Super spy teams aren't born...they're hatched. Discover the secrets of the greatest and most hilarious covert birds in the global espionage biz: Skipper, Kowalski, Rico and Private. These elitists of the elite are joining forces with a chic undercover organization, The North Wind. Led by handsome and husky Agent Classified (we could tell you his name, but then...you know). Together, they must stop the villainous Dr. Octavius Brine, from destroying the world as we know it.",
    "Scrat's epic pursuit of his elusive acorn catapults him outside of Earth, where he accidentally sets off a series of cosmic events that transform and threaten the planet. To save themselves from peril, Manny, Sid, Diego, and the rest of the herd leave their home and embark on a quest full of thrills and spills, highs and lows, laughter and adventure while traveling to exotic new lands and encountering a host of colorful new characters.",
    "Blindsided by a new generation of blazing-fast racers, the legendary Lightning McQueen is suddenly pushed out of the sport he loves. To get back in the game, he will need the help of an eager young race technician with her own plan to win, inspiration from the late Fabulous Hudson Hornet, and a few unexpected turns. Proving that #95 isn't through yet will test the heart of a champion on Piston Cup Racing's biggest stage!",
    "In 1930's Austria, a young woman named Maria is failing miserably in her attempts to become a nun. When the Navy captain Georg Von Trapp writes to the convent asking for a governess that can handle his seven mischievous children, Maria is given the job. The Captain's wife is dead, and he is often away, and runs the household as strictly as he does the ships he sails on. The children are unhappy and resentful of the governesses that their father keeps hiring, and have managed to run each of them off one by one. When Maria arrives, she is initially met with the same hostility, but her kindness, understanding, and sense of fun soon draws them to her and brings some much-needed joy into all their lives -- including the Captain's. Eventually he and Maria find themselves falling in love, even though Georg is already engaged to a Baroness and Maria is still a postulant. The romance makes them both start questioning the decisions they have made. Their personal conflicts soon become overshadowed, however, by world events. Austria is about to come under the control of Germany, and the Captain may soon find himself drafted into the German navy and forced to fight against his own country.",
    "Bob Parr (A.K.A. Mr. Incredible), and his wife Helen (A.K.A. Elastigirl), are the world's greatest famous crime-fighting superheroes in Metroville. Always saving lives and battling evil on a daily basis. But fifteen years later, they have been forced to adopt civilian identities and retreat to the suburbs where they have no choice but to retire as superheroes to live a \"normal life\" with their three children Violet, Dash and Jack-Jack (who were secretly born with superpowers). Itching to get back into action, Bob gets his chance when a mysterious communication summons him to a remote island for a top secret assignment. He soon discovers that it will take a super family effort to rescue the world from total destruction.",
    "In a happy suburban neighborhood surrounded by white picket fences with flowering rose bushes, sits a black house with a dead lawn. Unbeknownst to the neighbors, hidden beneath this home is a vast secret hideout. Surrounded by a small army of minions, we discover Gru, planning the biggest heist in the history of the world. He is going to steal the moon. (Yes, the moon!) Gru delights in all things wicked. Armed with his arsenal of shrink rays, freeze rays, and battle-ready vehicles for land and air, he vanquishes all who stand in his way. Until the day he encounters the immense will of three little orphaned girls who look at him and see something that no one else has ever seen: a potential Dad. The world's greatest villain has just met his greatest challenge: three little girls named Margo, Edith and Agnes.",
    "The beautiful and kindhearted princess Snow White charms every creature in the kingdom except one - her jealous stepmother, the Queen. When the Magic Mirror proclaims Snow White the fairest one of all, she must flee into the forest, where she befriends the lovable seven dwarfs - Doc, Sneezy, Grumpy, Happy, Bashful, Sleepy and Dopey. But when the Queen tricks Snow White with an enchanted apple, only the magic of true love's kiss can save her!",
    "A young lion Prince is cast out of his pride by his cruel uncle, who claims he killed his father. While the uncle rules with an iron paw, the prince grows up beyond the Savannah, living by a philosophy: No worries for the rest of your days. But when his past comes to haunt him, the young Prince must decide his fate: will he remain an outcast, or face his demons and become what he needs to be?",
    "Back when the Earth was being overrun by glaciers, and animals were scurrying to save themselves from the upcoming Ice Age, a sloth named Sid, a woolly mammoth named Manny, and a saber-toothed tiger named Diego are forced to become unlikely heroes. The three reluctantly come together when they have to return a human child to its father while braving the deadly elements of the impending Ice Age.",
    "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
    "The stork delivers a baby elephant to Mrs. Jumbo, veteran of the circus, but the newborn is ridiculed because of his truly enormous ears and dubbed \"Dumbo\". After being separated from his mother, Dumbo is relegated to the circus' clown acts; it is up to his only friend, a mouse, to assist Dumbo to achieve his full potential.",
    "Alec Bailey is a gambling, womanizing bankrupt electrical repairman who still is traumatized by the death of Charlie, Alec's twin's brother. Without a penny and almost in the poorness, Alec realizes a long-time stranded uncle Richard Heacock, a brother of his mother who lives in Halifax, Nova Scotia, that accepts to solve Alec's money debts with one condition: that Alec moves Halifax by a year. Reluctant to the travel but threatened by a local pawnbroker, Alec accepts uncle Richard's propose. Therefore, when he arrives Halifax, discovers that the villagers believe that he is \"The Chosen One\", a man with the ability to heal all diseases, at the same time that Halifax's local Sheriff starts a procedure against Alec, in the belief that he's a fraud and he's cheating people. Trapped by a situation that little by little overpass him, Alec finds a friend in Cecilia, beauty and lovely local veterinary, discovering by Richard that all his ancestors are a long-time family of healers, which gift is the capacity to heal all those disease if it's in the fate of the each person that can be healed. Resigning to his gift, at the next day Alec meets Abigail, a sassy, worldly and sarcastic 14-years-old with terminal cancer. Trying to convince to Abigail's parents that he can't heal her, Alec accepts Abigail's idea to spend together the weekend, in order to escape two days from her overprotective parents. Discovering in Abigail a force of nature full of life and energy at the same time that the feelings between Cecilia and him comes out, Alec starts to question himself and the bad decisions in his life, asking a second chance to recover his gift and save Abigail. But when uncle Richard reveals that the gift can't recovered after renounce to it, Alec looking his own way to know who is him really and his reason to live, running against time to give Abigail the life she deserves.",
    "In a place far, far away, illegal genetic experiment #626 is detected: Ruthless scientist Dr. Jumba Jookiba has created a strong, intelligent, nearly indestructible and aggressive being with only one known weakness: The high density of his body makes it impossible for the experiment to swim in water. The scientist is sentenced to jail by the Grand Council of the Galactic Federation. The experiment is supposed to be transported to a prison asteroid, yet manages to escape Captain Gantu, who was supposed to deliver him there. With a stolen police cruiser (the red one), the destructive being races towards a little and already doomed planet: Earth. Stranded on Hawaii, experiment #626 can't actually do much harm: water all around, no big cities and two well-equipped representatives of the Galactic Federation already following close behind to catch him again. But Dr. Jookiba and the Earth expert Pleakley never could have guessed that earth girl Lilo adopts the experiment as dog, gives him the name Stitch and actually causes an emotional development in the little beast. Her dysfunctional family, consisting only of Lilo and her sister Nani, is about to be ripped apart by social worker Cobra Bubbles. Stitch as the new family member brings quite some action into all their lifes, and after a while, not even Pleakley and Dr. Jookiba can recognize their former target. But how shall they bring the news of failure to the Grand Councilwoman without being punished?",
    "Garden gnomes Gnomeo (voice of McAvoy) and Juliet (voice of Blunt) have as many obstacles to overcome as their quasi namesakes when they are caught up in a feud between neighbors. But with plastic pink flamingos and lawnmower races in the mix, can this young couple find lasting happiness?",
    "The once hideous ogre Shrek is now living a good life with wife Fiona and his three children. But he soon has a meltdown in front of them and his friends during his kids' birthday party. He suddenly wants to be a real ogre like he was before he ever met Fiona. So he turns to devious deal maker Rumplestiltskin for help. At first, Shrek lives the life he once lost and everything is good. But he soon finds out that he has been set up by Rumplestiltskin, who now rules the land with an ironed fist. Teaming with friends Donkey, Fiona and Puss in Boots, Shrek is in for the fight of his life as he tries to get his life back before time runs out.",
    "Kubo lives a quiet, normal life in a small shoreside village until a spirit from the past turns his life upside down by re-igniting an age-old vendetta. This causes all sorts of havoc as gods and monsters chase Kubo who, in order to survive, must locate a magical suit of armor once worn by his late father, a legendary Samurai warrior.",
    "From the creators of Shrek comes the most smart, funny, irreverent animated comedy of the year, DreamWorks' Trolls. This holiday season, enter a colorful, wondrous world populated by hilariously unforgettable characters and discover the story of the overly optimistic Trolls, with a constant song on their lips, and the comically pessimistic Bergens, who are only happy when they have trolls in their stomach. Featuring original music from Justin Timberlake, and soon-to-be classic mash-ups of songs from other popular artists, the film stars the voice talents of Anna Kendrick, Justin Timberlake, Russell Brand, James Corden, Kunal Nayyar, Ron Funches, Icona Pop, Gwen Stefani, and many more. DreamWorks' TROLLS is a fresh, broad comedy filled with music, heart and hair-raising adventures. In November of 2016, nothing can prepare you for our new Troll world.",
    "A young boy stumbles into a mysterious girl who floats down from the sky. The girl, Sheeta, was chased by pirates, army and government secret agents. In saving her life, they begin a high flying adventure that goes through all sorts of flying machines, eventually searching for Sheeta's identity in a floating castle of a lost civilization.",
    "When Coraline moves to an old house, she feels bored and neglected by her parents. She finds a hidden door with a bricked up passage. During the night, she crosses the passage and finds a parallel world where everybody has buttons instead of eyes, with caring parents and all her dreams coming true. When the Other Mother invites Coraline to stay in her world forever, the girl refuses and finds that the alternate reality where she is trapped is only a trick to lure her.",
    "Kevin McCallister's parents have split up. Now living with his mom, he decides to spend Christmas with his dad at the mansion of his father's rich girlfriend, Natalie. Meanwhile robber Marv Merchants, one of the villains from the first two movies, partners up with a new criminal named Vera to hit Natalie's mansion.",
    "Two young friends find a magic book that brings a ventriloquist's dummy to life.",
    "The Chipmunks believe that Dave plans to propose to his new girlfriend in Miami.--and dump them. They have three days to get to him and save themselves not only from losing Dave but also from gaining a terrible stepbrother.",
    "Mavis surprises Dracula with a family voyage on a luxury Monster Cruise Ship so he can take a vacation from providing everyone else's vacation at the hotel. The rest of Drac's Pack cannot resist going along. But once they leave port, romance arises when Dracula meets the mysterious ship captain, Ericka. Now it's Mavis's turn to play the overprotective parent, keeping her dad and Ericka apart. Little do they know that his \"too good to be true\" love interest is actually a descendant of Abraham Van Helsing, ancient nemesis to Dracula and all other monsters.",
    "Having lived a life in selfishness, a young prince is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Years later, his chance shows itself when a young maiden named Belle offers to take her ill father's place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, an unscrupulous hunter has his own plans for Belle.",
    "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish that Pinocchio be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble.",
    "Feature adaptation of Beatrix Potter's classic tale of a rebellious rabbit trying to sneak into a farmer's vegetable garden.",
    "After the defeat of their old arch nemesis, The Shredder, the Turtles are needed more than ever, but Raphael, Donatello, and Michelangelo have become lost and direction less. Leonardo has gone to Central America, on the orders of the martial arts master and father figure Master Splinter, for training. Donatello and Michelangelo have started small businesses in Leonardo's absence. Meanwhile, strange things are happening in New York City. An army of ancient creatures threatens to take over the world and the Turtles must unite again to save it.",
    "Get ready to power up! When BarbieTM magically gets pulled into her favorite video game, she is excited to see she's transformed into a fun roller-skating character. In the game, she meets Cutie, the lovable cloud-shaped friend, and Bella, the roller-skating princess. Together, they soon discover a mischievous emoji is trying to take control of the game. As they travel from level to level, BarbieTM must rely on her amazing gaming skills and out-of-the box thinking to save her team and beat the game!",
    "When young Victor's pet dog Sparky (who stars in Victor's home-made monster movies) is hit by a car, Victor decides to bring him back to life the only way he knows how. But when the bolt-necked \"monster\" wreaks havoc and terror in the hearts of Victor's neighbors, he has to convince them (and his parents) that despite his appearance, Sparky's still the good loyal friend he's always been.",
    "After a concert mishap lands Dave in the hospital, Alvin, Simon, and Theodore end up in the care of Dave's twenty-something cousin Toby. When the Chipmunks put aside their stardom to return to school to win a annual \"Battle of the Bands\" competition to save the school's music program. But the boys meet their match with the Chipettes, Brittany, Jeanette, & Eleanor, who are working for the Chipmunks's ex-manager Ian Hawke. Romantic sparks and crazy mishaps happen when the Chipmunks and Chipettes square off.",
    "After receiving the healing powers from a magical flower, the baby Princess Rapunzel is kidnapped from the palace in the middle of the night by Mother Gothel. Mother Gothel knows that the flower's magical powers are now growing within the golden hair of Rapunzel, and to stay young, she must lock Rapunzel in her hidden tower. Rapunzel is now a teenager and her hair has grown to a length of 70-feet. The beautiful Rapunzel has been in the tower her entire life, and she is curious of the outside world. One day, the bandit Flynn Ryder scales the tower and is taken captive by Rapunzel. Rapunzel strikes a deal with the charming thief to act as her guide to travel to the place where the floating lights come from that she has seen every year on her birthday. Rapunzel is about to have the most exciting and magnificent journey of her life.",
    "Based on the novels by Rick Riordan, this series follows a young demigod named Percy Jackson and his friends from Camp Half-Blood as they go on quests to save the world from Kronos's army.",
    "This documentary gives insight to the lives of five ballerinas, all at different points in their careers. Looking at the operations of the Vagonova Academy and the Mariinsky Theatre, the life of a ballerina is disclosed.",
    "In this fully animated, all-new take on the Smurfs, a mysterious map sets Smurfette and her best friends Brainy, Clumsy and Hefty on an exciting and thrilling race through the Forbidden Forest filled with magical creatures to find a mysterious lost village before the evil wizard Gargamel does. Embarking on a roller-coaster journey full of action and danger, the Smurfs are on a course that leads to the discovery of the biggest secret in Smurf history!",
    "The LEGO Movie is a 3D animated film which follows lead character, Emmet a completely ordinary LEGO mini-figure who is identified as the most \"extraordinary person\" and the key to saving the Lego universe. Emmet and his friends go on an epic journey to stop the evil tyrant, Lord Business.",
    "After a beautiful princess is born in to royalty everyone gathers to exchange gifts. Everything is perfectly fine until an unwanted guest appears, Magnifient. Magnificent curses a spell on the young princess and tells here that she will fall asleep at sunset on the evening of her 16th birthday, and that the only way to wake her up were the tears from here true love. Finally the day comes. Will she be left to sleep forever?",
    "A high-school bookworm transforms into a swan. Brainy Casey Carlyle has never quite fit in. Caught between her fantasy of becoming a championship figure skater and her strong-willed mother, who has her on the fast track to Harvard, she can only hope to be like Nikki, Tiffany and Gen--three elite skating prodigies who are ruthlessly competing on the US National circuit (and have attitudes to match). But when Casey gets the chance to train with Gen and her coach, a disgraced former skating champion who also happens to be Gen's mother, she must dash her own mother's hopes in order to pursue her dream. Now, with only the support of Gen's teenage brother, a hunky Zamboni driver, Casey takes on the challenge of her life when she finds herself competing against the best to make it into the championship circuit and become a real \"ice princess.\"",
    "Carl Fredricksen as a boy wanted to explore South America and find the forbidden Paradise Falls. About 64 years later he gets to begin his journey along with a Boy Scout named Russel with help from 500 balloons. On their journey they discover many new friends including a talking dog and Carl and Russel figure out that someone evil plans. Carl soon realizes that this evildoer is his childhood idol. Will they be able to defeat him and will they find Paradise Falls?",
    "The stork delivers a baby elephant to Mrs. Jumbo, veteran of the circus, but the newborn is ridiculed because of his truly enormous ears and dubbed \"Dumbo\". After being separated from his mother, Dumbo is relegated to the circus' clown acts; it is up to his only friend, a mouse, to assist Dumbo to achieve his full potential.",
    "At the Museum of Natural History, there's a new exhibit being unveiled. Larry Daley, who manages the night exhibit where the exhibits come to life because of the Tablet of Ahkmenrah, is in charge of the presentation. But when the exhibits go awry, Larry finds himself in trouble. He learns the Tablet is corroding so he does some research and learns that Cecil, the former museum guard, was at the site when the Tablet was discovered. He tells Larry they were warned if they remove it could mean the end. Larry realizes it means the end of the magic. He talks to Ahkmenrah who says that he doesn't know anything. Only his father the Pharaoh knows the Tablet's secrets. He learns that the Pharaoh was sent to the London museum. So he convinces Dr. McPhee, the museum curator, to help send him to London. He takes Ahkmenrah with him but some of the others tag along, like Teddy Roosevelt, Attila, Octavius, and Jedediah.",
    "This is the story of a young witch, named Kiki who is now thirteen years old. But she is still a little green and plenty headstrong, but also resourceful, imaginative, and determined. With her trusty wisp of a talking cat named Jiji by her side she's ready to take on the world, or at least the quaintly European seaside village she's chosen as her new home.",
    "In a tree farm, three musically inclined chipmunks, Alvin, Simon and Theodore, find their tree cut down and sent to Los Angeles. Once there, they meet the frustrated songwriter David Seville, and despite a poor house wrecking first impression, they impress him with their singing talent. Seeing the opportunity for success, both human and chipmunks make a pact for them to sing his songs. While that ambition proves a frustrating struggle with the difficult trio, the dream does come true after all. However, that success presents its own trials as their unscrupulous record executive, Ian Hawke, plans to break up this family to exploit the boys. Can Dave and the Chipmunks discover what they really value amid the superficial glamor around them?",
    "After super-villain Megamind (Ferrell) kills his good-guy nemesis, Metro Man (Pitt), he becomes bored since there is no one left to fight. He creates a new foe, Tighten (Hill), who, instead of using his powers for good, sets out to destroy the world, positioning Megamind to save the day for the first time in his life.",
    "On Mars, the female babies are nursed by robots while the male babies are dumped in the junkyard under the command of Supervisor. They research Earth and finds that the boy Milo is raised by his Mom with love and discipline. The Martians come to Earth and abduct Mom, to use her brain to instruct the robots about how to raise children. However, Milo sneaks into the spaceship and comes to Mars. He meets Gribble, a young man that behaves like a child and together with the hippie Martian Ki and Gribble's friend Wingnut, they try to rescue Mom and bring her back to Earth. But Supervisor will give her best efforts to stop Milo and his friends.",
    "It's a jungle out there for Blu, Jewel and their three kids after they're hurtled Rio de Janeiro to the wilds of the Amazon. As Blu tries to fit in, he goes beak-to-beak with the vengeful Nigel, and meets the most fearsome adversary of all: his father-in-law.",
    "\"The Good Dinosaur\" asks the question: What if the asteroid that forever changed life on Earth missed the planet completely and giant dinosaurs never became extinct? In this epic journey into the world of dinosaurs, an Apatosaurus named Arlo makes an unlikely human friend. While traveling through a harsh and mysterious landscape, Arlo learns the power of confronting his fears and discovers what he is truly capable of.",
    "In a town with no humans, just animals, a koala named Buster Moon realizes he will soon lose his theater if he cannot turn his luck around. He comes up with a plan to host a singing competition, where the winner will receive $100,000. Will this be enough to return his theater to glory?",
    "A year has passed by since the Pevensie children stepped through the wardrobe. In Narnia, centuries have passed since the defeat of the White Witch. Now the foursome are sent back to Narnia to find that everything was destroyed and the Narnia they once knew is gone forever. They come to aid the young Prince Caspian, who is leading a group of Old Narnians to wage war against his malicious uncle Miraz, who rules Narnia with an iron fist. Will they succeed? When will Aslan return?",
    "The animated story of Bambi, a young deer hailed as the 'Prince of the Forest' at his birth. As Bambi grows, he makes friends with the other animals of the forest, learns the skills needed to survive, and even finds love. One day, however, the hunters come, and Bambi must learn to be as brave as his father if he is to lead the other deer to safety.",
    "Soon-Young (Kim Sae-Ron) is a young girl who is the head of her family. She lives with her mentally handicapped father (Jo Yong-Suk), unscrupulous uncle (Lee Chun-Hee) and younger sister Soon-Ja (Kim Ah-Ron) who is always ill. Younger sister Soon-Ja plays with her Barbie doll everyday and dreams of one day living in the United States. Meanwhile, Mang-Taek comes into contact with an American man interested in adopting a healthy Korean girl. Mang-Taek arranges a deal for the American man to adopt Soon-Young. When her younger sister Soon-Ja hears of the adoption, she becomes jealous and asks to take the place of her older sister. When the American man and his young daughter arrive to take Soon-Young, the uncle, Soong-Young and Soon-Ja must decide who is to go. The American father has an ulterior motive for the adoption.",
    "When Po's long-lost panda father suddenly reappears, the reunited duo travels to a secret panda paradise to meet scores of hilarious new panda characters. But when the supernatural villain Kai begins to sweep across China defeating all the kung fu masters, Po must do the impossible-learn to train a village full of his fun-loving, clumsy brethren to become the ultimate band of Kung Fu Pandas.",
    "The man-cub Mowgli flees The jungle after a threat from the Tiger Shere Khan. Guided by Bagheera the panther and the bear Baloo, Mowgli embarks on a journey of self-discovery, though he also meets creatures who don't have his best interests at heart.",
    "A futuristic twist on Robert Louis Stevenson's Treasure Island, Treasure Planet follows restless teen Jim Hawkins on a fantastic journey across the universe as cabin boy aboard a majestic space galleon. Befriended by the ship's charismatic cyborg cook, John Silver, Jim blossoms under his guidance and shows the makings of a fine shipmate as he and the alien crew battle a supernova, a black hole, and a ferocious space storm. But even greater dangers lie ahead when Jim discovers that his trusted friend Silver is actually a scheming pirate with mutiny on his mind.",
    "Ryan is a lion who wants to go to the wild, where his dad (Samson) once lived. When he gets himself shipped to Africa, his zoo friends (and Samson) work together to bring him back. When they get to Africa, however, the animals find themselves in a pile of danger. They have to fight an evil wildebeest called Kazar. But Kazar's safe compared to the other danger on the island- a volcano that's on the edge of eruption. Can the animals find Ryan and get out of Africa before the volcano erupts in so little time?",
    "The British monarch's (Dame Julie Walters') favorite dog gets lost from the palace and finds himself at a dog fight club. He then begins his long journey to find his way back home.",
    "Kenai, a man who resents bears after a fight with one kills his older brother, is turned into a bear so he can see life from a different perspective. He is visited by the spirit of his older brother, and is told that, if he wishes to be changed back into a human, he must travel to the place where the lights touch the Earth, in other words, the Northern Lights. Fueled by hope, Kenai sets off on his long journey, and, along the way, encounters a younger bear, Koda, who is a chatterbox and a fun-loving spirit; Koda is trying to find his way back to his home, the Salmon Run, which, coincidentally, is right next to where the lights touch the Earth. Koda and Kenai team up, but are hunted by Kenai's other brother, Denahi, who fears that the bear has killed Kenai as well. Along the way, the two bears meet other friends, including two moose, some rams, and some mammoths, with whom they hitch a ride. However, Kenai discovers that he likes being a bear, and realizes that humans aren't only afraid of bears; through Koda's eyes, the humans are the monsters, with their long spears. With a whole new view on life, Kenai makes a decision that will change his world forever.",
    "This story follows a teenage rock hopper penguin named Cody Maverick from his hometown of Shiverpool, Antarctica, where all of the other penguins think he's nothing but a surfing fool, to the \"Big Z Memorial Surf Off\" on Pen Gu Island. Young Cody is determined to win the most important competition in the world of penguin surfing in honor of \"Big Z,\" a deceased surfing legend whom he has idolized since childhood. But the waves in Pen Gu are different than in Shiverpool, and the competition is steep. The current champ, egotistical Tank Evans, isn't just about to let this little penguin knock him from first place without a fight. When Cody wipes out and encounters Geek, a recluse aging former surfer, living in the jungle, he learns some important lessons about life and surfing, and even teaches Geek a thing or two.",
    "The evil wizard Gargamel creates a couple of mischievous Smurf-like creatures called the Naughties that he hopes will let him harness the all-powerful, magical Smurf-essence. But when he discovers that only a real Smurf can give him what he wants, and only a secret spell that Smurfette knows can turn the Naughties into real Smurfs, Gargamel kidnaps Smurfette and brings her to Paris, where he has been winning the adoration of millions as the world¹s greatest sorcerer. It's up to Papa, Clumsy, Grouchy, and Vanity to return to our world, reunite with their human friends Patrick and Grace Winslow, and rescue her! Will Smurfette, who has always felt different from the other Smurfs, find a new connection with the Naughties Vexy and Hackus or will the Smurfs convince her that their love for her is True Blue?",
    "Young Mary Katherine (M.K.) returns to her eccentric scientist father's home, but his all-consuming quest to discover a tiny civilization in the neighboring forest drives them apart. However, M.K. soon finds herself shrunken down by Queen Tara of that forest who was mortally wounded by the putrefying Boggans, and charged to deliver a pod bearing the new Queen to safety. Together with a veteran Leafman warrior, two goofy mollusks and a young maverick, M.K. agrees to help. As the villainous Boggan leader, Mandrake closes in, M.K. and her new friends must draw on the best of themselves together and discover what they have to save their world.",
    "The Addams step out of Charles Addams' cartoons. They live with all of the trappings of the macabre (including a detached hand for a servant) and are quite wealthy. Added to this mix is a crooked accountant and his loan shark and a plot to slip in the shark's son into the family as their long lost Uncle Fester. Can the false Fester find his way into the vault before he is discovered?",
    "In present-day Auradon, Ben, the teenage son of King Adam and Queen Belle, is poised to take the throne. He offers a chance for redemption to the trouble-making teen descendants of defeated villains exiled to the remote Isle of the Lost. The villains' descendants have been granted permission to attend prep school in the kingdom with the Disney heroes' kids.",
    "Two overly imaginative pranksters named George and Harold hypnotize their principal into thinking he's a ridiculously enthusiastic, incredibly dimwitted superhero named Captain Underpants.",
    "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish that Pinocchio be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble.",
    "In Rio de Janeiro, baby macaw, Blu, is captured by dealers and smuggled to the USA. While driving through Moose Lake, Minnesota, the truck that is transporting Blu accidentally drops Blu's box on the road. A girl, Linda, finds the bird and raises him with love. Fifteen years later, Blu is a domesticated and intelligent bird that does not fly and lives a comfortable life with bookshop owner Linda. Out of the blue, clumsy Brazilian ornithologist, Tulio, visits Linda and explains that Blu is the last male of his species, and he has a female called Jewel in Rio de Janeiro. He invites Linda to bring Blu to Rio so that he and Jewel can save their species. Linda travels with Blu and Tulio to Rio de Janeiro and they leave Blu and Jewel in a large cage in the institute where Tulio works. While they are having dinner, smugglers break into the institute and steal Blu and Jewel to sell them. Linda and Tulio look everywhere for Blu, who is chained to Jewel and hidden in a slum. Meanwhile, Jewel and Blu escape from their captors and befriend a group of birds that help them to get rid of the chains. It is Carnival and the smugglers and mean cockatoo, Nigel, do not intend to give up Blu and Jewel, and chase the birds through the crowded streets.",
    "It's been five years since everything was awesome and the citizens are facing a huge new threat: Lego Duplo invaders from outer space, wrecking everything faster than they can rebuild.",
    "Paddington is happily settled with the Brown family in Windsor Gardens, where he has become a popular member of the community, spreading joy and marmalade wherever he goes. While searching for the perfect present for his beloved Aunt Lucy's 100th birthday, Paddington spots a unique pop-up book in Mr. Gruber's antique shop, and embarks upon a series of odd jobs to buy it. But when the book is stolen, it's up to Paddington and the Browns to unmask the thief.",
    "A.X.L. is a top-secret, robotic dog who develops a special friendship with Miles and will go to any length to protect his new companion.",
    "Buffalo newsman Evan Baxter is elected to Congress with the slogan, \"Change the world.\" He lucks into a huge house in a new Virginia suburb. His Capitol office is also fantastic, but there's a catch: he's tapped by the powerful Congressman Long to co-sponsor a bill to allow development in national parks. In steps God, who appears to a disbelieving Evan and gently commands him to build an ark. Tools and wood arrive in Evan's yard, animal pairs follow, his beard and hair grow wildly, nomad's clothes and a staff appear. Long grows impatient, Evan starts building, his family leaves him, reporters gather, and drought grips D.C. Still, Evan believes. But will he change the world?",
    "A wild stallion is captured by humans and slowly loses the will to resist training, yet, throughout his struggles for freedom, the stallion refuses to let go of the hope of one day returning home to his herd.",
    "When the evil wizard Gargamel chases the tiny blue Smurfs out of their village, they tumble from their magical world and into ours -- in fact, smack dab in the middle of Central Park. Just three apples high and stuck in the Big Apple, the Smurfs must find a way to get back to their village before Gargamel tracks them down.",
    "Eccentric actor Daniel Hillard is an amusing and caring father. But after a disastrous birthday party for his son, Daniel's wife Miranda draws the line and files a divorce. He can see his three children only once a week which doesn't sit well with him. Daniel also holds a job at a TV studio as a shipping clerk under the recommendation of his liason. But when Miranda puts out an ad for a housekeeper, Daniel takes it upon himself to make a disguise as a Scottish lady named Mrs Doubtfire. And Daniel must also deal with Miranda's new boyfriend Stu Dunemyer.",
    "It's the story about a lazy, irreverent slacker panda, named Po, who is the biggest fan of Kung Fu around...which doesn't exactly come in handy while working every day in his family's noodle shop. Unexpectedly chosen to fulfill an ancient prophecy, Po's dreams become reality when he joins the world of Kung Fu and studies alongside his idols, the legendary Furious Five -- Tigress, Crane, Mantis, Viper and Monkey -- under the leadership of their guru, Master Shifu. But before they know it, the vengeful and treacherous snow leopard Tai Lung is headed their way, and it's up to Po to defend everyone from the oncoming threat. Can he turn his dreams of becoming a Kung Fu master into reality? Po puts his heart - and his girth - into the task, and the unlikely hero ultimately finds that his greatest weaknesses turn out to be his greatest strengths.",
    "When her father enlists to fight for the British in WWI, young Sara Crewe goes to New York to attend the same boarding school her late mother attended. She soon clashes with the severe headmistress, Miss Minchin, who attempts to stifle Sara's creativity and sense of self-worth. Sara's belief that \"every girl's a princess\" is tested to the limit, however, when word comes that her father was killed in action and his estate has been seized by the British government.",
    "Pauline, Petrova, and Posy Fossil live with Sylvia Brown, their guardian. Money is tight and as the story opens, three boarders - a garage owner, a retired English professor, and a dance teacher - come to stay. Theo Dane, the dance teacher, has the girls accepted at her school by the formidable Madame, and the three go on the stage to help raise money. Each discovers her talents - Pauline as an actress, Petrova in fixing engines, and Posy as a dancer.",
    "Thunder, an abandoned young cat seeking shelter from a storm, stumbles into the strangest house imaginable, owned by an old magician and inhabited by a dazzling array of automatons and gizmos. Not everyone welcomes the new addition to the troupe as Jack Rabbit and Maggie Mouse plot to evict Thunder. The situation gets worse when the magician lands in hospital and his scheming nephew sees his chance to cash in by selling the mansion. Our young hero is determined to earn his place and so he enlists the help of some wacky magician's assistants to protect his magical new home.",
    "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called \"Underland,\" she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "Flint Lockwood thinks he's a genius. But none of the things he invented are things that make sense or are useful. However, he has the support of his mother but when she dies, he's left alone with his father who thinks he should give it up. When the community that he lives in is in an economic crisis because their primary source of income, a sardine cannery, was shut down, Flint decides to try his latest invention, a machine that can turn water into food. But something goes wrong and the machine ends up in the atmosphere. Later it starts raining food. The shifty mayor tries to use this as a way to help their community, but when Flint senses something wrong with the machine, the mayor convinces him to ignore it. However, as Flint predicts, chaos ensues.",
    "Ryu Seung-Ryong comes back as a fool for his daughter. Outsiders not allowed, in room number 7 of the prison where all kinds of criminals are gathered, comes Yong-goo, a father with the sense of a 6-year-old, and Ye-seung, his 7-year-old daughter. The mission of these criminals in room number 7 is to protect these two who can never stay apart for a single moment. Will they succeed?",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "Troy is offered a job at Ryan & Sharpay's country club and ends up landing jobs for Gabriella, Chad, Taylor, Kelsi, Jason, Martha and Zeke. He is then introduced to Sharpay's parents and realizes that Sharpay can land him many opportunities and even a basketball scholarship. Meanwhile, while Troy starts hanging out with the rich folk, Chad is worried that Troy will forget his friends. Gabriella feels as though she is losing Troy to Sharpay. In the end, Troy will have to learn how to think about his scholarship without losing his friends.",
    "After six years of keeping our malls safe, Paul Blart has earned a well-deserved vacation. He heads to Las Vegas with his teenage daughter before she heads off to college. But safety never takes a holiday and when duty calls, Blart answers.",
    "N/A",
    "The Emoji Movie unlocks the never-before-seen secret world inside your smartphone. Hidden within the messaging app is Textopolis, a bustling city where all your favorite emojis live, hoping to be selected by the phone's user. In this world, each emoji has only one facial expression - except for Gene, an exuberant emoji who was born without a filter and is bursting with multiple expressions. Determined to become \"normal\" like the other emojis, Gene enlists the help of his handy best friend Hi-5 and the notorious code breaker emoji Jailbreak. Together, they embark on an epic \"app-venture\" through the apps on the phone, each its own wild and fun world, to find the Code that will fix Gene. But when a greater danger threatens the phone, the fate of all emojis depends on these three unlikely friends who must save their world before it's deleted forever.",
    "Rango is a pet chameleon always on the lookout for action and adventure, except the fake kind, where he directs it and acts in it. After a car accident, he winds up in an old western town called Dirt. What this town needs the most is water, but they also need a hero and a sheriff. The thirsty Rango instantly takes on the role of both and selfishly agrees to take on the case of their missing water.",
    "Barbie is Rapunzel in this beloved story. Kidnapped by an evil witch, Rapunzel is locked in a tower and hidden from the outside world. Rapunzel goes on a journey and with the help of her friends Penelope and Hobie, she manages to get the life she deserves and live happily ever after.",
    "Barbie and her athletic best friends slip into their smart outfits when a secret intelligence agency wants to use their special skills to stop a series of gem robberies. Will the Spy Squad succeed in this difficult cat-and-mouse game?",
    "Wayne Szalinski is your average \"nutty scientist\", working on a top secret machine that shrinks objects. When it unexpectedly starts working, he's so amazed he forgets to tell his family to be careful. And when they wander into his lab...",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "Right after the events that took place in Barbie: Fairytopia, Elina, the wingless, yet, brave flower fairy, having recently defeated the Enchantress' wicked sister, the mischievous Laverna, finally receives as a gift a precious set of sparkling wings to fly free in the skies. But soon, Elina will find out that Nalu, her merman friend and Prince of the Merfolk, has been unfortunately abducted by the banished Laverna's subordinates, three ruthless Fungi who threaten to pollute the sea unless he accepts to disclose the exact location of the powerful \"Immunity Berry\", a magical fruit that would inevitably make her the invulnerable ruler of all Fairytopia. However, in the difficult task of finding Prince Nalu, and above all, saving the peaceful Fairytopia from evil Laverna's clutches, Elina with the help of her pet-friend Bibble, will need to join forces with another mermaid, the reluctant Nori, and put their differences aside if they want to succeed. Will the team make it in time?",
    "'Kit Kittredge: An American Mystery' centers around a young girl living in the struggles of the Great Depression. 10 year old Kit lives in a boarding house her parents own in Cincinnati, Ohio. She has a passion for writing, & dreams of having something of hers put in the local paper someday. With the help of her friends, Sterling & Ruthie, will her dream finally come true?",
    "The man-cub Mowgli flees The jungle after a threat from the Tiger Shere Khan. Guided by Bagheera the panther and the bear Baloo, Mowgli embarks on a journey of self-discovery, though he also meets creatures who don't have his best interests at heart.",
    "Hercules, son of the Greek God, Zeus, is turned into a half-god, half-mortal by evil Hades, God of the Underworld, who plans to overthrow Zeus. Hercules is raised on Earth and retains his god-like strength, but when he discovers his immortal heritage Zeus tells him that to return to Mount Olympus he must become a true hero. Hercules becomes a famous hero with the help of his friend Pegasus and his personal trainer, Phil the satyr. Hercules battles monsters, Hades and the Titans, but it is his self-sacrifice to rescue his love Meg which makes him a true hero.",
    "Barbie stars as Blair, a kind-hearted girl who is chosen to attend Princess Charm School. In this magical place, she makes new friends and discovers that there's a princess in every girl!",
    "Teenager Holly Hamilton is tired of moving every time her single mom Jean has another personal meltdown involving yet another second-rate guy. To distract her mother from her latest bad choice, Holly conceives the perfect plan for the perfect man.. an imaginary secret admirer who will romance Jean and boost her shaky self-esteem. When the virtual relationship takes off, Holly finds herself having to produce the suitor, borrowing her friend's charming and handsome Uncle Ben as the face behind the e-mails, notes and gifts. Holly must resort to increasingly desperate measures to keep the ruse alive and protect her mom's newfound happiness, almost missing the real perfect man when he does come along.",
    "Baby George got into a plane crash in a jungle, stayed alive and was adopted by a wise ape. Ursula Stanhope, US noble woman is saved from death on safari by grown-up George, and he takes her to jungle to live with him. He slowly learns a rules of human relationships, while Ursula's lover Lyle is looking for her and the one who took her. After they are found, Ursula takes George to the USA.",
    "Life's a beach for surfers Brady and McKenzie -- until a rogue wave magically transports them inside the classic '60s beach party flick, Wet Side Story, where a full-blown rivalry between bikers and surfers threatens to erupt. There, amidst a sea of surfing, singing and dancing, Brady and Mack accidentally change the storyline, and the film's dreamy hero and heroine fall for them instead of for each other!",
    "Bugs Bunny and Daffy Duck are up to their feuding ways again. Tired of playing second fiddle to Bugs, Daffy has decided to leave the Studio for good. He is aided by Warner Bros.' humor impaired Vice President of Comedy, Kate Houghton, who releases him from his contract and instructs WB security guard/aspiring stunt man DJ Drake to capture and \"escort\" Daffy off the studio lot. Suddenly a sidekick without a hero, the duck decides to ally himself with DJ, whether he likes it or not. Consequently, Daffy is on the scene when DJ discovers that his famous movie star father was Damian Drake, known for playing suave international spies onscreen, is actually a suave international spy in real life--and has been kidnapped by the evil insane nerdy, prancing villain known as Mr. Chairman of the equally nefarious Acme Corporation. It seems that Damian knows the whereabouts of the mysterious magical and powerful Blue Monkey Diamond, and the Chairman will do anything to get his hands on it! With Daffy in tow, DJ hits the road in a desperate attempt to outrace the evil Acme stooges to the diamond and save the world from their evil clutches. Unbeknownst to the two neo-spies, they are also being followed by VP Kate and Bugs--the studio brass has decided that the rabbit needs a comic foil after all, and Kate's job is on the line if she can't get Daffy back to work ASAP.",
    "A new dark force threatens Ponyville, and the Mane 6 Twilight Sparkle, Applejack, Rainbow Dash, Pinkie Pie, Fluttershy, and Rarity embark on an unforgettable journey beyond Equestria where they meet new friends and exciting challenges on a quest to use the magic of friendship and save their home.",
    "In her first animated musical featuring seven original songs, Barbie comes to life in this modern re-telling of a classic tale of mistaken identity and the power of friendship. Based on the story by Mark Twain, Barbie as The Princess and The Pauper features Barbie in an exciting dual role as a princess and a poor village girl - two girls who look amazingly alike. The girls' paths are fated to cross when Princess Anneliese is captured and Erika, her look-alike, must try to save her. Can Erika pretend to be the Princess and foil her captor, the evil Preminger? And what of the handsome King Dominick, who falls in love with Erika, mistaking her for Princess Anneliese? In this magical musical performance, two beautiful, adventurous girls dare to follow their dreams and discover that destiny is written in a very special place: your heart.",
    "When the pressure to be royally perfect becomes too much for Mal, she returns to her rotten roots on the Isle of the Lost where her archenemy Uma, the daughter of Ursula from The Little Mermaid, has taken her spot as self-proclaimed queen of the run-down town. Uma, still resentful over not being selected by Ben to go to Auradon Prep with the other Villain Kids, stirs her pirate gang including Captain Hook's son Harry and Gaston's son Gil, to break the barrier between the Isle of the Lost and Auradon, and unleash all the villains imprisoned on the Isle once and for all.",
    "Barbie stars as Merliah, a surfer who learns a shocking secret: she's a mermaid! She and her dolphin friend set out for an undersea adventure to rescue her mother, the queen of Oceana.",
    "The movie is about the life of Tarzan. Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...",
    "Here's the thing! Viola's soccer team at Cornwall gets cut. She wants to join the boys team, but they do not allow girls. So she thinks \"If you can't join them, beat them\". So she does! She disguises herself as her twin brother Sebastian, and goes out for the rival school, Illyria, boys' soccer team and makes it. Unfortunately, she didn't plan falling in love with her roommate Duke. But Duke has his eyes on Olivia. What makes matters worse is that Olivia starts to fall for Sebastian because he/she has a sensitive side. If things couldn't get more problematic, the real Sebastian (who was in London working on his music) comes home early. He arrives on campus and has no clue that he was replaced by his twin sister.",
    "In New York, unemployed and divorced Larry Daley is a complete loser. His son Nick is very disappointed with his father who is going to be evicted. Larry accepts the job of night watchman in the Museum of Natural History and takes the place of three old security guards that have just retired in order to raise some money and pay his bills. On his first shift, Larry soon realizes that everything at the museum is not as it seems as the statues begin to come to life after the sun sets. The Museum transforms into complete chaos with the inexperienced Larry in charge as he learns that an old Egyptian stone that came to the Museum in 1950 brings these statues to life until dawn. When Larry brings his son to spend a night with him, the three old guards break into the Museum to try to steal the magical stone. Larry organizes all the historic characters to help him stop the criminals and save the museum.",
    "In the Valley of Peace, Po Ping is revelling in his fulfilled dreams as he serves as the fabled Dragon Warrior protecting his home with his heroes now his closest friends. However, Po and company learn that the murderous Lord Shen of Gongman City is threatening the land with a fearsome new weapon that could mean the end of kung fu. They attempt to stop him, but the panda is burdened with crippling memory flashbacks linked to this villain. Now with China in the balance, Po must learn about his past and find true inner peace against all opposition.",
    "In New York City, you would come across a small house, home to a family known as the Littles. You would happen to think of them as the nicest family you'd ever meet. One day, Fredrick and Eleanor, both parents and Littles, ho to and orphanage to find a brother for their son, George. While at it, they meet Stuart, a small, but charming mouse, who apparently, is human-civilized. They adopt him, and everyone, even George, loves him. But there is one problem with Stuart's life, Snowbell, the Little family cat, who wants him. But when trouble starts up almost immediately, Stuart must make it back to his home-before snowbell's friends find out about him",
    "In 15th century Paris, Clopin the puppeteer tells the story of Quasimodo, the misshapen but gentle-souled bell ringer of Notre Dame, who was nearly killed as a baby by Claude Frollo, the Minister of Justice. But Frollo was forced by the Archdeacon of Notre Dame to raise Quasimodo as his own. Now a young man, Quasimodo is hidden from the world by Frollo in the belltower of the cathedral. But during the Festival of Fools, Quasimodo, cheered on by his gargoyle friends Victor, Hugo, and Laverne, decides to take part in the festivities, where he meets the lovely gypsy girl Esmeralda and the handsome soldier Phoebus. The three of them find themselves ranged against Frollo's cruelty and his attempts to destroy the home of the gypsies, the Court of Miracles. And Quasimodo must desperately defend both Esmeralda and the very cathedral of Notre Dame.",
    "A Persian sailor named Sinbad is on a quest to find the magical legendary Book of Peace, a mysterious artifact that Eris, the Greek wicked goddess of chaos, has ultimately framed him for stealing! If he fails on this quest, his childhood friend Prince Proteus of Syracuse will take Sindbad's death penalty, while Eris gains a desired foothold of power in the world of mortals.",
    "George Bailey has spent his entire life giving of himself to the people of Bedford Falls. He has always longed to travel but never had the opportunity in order to prevent rich skinflint Mr. Potter from taking over the entire town. All that prevents him from doing so is George's modest building and loan company, which was founded by his generous father. But on Christmas Eve, George's Uncle Billy loses the business's $8,000 while intending to deposit it in the bank. Potter finds the misplaced money and hides it from Billy. When the bank examiner discovers the shortage later that night, George realizes that he will be held responsible and sent to jail and the company will collapse, finally allowing Potter to take over the town. Thinking of his wife, their young children, and others he loves will be better off with him dead, he contemplates suicide. But the prayers of his loved ones result in a gentle angel named Clarence coming to earth to help George, with the promise of earning his wings. He shows George what things would have been like if he had never been born. In a nightmarish vision in which the Potter-controlled town is sunk in sex and sin, those George loves are either dead, ruined, or miserable. He realizes that he has touched many people in a positive way and that his life has truly been a wonderful one.",
    "A tribe of cats called the Jellicles must decide yearly which one will ascend to the Heaviside Layer and come back to a new Jellicle life.",
    "During the times of King Arthur, the story of an adventurous brave girl, named Kayley, whose father, a Knight of the Round Table, is killed by Sir Ruber, a maniacal brute who steals Excalibur and ultimately threatens to seize King Arthur's Camelot. Kayley enlists the blind, reclusive knight-aspirant Garrett and a goofy two headed dragon to brave the Enchanted Forest and retrieve the magic sword. Their adventure is also, of course, fraught with danger.",
    "Pooh, a bear of very little brain, and all his friends in the Hundred Acre Wood sing their way through adventures that encompass honey, bees, bouncing, balloons, Eeyore's birthday, floods, and Pooh sticks.",
    "Garfield, the fat, lazy, lasagna lover, has everything a cat could want. But when Jon, in an effort to impress the Liz - the vet and an old high-school crush - adopts a dog named Odie and brings him home, Garfield gets the one thing he doesn't want. Competition. One night Odie runs away and gets dog-napped after Garfield locks him outside. Garfield, in an out of character move, goes to search for and rescue Odie with the help of a variety of animal friends along the way.",
    "Dusty Crophopper is a little cropduster plane with a fear of heights and a crazy dream of being a racer. While his friends need convincing, Dusty gets the training he needs from Skipper, a veteran fighter, and qualifies for the Wings Across the World race. In the event, Dusty finds competitors who soon learn that there is something special about this underdog as he is tested to his physical and emotional limits. In doing so, Dusty soon finds enemies, and more importantly friends, who are inspired by his dream. In the face of all obstacles, the winner of this air race will be anyone's guess.",
    "When a casino owning dog named Charlie is murdered by his rival Carface, he finds himself in Heaven basically by default since all dogs go to heaven. However, since he wants to get back at his killer, he cons his way back to the living with the warning that doing that damns him to Hell. Once back, he teams with his old partner, Itchy to prep his retaliation. He also stumbles on to an orphan girl who can talk to the animals, thus allowing him to get the inside info on the races to ensure his wins to finance his plans. However, all the while, he is still haunted by nightmares on what's waiting for him on the other side unless he can prove that he is worthy of Heaven again.",
    "RJ, a raccoon who needs food, accidentally takes food from a hungry bear named Vincent and he wants his food to be found in exactly the same place in a week. He finally finds that an animal family, with a tortoise named Verne as their leader, could help him restore the food from the suburbia, the gateway to the good life. But little does RJ know, there is a woman who has recently hired an exterminator to try to hunt them down.",
    "When two pre-teens named Hallie & Annie meet through their summer camp, their two lives are rattled when they realize that they are identical twins. With parents, British mother aka famous dress designer Elizabeth & American father, a wine maker named Nick, living in two different sides of the universe, the girls decide to make an identity swap in hopes of spending time with their other parent. The girls later choose to aware their guardians of the swap while at a hotel in NYC, which late reunites the divorced pair and sends them back into remarriage with each other.",
    "A happily domesticated grizzly bear named Boog, has his perfect world turned upside down after he meets Elliot, a scrawny, fast-talking one-horned wild mule deer. They both end up stranded together in the woods during hunting season and it's up to the duo to rally all the other forest animals and turn the tables on the hunters.",
    "A young girl finds that all the books she chooses in the library have been previously checked out by the same boy. Later she meets a very infuriating fellow... could it be her \"friend\" from the library? The boy's grandfather has a violin sales and service shop. The boy wants to be a violin maker like his grandfather.",
    "In Victorian London, England, a little mouse girl's toymaker father is abducted by a peglegged bat. She enlists the aid of Basil of Baker Street, the rodent world's answer to Sherlock Holmes. The case expands as Basil uncovers the crime's link to a plot against the Crown itself.",
    "Young Jane Benson just about manages to make ends meet running the large family house in Yorkshire. In love with local doctor Freddie Jarvis, she suggests they marry, but almost at once finds she has inherited eighteen million pounds. He makes it clear he wants nothing to do with the money and what it can buy, and Jane sets off alone on a spree pursued by two ardent suitors. Jarvis finds he has gained notoriety for turning down such a catch and his plans for ernest research are soon compromised.",
    "Best buddies Mickey, Donald, and Goofy are small-time janitors with big dreams of becoming Musketeers. Peg-Leg Pete, captain of the Musketeers, points out why they'll never make it: Donald is a coward, Goofy is a dim-wit, and Mickey is short. But things change when Princess Minnie demands Musketeer bodyguards when assassins, hired by Pete so he can be king, nearly drop a safe on her. Knowing real Musketeers are too-well trained, Pete hires Mickey, Donald, and Goofy, the clumsy janitors as Musketeers and Minnie's bodyguards.",
    "Fashion designer Anita and computer-game writer Roger meet, fall in love and marry along with their dalmatians Perdita and Pongo. But the proud dogs' puppies are kidnapped by Anita's boss Cruella De Vil, who is stealing young dalmatians to make the coat she has set her heart on. Enlisting the help of the British animal kingdom, Pongo and Perdita set out to find and rescue all ninety-nine pups from their fearsome captors, Jasper and Horace.",
    "Belle prepares the castle for Christmas against Beast's wishes, trying to bring him happiness for the season. Forte, a pipe organ, fears that Belle's plans may eventually bring about an end to the curse... the curse that brought him more importance in the Master's life. Forte uses Fife, a flute who desperately wants a solo, to destroy Belle's plans and get rid of her.",
    "This is the story of a ten-year-old boy named Lucas Nickle, who has just moved to a new neighborhood, has no friends, and is the target for the local bully and his gang. His parents are leaving for a honeymoon in Puerto Vallarta, so they are too busy to attend to his problems. His sister is distracted by her cellular phone, and the grandmother is obsessed with UFOs and aliens. Lucas is constantly being beat up by the obese yet intimidating neighborhood bully. Because he cannot fight back, he takes out his anger on an anthill in his front yard; He kicks it, stomps it, squirts it with his water gun, and floods it with a hose. This terrifies the ants, who call Lucas the Destroyer. One wizard ant, known as Zoc being a hopeful and adventurous type, is trying to solve this dilemma. He tries to devise a magic potion that he believes will solve all their problems. As the plan to shrink Lucas down to their size with a magic potion and forcing him to live like an ant within the colony--an astonishing new world opens up to him. Lucas learns, first-hand, the value of friendship and teamwork, ultimately leading the ants in an effort to save their colony from annihilation. And in the process, Lucas obtains the things he wants most: friends, companionship, acceptance and the courage to stand up for himself.",
    "Adapting the award-winning DC Comics miniseries DC: THE NEW FRONTIER by Darwyn Cooke, Justice League: The New Frontier spins a tale of the DC Universe in the 1950s, focusing on test pilot Hal Jordan (Green Lantern) and the Martian Manhunter. The story also features other DC characters, including Barry Allen (the Flash), Superman, Wonder Woman, Batman, and many more.",
    "A young Peruvian bear with a passion for all things British travels to London in search of a home. Finding himself lost and alone at Paddington Station, he begins to realize that city life is not all he had imagined - until he meets the kind Brown family, who read the label around his neck ('Please look after this bear. Thank you.') and offer him a temporary haven. It looks as though his luck has changed until this rarest of bears catches the eye of a museum taxidermist.",
    "This is the story of a nine-year-old boy named Hogarth Hughes who makes friends with an innocent alien giant robot that came from outer space. Meanwhile, a paranoid U.S. Government agent named Kent Mansley arrives in town, determined to destroy the giant at all costs. It's up to Hogarth to protect him by keeping him at Dean McCoppin's place in the junkyard.",
    "An animated adventure in which the free-spirited UglyDolls confront what it means to be different, struggle with a desire to be loved, and ultimately discover who you truly are is what matters most.",
    "The story is about two swindlers who get their hands on a map to the fabled city of gold, El Dorado while pulling off some sort of scam. Their plan goes bad and the rogues end up lost at sea after a number of misfortunes. Oddly enough, they end up on the shores of El Dorado and are worshiped by the natives for their foreign appearance.",
    "This is the story of a little penguin named Mumble who has a terrible singing voice and later discovers he has no Heartsong. However, Mumble has an astute talent for something that none of the penguins had ever seen before: tap dancing. Though Mumble's mom, Norma Jean, thinks this little habit is cute, his dad, Memphis, says it \"just ain't penguin.\" Besides, they both know that, without a Heartsong, Mumble may never find true love. As fate would have it, his one friend, Gloria, happens to be the best singer around. Mumble and Gloria have a connection from the moment they hatch, but she struggles with his strange \"hippity- hoppity\" ways. Mumble is just too different--especially for Noah the Elder, the stern leader of Emperor Land, who ultimately casts him out of the community. Away from home for the first time, Mumble meets a posse of decidedly un-Emperor-like penguins--the Adelie Amigos. Led by Ramon, the Adelies instantly embrace Mumble's cool dance moves and invite him to party with them. In Adelie Land, Mumble seeks the counsel of Lovelace the Guru, a crazy-feathered Rockhopper penguin who will answer any of life's questions for the price of a pebble. Together with Lovelace and the Amigos, Mumble sets out across vast landscapes and, after some epic encounters, proves that by being true to yourself, you can make all the difference in the world.",
    "After a scientific experiment leads to the creation of a clone of Mewtwo, he sets out to destroy the world. Ash and his friends then decide to thwart Mewtwo's evil plans.",
    "Lady, a golden cocker spaniel, meets up with a mongrel dog who calls himself the Tramp. He is obviously from the wrong side of town, but happenings at Lady's home make her decide to travel with him for a while. This turns out to be a bad move, as no dog is above the law.",
    "Captain New Eyes travels back in time and feeds dinosaurs his Brain Grain cereal, which makes them intelligent and nonviolent. They agree to go to the Middle Future (this era) in order to grant the wishes of children in New York city. They are to meet Dr. Bleeb of the Museum of Natural History, but get side-tracked with their new friends and run into the Captain's evil brother, Professor Screw Eyes, who has other plans for the dinosaurs.",
    "Shaun the sheep is tired of doing the same work at the farm everyday. He decides to take a day off. In order to do that, he needs to make sure the farmer doesn't know. When more happens than they can handle, the sheep find their way in the big city. Now they need to get back to the farm.",
    "A female dog travels four hundred miles in search of her owner throughout a Colorado wilderness.",
    "The classic tale of 'Peter Pan' continues in Disney's sequel 'Return to Never Land'. In 1940 on a world besieged by World War II, Wendy, now grown up, has two children, one of them is her daughter, Jane. She wears her trench coat during the air raid, and later that night, Wendy tries to give her own children hope by telling them of her magical experiences with Peter Pan in Never Land. However, Jane, Wendy's daughter, sees it all as make believe and refuses to believe in the tales. That is, until the villainous Captain Hook mistakes her for Wendy and abducts her to Never Land in an attempt to lure and capture Peter Pan. Peter Pan's quest to return Jane safely home is jeopardized until she can begin to believe in the magic of imagination.",
    "Elliott incessantly parades proudly with his antlers, until unwise rock-jumping sees them crushed, and thus his new pride. Bride Giselle thinks Elliott has commitment anxiety when he rushes off to take the lead in the rescue of canine buddy Mr. Weenie, who is kidnapped by a poodle's gang of master-devoted pets determined to reconvert him. The feral gang has great trouble even penetrating the heavily guarded holiday resort where the brainwashing attempt is happening.",
    "Years before meeting Shrek and Donkey, the adorable but tricky Puss in Boots must clear his name from all charges making him a wanted fugitive. While trying to steal magic beans from the infamous criminals Jack and Jill, the hero crosses paths with his female match, Kitty Softpaws, who leads Puss to his old friend, but now enemy, Humpty Dumpty. Memories of friendship and betrayal enlarges Puss' doubt, but he eventually agrees to help the egg get the magic beans. Together, the three plan to steal the beans, get to the Giant's castle, nab the golden goose, and clear Puss' name.",
    "Jungle boy Mowgli (voiced by Osment) decides to forsake civilized village life for the \"bare necessities\" of the wild with his old friends. However, the evil tiger Shere Khan is looking for a little payback after Mowgli's last adventure. Trouble's a-brewing!",
    "Three best friends get together and bury a box, making a pact to open it at midnight at their high school graduation. In the small town in Georgia that they live in, things soon change. One is little miss perfect, one is an engaged prom queen, and the other is a pregnant outcast. On the night of their graduation, they open the box and they strike up a conversation. Suddenly, one brings up the topic of her going to Los Angeles for a record contract audition. They all decide to go together and they leave. With a little money, they set out on the road with a guy named Ben. When one of them tells the other a rumor that he might be a homicidal maniac, they are all scared of him. When they reach Los Angeles, Lucy (Britney Spears) falls in love with Ben and against her father's wishes, she stays and she goes to the audition.",
    "After years of fruitless warning of his farmyard brethren of the coming Thanksgiving doom, Reggie the Turkey finds himself spared as the annual Pardoned Turkey. However, Reggie's easy life is disrupted by Jake, a fanatic turkey who drags him along with the insane idea of going back in time to make sure turkeys are not part of the first Thanksgiving. Through foolhardiness and luck, the pair manage to take an experimental time machine to do just that. Now in 1621 at the Plymouth colony, Reggie and Jake find themselves in the middle of a turkey clan's struggle for survival. In doing so, their preconceptions of the world and themselves are challenged forever in a conflict from which the world will never be the same.",
    "During an attack on a pack of Iguanodon, an egg is separated and ends up with the possession of a group of lemurs. The lemurs care for this egg and the young creature born from it, which they call Aladar. When a meteor shower hits earth, Aladar and his family must leave their homeland. Away from home and as close to danger as they have ever been, they meet up with a huge group of dinosaurs, led by Kron and Bruton. All together they are trying to reach the nesting grounds, but it's not going to be easy.",
    "Arthur is a spirited ten-year old whose parents are away looking for work, whose eccentric grandfather has been missing for several years, and who lives with his grandmother in a country house that, in two days, will be repossessed, torn down, and turned into a block of flats unless Arthur's grandfather returns to sign some papers and pay off the family debt. Arthur discovers that the key to success lies in his own descent into the land of the Minimoys, creatures no larger than a tooth, whom his grandfather helped relocate to their garden. Somewhere among them is hidden a pile of rubies, too. Can Arthur be of stout heart and save the day? Romance beckons as well, and a villain lurks.",
    "The story begins with Spanky, who is the president of the \"He-Man Woman Haters Club\" with many school-aged boys from around the neighborhood as members. His best friend, Alfalfa, has been chosen as the driver for the club's prize-winning go-kart, called \"The Blur\", in the annual Soap Box Derby style race. However, when the announcement is made, Alfalfa is nowhere to be found. The boys catch Alfalfa in the company of Darla -- \"a girl!\" Alfalfa isn't like his friends because he's in love with Darla, and unfortunately threatens the very existence of their \"boys only\" club. The club's members try their hardest to break the two apart, eventually causing their beloved clubhouse to burn down. Darla is mistakenly led to believe Alfalfa feels ashamed of her, so she turns her attentions to Waldo, the new rich kid whose father is an oil tycoon. Further trouble ensures when their prized go-cart \"The Blur\" is stolen by local neighborhood bullies Butch and Woim. How can they win the big race and its prize trophy?! In addition to having to rebuild the clubhouse, the boys now need a new set of wheels. They band together to build \"Blur 2: The Sequel.\" Prior to race day, Spanky and Alfalfa reconcile and decide to ride in the two-seat go-kart together.",
    "In the magic realm of Coventry, the twin sisters Artemis and Apolla are saved by their protectors Illeana and Karsh from the Darkness and brought to another dimension. They are adopted by different families but in their twenty-first birthday, their protectors force them to meet each other. Alex Fielding lost her mother three months ago and is alone seeking a job while Camryn Barnes lives with her beloved wealthy parents. Once together they find that they have magic powers and they should return to Coventry to save their biological mother and their kingdom from the Darkness.",
    "Tim Avery is a cartoonist who loves his dog Odis. Then one day Odis finds a strange green mask. Then Tim puts it on and has a baby with his wife with the mask on. The baby then gets ahold of powers of the mask. Meanwhile Loki (Alan Cumming) must find the mask before Odin gets mad",
    "After Chicken Little causes widespread panic--when he mistakes a falling acorn for a piece of the sky--the young chicken is determined to restore his reputation. But just as things are starting to go his way, a real piece of the sky lands on his head. Chicken Little and his band of misfit friends, Abby Mallard (aka Ugly Duckling), Runt of the Litter and Fish Out of Water, attempt to save the world without sending the town into a whole new panic.",
    "A working-class family man, Christopher Robin, encounters his childhood friend Winnie-the-Pooh, who helps him to rediscover the joys of life.",
    "Swackhammer, owner of the amusement park planet Moron Mountain is desperate get new attractions and he decides that the Looney Tune characters would be perfect. He sends his diminutive underlings to get them to him, whether Bugs Bunny & Co. want to go or not. Well armed for their size, Bugs Bunny is forced to trick them into agreeing to a competition to determine their freedom. Taking advantage of their puny and stubby legged foes, the gang selects basketball for the surest chance of winning. However, the Nerdlucks turn the tables and steal the talents of leading professional basketball stars to become massive basketball bruisers known as the Monstars. In desperation, Bugs Bunny calls on the aid of Micheal Jordan, the Babe Ruth of Basketball, to help them have a chance at winning their freedom.",
    "Gordon Bombay is forced to withdraw from the minor hockey league with a knee injury. Much to his surprise, he is given the job of coach of Team USA Hockey for the Junior Goodwill Games in California. With most of the Ducks and a few new players in tow, he sets forth for LA. All appears to be going well for a while, but the hype of Hollywood starts to get to Gordon, and he is distracted when Iceland, the favourites to win the title, appear on the scene.",
    "Jack Conroy is a young gold hunter, who seeks gold in the enormous and the snowy deserts of Alaska. One day, he saved a mixed dog-wolf from the hands of a cruel man, and a brave friendship develops between the two. The dog-wolf, who is named \"the white fang\" for it's sharp and white teeth, was left alone after his mother was killed by a hunter. After a while, the white fang was taken from Jack, by a man who put him in an illegal dog fighting pen to fight other dogs. White Fang becomes a professional, experienced and a cruel killer. But unexpectedly after a long time Jack meets him again and they renew their friendship. When a group of criminals wants to steal Jack's gold, White Fang is the only one who can help him to fight them off.",
    "When an adorable baby boy is added to the Addams household, Wednesday and Pugsley do not hate the baby, they just aren't necessarily excited about his existence. Ok, yeah they do hate the baby. So Wednesday and Pugsley must get rid of the new addition one way or another. Meanwhile a new nanny is added to the household who overtakes Fester. The Addams must stop the nanny, but how?",
    "Charlie Brown, Snoopy, and the whole gang are back in a heartwarming story. A new girl with red hair moves in across the street, and Charlie Brown falls in love. Now he tries to impress the red haired girl to make her feel like he's a winner, but Charlie Brown just can't do anything right. At the same time, Snoopy is writing a love story about his continuing battles with The Red Baron. Then Charlie Brown has accomplished something never done before. He gets a perfect score on his standardized test, but there has been a mistake. Should he tell the truth and risk losing all of his newfound popularity? Can Charlie Brown get the girl to love him or will he go back to being a nothing?",
    "Louis Booker and Charlie Carbone are close friends with an association with the mob. After the duo botch a delivery of stolen TVs, the duo are given a second chance by mob leader Sal Maggio, who happens to be Charlie's stepfather. The duo are to deliver $50,000 to a contact in Australia. As simple as the job sounds, complications emerge when a kangaroo steals the money. Now Charlie and Louis must find the kangaroo and get the money back before they find themselves in a worse predicament.",
    "Allie Pennington, the daughter of two Knights-of-the-Round-Table scholars, begins classes at Avalon High where, new to the area, she slowly discovers herself involved in the prophecy of King Arthur's reincarnation. Her being there is no accident. The Order of the Bear, an ancient secret society awaiting Arthur's return, may be at hand, and Allie's own parents, if not members of the Order, are at least Order wannabes. Allie becomes quickly linked to two classmates: Will, the school's revered pretty-boy quarterback (whose girlfriend is having relations on the side with his best friend, and whose dark, brooding step-brother lurks about threateningly), is the most obvious Arthur candidate. Miles, the observant and witty school geek, suffers psychic flashes that always prove true and may be the reincarnation of Merlin. As the Arthur prophecy seems to indeed be unfolding before her, Allie finds herself in the protectorate role, guarding Will against the forces of Mordred who're out to destroy Arthur at his every appearance down the centuries, whose destruction would plunge the world into another Dark Age.",
    "Oscar Diggs ('James Franco'), a small-time circus magician with dubious ethics, is hurled away from dusty Kansas to the vibrant Land of Oz. At first he thinks he's hit the jackpot-fame and fortune are his for the taking. That all changes, however, when he meets three witches, Theodora (Mila Kunis), Evanora (Rachel Weisz), and Glinda (Michelle Williams), who are not convinced he is the great wizard everyone's been expecting. Reluctantly drawn into the epic problems facing the Land of Oz and its inhabitants, Oscar must find out who is good and who is evil before it is too late. Putting his magical arts to use through illusion, ingenuity-and even a bit of wizardry-Oscar transforms himself not only into the great and powerful Wizard of Oz but into a better man as well.",
    "Jack Skellington, the pumpkin king of Halloween Town, is bored with doing the same thing every year for Halloween. One day he stumbles into Christmas Town, and is so taken with the idea of Christmas that he tries to get the resident bats, ghouls, and goblins of Halloween town to help him put on Christmas instead of Halloween -- but alas, they can't get it quite right.",
    "Hillary Kramer, successful Perfume magnate awakes one morning to find that her accountant has robbed her blind and left for South America. Going through all of her remaining assets she finds a boxer, purchased as a tax write off. She decides to take Kid Natural, (Eddie Scanlon) who is much more at home giving driving lessons, into the ring and use him as her key to riches. Eddie thinks this will only get him killed and resists.",
    "Mr. Bean enters a church raffle and wins a vacation trip to France as well as a camcorder. After boarding a Eurostar train and arriving in Paris, the French language proves a barrier for Bean, as he struggles to get across the city to catch a train to the south of France from the Gare de Lyon. Taking time to order a meal, he finds the consumption of a seafood platter to be a challenge. Just before catching his train, he asks Emil, a Russian film director on his way to be a judge at the Cannes Film festival to use his camcorder to record his boarding, but accidentally causes Emil being left behind at the station. Bean attempts to cheer up the director's son Stepan as the train continues south but matters are made more hectic by the fact that Emil has reported his son to have been kidnapped and Bean losing his wallet and essential travel documents at a pay phone where he and Stepan attempt to contact Emil. Heading in the direction of Cannes, Bean finds himself in the cast and disrupting the flow of a commercial being shot by the egotistical director Carson Clay. He and Stepan finally hitch a ride with the young and vivacious actress Sabine who is heading to Cannes to attend the premiere of Clay's film, in which she appears. After Bean sneaks into the showing, his camcorder images are destined to enliven the proceedings.",
    "In this sparkling musical adventure, Barbie(TM) stars as Tory(TM), the kind-hearted princess of Meribella who would rather sing and dance than perform her royal duties. When her favorite pop star Keira(TM) visits the Kingdom, the girls discover they have much in common, including a magical secret that lets them look like one another. At first, swapping places seems like a great idea, until each girl realizes that the other's life isn't as easy as it seems! But Meribella also has a magical secret, and when it's stolen, the whole kingdom is put in danger. Will true friendship save the day? Filled with fantastic songs, fabulous fashions, and fun new friends, it's an exciting musical celebration that shows the best thing you can be is yourself.",
    "When 3 Muppet fans learn that Tex Richman wants to drill under the Muppet Theater for oil, Gary, Mary and Walter set out to find the Muppets who have been split up for years so that they can put on one last show and save the Muppet Theater. Kermit the Frog now lives in his own mansion depressed in Hollywood, 'The Great Gonzo' is a high class plumber at Gonzo's Royal Flush, Fozzie Bear performs with a tribute band called The Moopets, Miss Piggy is the plus-size fashion editor at Vogue Paris, and Animal is at a celebrity anger management rehab center in Santa Barbara.",
    "Buff sailor-man Popeye arrives in an awkward seaside town called Sweethaven. There he meets Wimpy, a hamburger-loving man; Olive Oyl, the soon-to-be love of his life; and Bluto, a huge, mean pirate who's out to make Sweethaven pay for no good reason. Popeye also discovers his long-lost Pappy in the middle of it all, so with a band of his new friends, Popeye heads off to stop Bluto, and he's got the power of spinach, which Popeye detests, to butt Bluto right in the mush. Watch as Popeye mops the floor with punks in a burger joint, stops a greedy tax man, takes down a champion boxer, and even finds abandoned baby Swee'pea. He's strong to the finish 'cause he eats his spinach!",
    "Now that Santa/Scott Calvin and Mrs. Claus/Carol Calvin have the North Pole running smoothly, the Counsel of Legendary Figures has called an emergency meeting on Christmas Eve! The evil Jack Frost has been making trouble, looking to take over the holiday! So he launches a plan to sabotage the toy factory and compel Scott to invoke the little-known Escape Clause and wish he'd never become Santa!",
    "Furious that her late father only willed her his gloomy-looking mansion rather than his millions, Carrigan Crittenden is ready to burn the place to the ground when she discovers a map to a treasure hidden in the house. But when she enters the rickety mansion to seek her claim, she is frightened away by a wicked wave of ghosts. Determined to get her hands on this hidden fortune, she hires afterlife therapist Dr. James Harvey to exorcise the ghosts from the mansion. Harvey and his daughter Kat move in, and soon Kat meets Casper, the ghost of a young boy who's \"the friendliest ghost you know.\" But not so friendly are Casper's uncles--Stretch, Fatso and Stinkie--who are determined to drive all \"fleshies\" away. Ultimately, it is up to Harvey and Kat to help the ghosts cross over to the other side.",
    "In Depression-era London, a now-grown Jane and Michael Banks, along with Michael's three children, are visited by the enigmatic Mary Poppins following a personal loss. Through her unique magical skills, and with the aid of her friend Jack, she helps the family rediscover the joy and wonder missing in their lives.",
    "Single mother goes away for the summer. The kids are first delighted but then find that Mom has hired the sitter from hell to stay with them. When the sitter dies of a sudden coronary they deposit the body at a mortuary only to discover all their summer expense money was in her purse. The kids must find a way to survive the summer without mom or her money. This means actual work!",
    "Grizz, Panda, and Ice Bear embark on an adventure to Canada after an agent from the Department of National Wildlife Control tries to put an end to their hi-jinx.",
    "Birth of a legend. Following King Richard's death in France, archer Robin Longstride, along with Will Scarlett, Alan-a-Dale and Little John, returns to England. They encounter the dying Robert of Locksley, whose party was ambushed by treacherous Godfrey, who hopes to facilitate a French invasion of England. Robin promises the dying knight he will return his sword to his father Walter in Nottingham. Here Walter encourages him to impersonate the dead man to prevent his land being confiscated by the crown, and he finds himself with Marian, a ready-made wife. Hoping to stir baronial opposition to weak King John and allow an easy French take-over, Godfrey worms his way into the king's service as Earl Marshal of England and brutally invades towns under the pretext of collecting Royal taxes. Can Robin navigate the politics of barons, royals, traitors, and the French?",
    "Under-age agents Juni and Carmen Cortez set out on their newest most mind-blowing mission yet: journeying inside the virtual reality world of a 3-D video game designed to outsmart them, as the awe-inspiring graphics and creatures of gaming come to real life. Relying on humor, gadgetry, bravery, family bonds and lightning-quick reflexes, the Spy Kids must battle through tougher and tougher levels of the game, facing challenges that include racing against road warriors and surfing on boiling lava, in order to save the world from a power hungry villain.",
    "King Randolph sends for his cousin Duchess Rowena to help turn his daughters, Princess Genevieve and her 11 sisters, into better ladies. But the Duchess takes away all the sisters fun, including the sisters favorite pastime: dancing. Thinking all hope is lost they find a secret passageway to a magical land were they can dance the night away. But what happens when their father suddenly turns ill? Will they be able to save him in time?",
    "Surrounded by the immense and furious ocean, a shipwrecked mariner battles all alone for his life with the relentless towering waves. Right on the brink of his demise, the man set adrift by the raging tempest washes ashore on a small and deserted tropical island of sandy beaches, timid animal inhabitants and a slender but graceful swaying bamboo forest. Alone, famished, yet, determined to break free from his Eden-like prison, after foraging for food and fresh water and encouraged by the dense forest, the stranded sailor builds a raft and sets off to the wide sea, however, an indistinguishable adversary prevents him from escaping. Each day, the exhausted man never giving up hope will attempt to make a new, more improved raft, but the sea is vast with wonderful and mysterious creatures and the island's only red turtle won't let the weary survivor escape that easily. Is this the heartless enemy?",
    "A band of kids embark on an epic quest to thwart a medieval menace.",
    "The story takes place on planet Baab where admired astronaut Scorch Supernova (Brendan Fraser) is a national hero to the blue alien population. A master of daring rescues, Scorch pulls off astonishing feats with the quiet aid of his nerdy brother, Gary (Rob Corddry), head of mission control at BASA.",
    "The turtles find out where the Ooze, the substance which made them mutate, came from. Unfortunately Shredder learns about it too, and uses it to enhance himself. So the turtles have to prove again who's the better ninja fighter.",
    "Dr. John Dolittle has the world in his hands: A beautiful wife at his side, two adorable daughters and a career that could not go better. One night, he nearly runs over a dog with his car. The dog yells \"bonehead\" and disappears. From then on, his childhood ability is back: To communicate with animals. Unfortunately, the word of Dolittle's ability is spreading quickly. Soon, many animals from rat to horse flock to his place to get medical advice. But his colleagues suspect he's going mad, and as the clinic Dolittle used to work for is about to being taken over for a huge amount of money, many decisions have to be made. Believe him? Put him into a mental institution? Sell the clinic? But also his family is close to breaking apart. Until a circus tiger falls seriously ill.",
    "When Number Five is sent from Newton and Stephanie's ranch to the big city to help Ben with his electronics business, he finds that his robotic talents are wanted by city low-life who want to turn Number Five into profits.",
    "It's Christmastime in Aldovia, and a royal baby is on the way. Amber and Richard host royals from a distant kingdom to renew a sacred truce, but when the treaty vanishes, peace is jeopardized and an ancient curse threatens their family.",
    "Maltazard, the Evil M, is now 7 feet tall and evolving among the humans, causing terror wherever he goes. His goal is simple: forming an army of giant henchmen and ruling over the universe. Meanwhile, Arthur is still a Minimoy, and thus in a state where he's unable to fend him off. With the help of Selenia and Betameche, he hatches a plan to regain his usual size: all they must do is infiltrate Arthur's house through the pipeworks, catch an electric train from his bedroom to his grandfather's study and find an elixir that will make him grow back to his human size. Sounds simple enough, if it weren't for Darkos, Maltazard's own son, hot on their tails.",
    "The teenager Sarah is forced by her father and her stepmother to babysit her baby brother Toby while they are outside home. Toby does not stop crying and Sarah wishes that her brother be taken by the Goblin King. Out of the blue, Toby stops crying and when Sarah looks for him in the cradle, she learns that he wish was granted and the Goblin King Jarethhas taken him to his castle in the Goblin City in the middle of a labyrinth. Sarah repents an asks Jareth to give Toby back; but the Goblin King tells that she has to rescue her brother before midnight, otherwise Toby will be turned into a goblin. Soon Sarah teams up with the coward goblin Hoggle, the beast Ludo and the knight Didymus and his dog Ambrosius in her journey. Will they rescue Toby in time?",
    "Sara wants to be a ballerina, but her dreams are cut short by the sudden death of her mother. She moves in with her father, who she has not seen for a long time. He lives on the other side of town, in a predominantly Black neighborhood. She gets transferred to a new school where she is one of the few White students there. She becomes friends with Chenille, and later, falls in love with Chenille's brother, Derek.",
    "Professor Shuri is a scientist looking for rare Pocket Monsters. He reads a storybook to his daughter Mi about the powerful Pokemon Entei. Shuri is currently searching for the heiroglyph Pokemon \"Unknown\". While searching through some ancient artifacts, Shuri awakens Unknown and is sucked into it. Mi next awakens Unknown while looking for her father. Unknown bonds with her and turns her mansion into a Crystal Tower. The crystallization begins to spread. Unknown lives to serve Mi and creates an Entei with the personality of her father to make her happy. When Mi next desires a mother, Entei kidnaps Satoshi's mother Hanako to give to Mi. Satoshi, Kasumi, Takeshi, and of course Pikachu set out to get her back.",
    "The fairies live in a peaceful place in the forest called Fern Gully which has been protected for many years by Magi, a wise fairy with strong powers. Her grand-daughter Crysta is a charming, beautiful fairy that is very intrigued about the world outside of Fern Gully. She along with the other fairies in the forest do not believe humans exist and are only in stories, until a crazy bat by the name of Batty, comes and tells them all these crazy stories about how he was captured by humans and experimented on. At first no one believes him except Crysta and she is determined to find out if humans are real. She goes to a place called Mount Warning, where the evil shadow of destruction Hexxus is known to be trapped, and finds a human named Zak. When he is almost crushed by a tree Crysta accidently shrinks him to fairy-size and he falls on a tree that is about to be devoured by \"The Leveller\". \"The Leveller\" is a wood cutting machine that has been cutting down every tree the humans have been putting red Xs on. Crysta saves Zak from \"The Leveller\" which she thinks is just a monster but she cannot properly un-shrink him. To avoid her being mad at him Zak tells her that the red Xs keep the monster back instead of what they are really there for, which is to pick which trees to cut down. They decide to take Zak to Magi so she can un-shrink him, on the way Zak sees the forest really for the first time with all its beauty and life. Back toward Mount Warning the humans have accidently released Hexxus who is set on destroying Fern Gully, he uses \"The Leveller\" to cut down all the trees to Fern Gully. When Crysta, Zak and Batty make it back to Fern Gully the fairies cannot believe the Zak is really a human and they all excited to see him and learn about him. The only one who is truly worried is Magi, she goes to check on the path to Fern Gully and sees that it is beginning destroyed and Hexxus is coming this way. She shows Crysta the red Xs and tells her the trees cannot be saved. With Hexxus drawing closer and closer to Fern Gully, Magi calls for all the fairies to come around to tells them of the danger. She uses the last of her magic to try and protect Fern Gully.",
    "Jellystone Park is celebrating its 100th anniversary, however it may be for the last time, because attendance is down and Mayor Brown wants to close the park and sell the land. If the park is closed, Yogi Bear and Boo Boo will lose their home. They join forces with Ranger Smith to save Jellystone from closing forever. Yogi must really prove in this endeavor that he is \"smarter than the average bear\".",
    "Barbie (Kelly Sheridan) shows that if you are kind, clever and brave, anything is possible in this tale of Clara (Kelly Sheridan) and her amazing Nutcracker (Kirby Morrow), who set off on an adventure to find the Sugarplum Princess.",
    "Get ready for Barbie A Fairy Secret, an amazing adventure with Barbie where she discovers there are fairies living secretly all around us! When Ken is suddenly whisked away by a group of fairies, Barbie's two fashion stylist friends reveal they are actually fairies and that Ken has been taken to a magical secret fairy world not far away! Barbie and her rival Raquelle take off with the fairy friends on an action-packed journey to bring him back. Along the way they must stick together and learn that the real magic lies not just in the fairy world itself, but in the power of friendship.",
    "Jimmy Neutron is a boy genius and way ahead of his friends, but when it comes to being cool, he's a little behind. All until one day when his parents, and parents all over Earth are kidnapped by aliens, it's up to him to lead all the children of the world to rescue their parents.",
    "Cyrano De Bergerac meets Cinderella. Over-worked, harried and terrified of being put back in foster care, 17 year old Katie (Lucy Hale) does her stepmother and step-siblings' bidding without complaining. Vocally gifted, Katie feels particularly upset when forced to lay down singing tracks so that her untalented stepsister, Bev Van Ravensway, can hopefully win a recording contract from Kensington Records - who's company President, Guy Morgan, is scouting for new spectacular talent at a talent showcase for the Performing Arts Department at a prestigious private school.",
    "Honey Daniels is a 22-year-old, sexy, tough-minded, part-black, part-Latina hip-hop dancer in New York's East Harlem who dreams of making it big as a music video choreographer. She teaches hip-hop dancing at a local youth center and encourages the local kids to attend to keep them off the streets and out of trouble. When luck shines on Honey in the form of a famous music video director, named Michael, who casts her in one music video, she's encouraged to make the transition from dancer to choreographer. But Honey's sudden success comes with a price when Michael refuses to take \"no\" for an answer to his sexual advances and then tries to sabotage her career by blackballing her out of the business.",
    "Optometrist Steve Finch loves those Christmas traditions he has set up with his family and his town. As such, he has a schedule of activities for his family starting on December 1st, and is the official unofficial consultant for anything Christmas related in his town of Cloverdale, Massachusetts. During the Christmas season, the Halls move in to the house across the street from the Finch's. The Halls in general are different in outlook and temperament than the Finches. Unlike Steve, Buddy Hall scams his way through life and never follows through with anything he starts. While Kelly Finch and Tia Hall - Steve's wife and Buddy's wife respectively - and their children begin friendships based largely on those differences, Steve and Buddy butt heads based on those differences. It begins with Buddy striving to have his house seen from outer space by decorating it as lavishly and brightly as possible. One of the results of Buddy's task his that he becomes the new go to guy for anything Christmas related in Cloverdale, usurping Steve's coveted position. As Steve and Buddy's open animosity grows, they may threaten the joy of Christmas for all, most specifically their families who have their own ideas of what they would like to do over the Christmas season.",
    "Timmy turns 23 and his godparents are fighting to keep him, while Crocker is still up to his nefarious schemes.",
    "A cosmic case of UFOs, intergalactic intrigue and out-of-this-world romance launches the Mystery Gang into their most unearthly adventure ever. Stranded in Roswell, New Mexico, the gang soon discovers the place crawls with UFO buffs, secretive scientists... and less-than-friendly alien invaders. Then after being chased by aliens and beamed aboard a UFO, Shaggy and Scooby-Doo fall head over heels in love with Crystal and Amber. The gang investigate the mysterious sightings which lead them to a government research base and a huge network of caves hidden under the town.",
    "Kim possible-not just an ordinary girl. She is a cheerleader and she saves the the world, even on school nights. With her sidekick, best friend and now new boyfriend and his naked mole rat (rufus) go through normal teenage life while saving the world. what else can she do!",
    "Following the tragic death of their five-year-old son Frankie, Irish couple Johnny and Sarah Sullivan and their remaining two offspring, 10 year old Christy Sullivan and 5 year old Ariel Sullivan, emigrate illegally to the United States via Canada with little in their pockets. Their final destination is Manhattan where Johnny hopes to work as a stage actor. They move into a unit in a run town tenement housed primarily with drug addicts, transvestites and one tenant coined \"the man who screams\". They do whatever they can to eke out a supportive family environment in this difficult situation, the support which ultimately extends to those around them, most specifically \"the screamer\" who turns out to be an African-American artist named Mateo with AIDS. But the memory of Frankie hangs over the family in good and bad ways, especially as Sarah learns she's pregnant. Christy, who records their life's goings-on with her beloved camcorder, believes that the angel of Frankie has granted her three wishes, which she guards until absolutely needed.",
    "Based on the real story of Christian, a specialist on wild goose migrations, and the adventure he and his son embarked.",
    "Stuart's mother is being over-protective of him, especially when he narrowly escapes injury in a soccer game. His big brother George has also made a new friend, Will, so Stuart is feeing lonely. Stuart rescues a canary, Margalo, from a falcon; she moves in with the Littles. One day, Margalo is nowhere to be found, so Stuart and Snowbell set out across the city to find her while George covers for Stuart (the first time he's had to lie).",
    "Former superhero Jack Shepard, (also known as Captain Zoom), is called back to work to transform an unlikely group of ragtag kids into a new generation of superheroes at a privacy Academy and save the world from certain destruction. The project holds an audition of would-be members, most of whom possess useless or disgusting powers. In the end, Dylan, a 17-year-old boy who can turn invisible Summer, a 16-year-old girl with telekinetic powers Tucker, a 12-year-old boy with the power to enlarge any part of his body Cindy, a 6-year-old girl with super strength.",
    "Barbie's modern adventure takes her to Paris, where she makes new friends and meets magical characters that discover their true designer talents and use their inner sparkle to save the day!",
    "A group of zoo animals decide to break their code of silence in order to help their lovable zookeeper find love, without opting to leave his current job for something more illustrious.",
    "Fievel is a young Russian mouse separated from his parents on the way to America, a land they think is without cats. When he arrives alone in the New World, he keeps up hope, searching for his family, making new friends, and running and dodging the cats he thought he'd be rid off.",
    "Arthur (aka Wart) is a young boy who aspires to be a knight's squire. On a hunting trip he falls in on Merlin, a powerful but amnesiac wizard who has plans for Wart beyond mere squiredom. He starts by trying to give Wart an education (whatever that is), believing that once one has an education, one can go anywhere. Needless to say, it doesn't quite work out that way.",
    "Born for adventure, Lea Clark heads deep into the Brazilian rainforest, where her most exciting story awaits.",
    "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
    "As Paleoclimatologist named Jack Hall is in Antartica, he discovers that a huge ice sheet has sheared off. But what he does not know is that this event will trigger a massive climate shift that will affect the world population. Meanwhile, his son Sam is with friends in New York to attend an event. There they discover that it has been raining non-stop for the past 3 days, and after a series of weather-related disasters begin to occur over the world, everybody realizes the world is entering a new Ice Age and the world population begins trying to evacuate to the warmer climates of the south. Jack makes a daring attempt to rescue his son and his friends who are stuck in New York and who have managed to survive not only a massive wave but also freezing cold temperatures that could possibly kill them.",
    "The town of Derry has a secret, but no one told the new kid. It's gonna be a long night.",
    "Martin Tweed is the host of a talent show called American Dreamz, and whilst he despises each new season, it's a hit with the ratings. Tweed decides it's time for a new and interesting batch of contestants, and sends out his team to find the weirdest bunch possible. Whilst all this is happening, the President of the United States is becoming more and more depressed, and relies on his Chief of Staff to talk him through everything, even into appearing as a judge on the TV show. Perfect news for the terrorists who use the talent contest as a way to reach the President.",
    "Dorothy Gale lives with her Auntie Em and Uncle Henry in a trailer park in Kansas. Dorothy has dreams of becoming a famous singer, but when a tornado hits Kansas and Dorothy rushes to save Toto, her prawn (she couldn't afford a dog), she is whisked away to Oz where she meets the four witches (all played by Miss Piggy) and the Munchkins of Oz (the rats). On her way to see the Wizard, she meets the Scarecrow (Kermit), the Tin Thing (Gonzo), and the Cowardly Lion (Fozzie) who all wish to have something given by the wizard. On their way to Emerald City, they are captured by the Wicked Witch of the West (of course, Miss Piggy) and her flying monkeys (other muppets). When they finally make it back to Emerald City, the Wizard is really a man from Hollywood. But he \"grants\" their wishes, but what they wanted they already had inside (there's a lesson there). When Dorothy finally is back in Kansas, she becomes what she had wanted, a famous singer and on the Muppets Star Search show.",
    "The passage from this world to the fantasy kingdom of Stormhold is through a breach in a wall beside an English village. In the 1800s, a boy becomes a man when he ventures through the breach in pursuit of a fallen star, to prove his love for the village beauty. The star is no lump of rock, it's a maiden, Yvaine. Tristan, the youth, is not the only one looking for her: three witches, led by Lamia, want her heart to make them young; and, the sons of the dead king of Stormhold want her because she holds a ruby that will give one of them title to the throne. Assisting Tristan are his mother, the victim of a spell, and a cross-dressing pirate of the skies. Will Tristan win his true love?",
    "Gordon Bombay, a hotshot lawyer, is haunted by memories of his childhood, when, as the star player in his champion hockey team, he lost the winning goal in a shootout, thereby losing the game, and the approval of his coach. After being charged for drunk driving, the court orders him to coach a peewee hockey team, the worst in the league, Gordon is at first very reluctant. However, he eventually gains the respect of the kids and teaches them how to win, gaining a sponsor on the way and giving the team the name of The Ducks. In the finals, they face Gordon's old team, coached by Gordon's old coach, giving Gordon a chance to face old ghosts.",
    "Angus the fluffy cat retains its dignity even in a crazy Eastbourne family, unlike them. Eldest daughter Georgia is completely besotted with 'Stiff Dylans' band hottie Robbie, who just moved in from London and helps run an organic groceries shop with his brother Tom, whom her best friend Jas has the hots for. Peter Dyer calls Georgia his best ever kissing-course pupil, but she ignores him and later the brothers' other classmate Dave the Laugh. Robbie was considering to dump haughty Lindsay, but reconsiders given the immature brat's apparent cruelty. Thus manipulative Georgia keeps changing her mind about a grand birthday party and her father's career opportunities as engineer in New Zealand, while mother seems to flirt with hunky interior decorator Jem.",
    "When a radio falls from the sky into the hands of a wide-eyed Tibetan Mastiff, he leaves home to fulfill his dream of becoming a musician, setting into motion a series of completely unexpected events.",
    "Young Danny Madigan is a big fan of Jack Slater, a larger-than-life action hero played by Arnold Schwarzenegger. When his best friend, Nick the projectionist, gives him a magic ticket to the new Jack Slater film, Danny is transported into Slater's world, where the good guys always win. One of Slater's enemies, Benedict the hitman, gets hold of the ticket and ends up in Danny's world, where he realises that if he can kill Schwarzenegger, Slater will be no more. Slater and Danny must travel back and stop him.",
    "When the coach of the France soccer team is killed by a poisoned dart in the stadium in the end of a game, and his expensive and huge ring with the diamond Pink Panther disappears, the ambitious Chief Insp. Dreyfus assigns the worst police inspector Jacques Clouseau to the case. His intention is to give a diversion to the press, while he uses his best men to chase the killer and thief. He assigns Gendarme Gilbert Ponton to work with Clouseau and inform each step of the investigation. When Clouseau is nominated with honor to the highest prize in France, Dreyfus decides to humiliate Clouseau and take him out of the case. However Clouseau has already solved the mystery.",
    "Greg and Rodrick don't get along, and his parents are fully aware of that. In order to help them get along, Greg's mother introduces Mom Bucks, which rewards them for getting along. But Rodrick isn't the only problem. He has to deal with any conflicts involving Holly Hills, as well as other embarrassing situations. Will Greg and Rodrick get along?",
    "Stuart Pearson heads with his family to spend a summer vacation in Creek Landing, Michigan, with his brother Nathan Pearson and his sons and their mother Rose in an old lake house they had rented. When the television has trouble with the image, Stuart's son Tom and the arrogant boyfriend of his sister Ricky Dillman go to the attic and then to the roof, where Tom meets his cousin Jake and they find the antenna dish totally destroyed. Sooner they discover four alien invaders that are preparing an invasion of the Earth that use a mind control weapon that only affects adults and they lock the quartet in the attic. Now they need to a find a way to force the adults to leave the house and discover the vulnerability of the invaders to plot a defense plan to save our planet.",
    "In a world filled with Mad Scientists and Evil Inventions, one talented evil scientist's hunch-backed lab assistant has big dreams of becoming a Mad Scientist himself and winning the annual Evil Science Fair.",
    "Nacho (Black) is a monastery cook, who spends his day feeding orphans and being overlooked by the monastery. When Sister Encarnación (Reguera) arrive at the monastery, Nacho realises that the only way to win her affection and to save the children, will be by competing as a Luchador wrestler.",
    "Based on the story of Cyrano de Bergerac, an awkward man speaks through another to the girl he loves. She falls for the words i.e. the lyrics.",
    "St Trinians proudly continues to represent the unacceptable face of British education. When the new Minister of Education announces he will personally sort the place out he doesn't realise either the enormity of the task or that the headmistress is an old flame. The school is anyway threatened with closure by their bank; with the staff clearly a waste of space the girls realise the responsibility to save the day falls on them. Perhaps ripping off the girl with the pearl earring (a painting by Johannes Vermeer) might be the way out?",
    "Susan Murphy (a.k.a. Ginormica) and the Monsters are now working with the US government as special ops. So when an alien presence is detected in Susan's hometown of Modesto, California -- right before Halloween -- the team is dispatched to investigate. Everything appears normal, right down to the jack-o-lanterns peering out from every doorstep and windowsill. But when Halloween arrives, those innocent-looking carved pumpkins reveal themselves for what they really are mutant aliens. The altered pumpkins then start to implement their fiendish plan to take over Earth. The Monsters are there to combat the mutant gourds and try to smash their wicked scheme!",
    "Using the latest technology the amazing lost world of the Cretaceous, Triassic and Jurassic periods of Earth's history, when the dinosaurs reigned supreme, is brought stunningly back to life. The series provides insights into how these mammoth creatures appeared, how they survived for millions of years and probes the mysteries of their sudden disappearance leaving only a fossil record to show they had ever existed!",
    "Ham III, the grandson of the first chimp astronaut, is blasted off into space by an opportunity-seeking senator. Soon, the fun-loving chimp has to get serious about the mission at hand; ridding a far-away planet of their nefarious leader. Fortunately for Ham III, two of his simian peers are along for the ride.",
    "As children, Prince Derek and Princess Odette are forced to spend their summers together by their widowed parents, who hope that the two will eventually fall in love and marry, so their two kingdoms will be united. As children and adolescents, Derek and Odette can't stand each other, but as young adults they begin to see each other in a different light and fall in love with each other. But one night things take a bad turn when Derek unintentionally offends Odette, who then refuses to marry him if he can't prove that he loves her for who she is and not just her beauty. Odette and her father are then attacked by Lord Rothbart, a vengeful sorcerer who was cast out of William's kingdom when he plotted against the king. In the form of a beast, Rothbart mortally wounds William, and kidnaps Odette then places her under a spell. Now it is up to Derek to rescue Odette by showing his undying love. But will he be in time?",
    "Scrooge McDuck, his dimwitted pilot Launch Pad, and his newphews Huey, Dewey and Louie, with Webby, arrive in Egypt where Scrooge finds the lost treasure of Collie Baba, unbeknownst to Scrooge, a magic lamp was included inside the treasure, so while the nephews have fun with the genie, they all have no idea that they're being stalked by a power hungry sorceror named Murlock and his dimwitted thief counterpart, Dijon.",
    "The story of sister and brother, Kate and Teddy Pierce, whose Christmas Eve plan to catch Santa Claus on camera turns into an unexpected journey that most kids could only dream about.",
    "Charming is an irreverent animated comedy about a young Prince with an irresistible appeal and one kick-ass maiden who wants him only for his money. Cursed as a child, Prince Philippe Charming compulsively proposes to every woman he encounters, leaving a trail of lovesick ladies and scorned lovers to wreak vengeful havoc on the Kingdom. Ultimately, Prince Philippe's exasperated father, King Charming, gives the young Prince an ultimatum... Find a true, true-love before his 21st Birthday or lose all claim to the throne.",
    "During an ordinary day in Hundred Acre Wood, Winnie the Pooh sets out to find some honey. Misinterpreting a note from Christopher Robin, Owl convinces Tigger, Rabbit, Piglet, Pooh, Kanga, Roo, and Eeyore that their young friend has been captured by a creature named \"Backsoon\", and they set out to save him.",
    "The action-packed new season of the franchise continues with the story of Tiny, an adorable Yorkie pup who, after winning the 'Pup Star' TV singing competition, is suddenly launched into an adventure when she's replaced by a street Yorkie, Scrappy, and the two swap lives in a dog-filled, fish-out-of-water tale that ultimately demonstrates life truly is 'better together.'",
    "While living the quiet life in a swamp, Kermit the Frog is approached by a Hollywood agent to audition for the chance of a lifetime. So Kermit takes this chance for his big break as he makes the journey to Hollywood. Along the way, Kermit comes across several quirky new friends including comedic Fozzie Bear, beautiful but feisty Miss Piggy and the Great Gonzo. But Kermit must also watch out for ruthless Doc Hopper, who plans to use him as his spokesman for his Frog Legs food chain.",
    "Thomas and Bea are now married and living with Peter and his rabbit family. Bored of life in the garden, Peter goes to the big city, where he meets shady characters and ends up creating chaos for the whole family.",
    "Adult siblings Sammy Prescott and Terry Prescott have had a special bond with each other since they were kids when their parents were tragically killed in a car accident. That bond is why single mom Sammy, who still lives in the family home in Scottsville, upstate New York with her eight year old son Rudy, is excited to hear that Terry, who she has not seen or heard from in a while, is coming home for a visit. That excitement is dampened slightly upon Terry's arrival, when she learns that he, broke, is only there to borrow money. As adults, Sammy, who works as a lending officer in the local bank, is seen as the responsible sibling, while unfocused Terry is seen as the irresponsible drifter. Regardless, Sammy welcomes what ends up being Terry's longer than planned visit if only so that he can help take care of Rudy, who has no adult male figure in his life. Rudy has never known his deadbeat biological father, with whom Sammy wants nothing to do. As Terry - acting as the supposed adult male role model figure - gets to know Rudy, and as Sammy deals with the issues in her life which includes figuring out what her relationship to longtime friend/lover Bob Steegerson means, and how to deal with her straight-laced micro-managing new boss Brian Everett, the maturity level between Sammy and Terry is not as far apart as it appears on the surface.",
    "Teen queen Lizzie McGuire grows up a bit and hits the big screen in this comedy drama, based on the popular Disney Network series. Lizzie McGuire and her best friends Kate, Gordo, and Ethan have just graduated from middle school, and to celebrate, they're taking part in a class trip to Rome, Italy. Eager to celebrate their new maturity as high school students, Lizzie and her pals hope to live it up in one of Europe's most fabled cities, but fate has something more spectacular in store for Lizzie. Lizzie discovers that she bears a striking resemblance to Isabella, an Italian teen-pop idol famous for her duets with heart-throb Paolo -- so much so that when Paolo and Isabella have a falling out, he asks Lizzie to take Isabella's place for an upcoming concert. Lizzie, however, isn't sure she feels comfortable stepping into the spotlight, and is even less sure about the way she feels about Paolo, who makes no secret of his infatuation with her. Things don't get any simpler for Lizzie when her family gets wind of her newfound fame, and catch the next flight to Italy.",
    "Based on the beloved children's novel by E.B. White, a young girl named Fern rescues a runty piglet, raises it as her own and names him Wilbur. However, after Wilbur grows into a pig, she is compelled to sell him to her Uncle Homer Zuckerman down the street. At Zuckerman's barn, Wilbur meets a host of animals and later learns from them that come winter, he will be slaughtered for food. Fearing for his life, Charlotte, a gentle and wise spider whom befriended the lonely Wilbur, vows to save his life.",
    "Rapunzel grapples with the responsibilities of being a princess and the overprotective ways of her father. While she wholeheartedly loves Eugene, Rapunzel does not share his immediate desire to get married and settle down within the castle walls. Determined to live life on her own terms, she and her tough-as-nails Lady-in-Waiting Cassandra embark on a secret adventure where they encounter mystical rocks that magically cause Rapunzel's long blonde hair to grow back. Impossible to break and difficult to hide, Rapunzel must learn to embrace her hair and all that it represents.",
    "Alex Hesse and Larry Arbogast are working on a new drug which will reduce the chances of a woman's body rejecting an embryo and thus causing a miscarriage. When their research funding is withdrawn, and human experimentation is denied to them, they decide to test the drug by breifly impregnating Hesse. Hesse however becomes attached to \"his\" unborn baby.",
    "Can you make a movie out of a video game? That's the question that is answered by this film. Mario Mario and Luigi Mario, two hard working plumbers find themselves in an alternate universe where evolved dinosaurs live in medium hi-tech squalor. They find themselves the only hope to save the Earth from invasion.",
    "Rapunzel and Flynn Rider have their wedding, but Pascal and Maximus must recover the rings they lose in mid-ceremony.",
    "A loyal dog and a vigilante cat embark on a space age voyage to find their way home.",
    "N/A",
    "Tigger goes looking through the hundred-acre-wood to find his family.",
    "Hiccup and Toothless reunite to remind both their kinds of the inseparable bond between vikings and dragons.",
    "A remake of the television series, Matthew Broderick stars as Gadget, who suffers an accident at the beginning of the film, and befriends Brenda, a robotic surgeon who repairs Gadget so that he can defeat the villain Claw. In the meantime, Gadget and Brenda fall in love.",
    "Blonde-haired diva Sharpay, finally has her own adventure, as she travels to New York City hoping to make it big. But Sharpay has a hard road ahead, when she realizes that in the real world, leading roles aren't handed over to talented teenagers on a silver platter.",
    "Professor Phillip Brainard, an absent-minded professor, works with his assistant Weebo, trying to create a substance that's a new source of energy and that will save Medfield College where his sweetheart Sara is the president. He has missed his wedding twice, and on the afternoon of his third wedding, Professor Brainard creates flubber, which allows objects to fly through the air. It looks like rubber, so he calls it flubber. This film is based on the 1961 Disney classic, \"The Absent-Minded Professor.",
    "Eleven-year-old New York City public school kids journey into the world of ballroom dancing and reveal pieces of themselves and their world along the way. Told from their candid, sometimes hilarious perspectives, these kids are transformed, from reluctant participants to determined competitors, from typical urban kids to \"ladies and gentlemen,\" on their way to try to compete in the final citywide competition. Providing unique insight into the incredible cultural diversity that is New York City, this film profiles several kids from three schools (out of 60) at this dynamic age, when becoming that \"cool\" teenager vies for position with familiar innocence, while they learn the merengue, rumba, tango, the foxtrot and swing.",
    "Sara joins Julliard in New York to fulfill her and her mother's dream of becoming the Prima ballerina of the school. She befriends her roommates, Zoe and Miles, who teach hip-hop classes. She has ballet classes with the rigid and famous Monique Delacroix that she idolizes - Monique requires full commitment, discipline and hard work from her students. When Miles, who is a composer, invites Sara to help him compose the music for the dance choreography Sara's passion for hip-hop is sparked and she also falls in love with Miles. When she is assigned to perform Giselle in an important event, she feels divided between the technique of the ballet and the creative work offered by Miles.",
    "Alex Rider thinks he is a normal school boy, until his uncle is killed. He discovers that his uncle was actually spy on a mission, when he was killed. Alex is recruited by Alan Blunt to continue the mission. He is sent to Cornwall to investigate a new computer system, which Darrius Sayle has created. He plans to give the new computer systems to every school in the country, but Mr. Blunt has other ideas and Alex must find out what it is.",
    "A dog finds the meaning of his own existence through the lives of the humans he meets.",
    "The Bakers, a family of 14, move from small-town Illinois to the big city after Tom Baker gets his dream job to coach his alma mater's football team. Meanwhile, his wife also gets her dream of getting her book published. While she's away promoting the book, Tom has a hard time keeping the house in order while at the same time coaching his football team, as the once happy family starts falling apart.",
    "When an alien with amazing powers crash-lands near Mossy Bottom Farm, Shaun the Sheep goes on a mission to shepherd the intergalactic visitor home before a sinister organization can capture her.",
    "From producer Guillermo del Toro and director Jorge Gutierrez comes an animated comedy with a unique visual style. THE BOOK OF LIFE is the journey of Manolo, a young man who is torn between fulfilling the expectations of his family and following his heart. Before choosing which path to follow, he embarks on an incredible adventure that spans three fantastical worlds where he must face his greatest fears. Rich with a fresh take on pop music favorites, THE BOOK OF LIFE encourages us to celebrate the past while looking forward to the future.",
    "A wonderful adaptation of the Charles Dickens's classic, A Christmas Carol. An overexcited Roo, along with Pooh, Piglet, Tigger and Eeyore, pay Rabbit a visit to celebrate Easter. But instead of finding an Easter party they find a Spring Cleaning day celebration. Rabbit refuses to celebrate Easter and a very disappointed Roo tries to cheer him up. How can they celebrate Easter without the Easter Bunny? Past, present and future intertwine in this marvelous movie, as the characters jump from page to page, teaching everyone a very valuable lesson.",
    "Courgette (Zucchini) is an intriguing nickname for a 9-year-old boy. Although his unique story is surprisingly universal. After his mother's disappearance, Courgette is befriended by a police officer Raymond, who accompanies him to his new foster home filled with other orphans his age. At first he struggles to find his place in this strange, at times, hostile environment. Yet with Raymond's help and his new-found friends, Courgette eventually learns to trust and might find true love.",
    "When mankind is about to come to an end, a group of scientists decide to create and populate a city deep underground. The city of Ember is to last for 200 years after which its inhabitants are to retrieve from a strong box instructions to return to the surface. Over time however, the message is lost and life in Ember is rapidly deteriorating. Their power supply is failing and food is being rationed. It's left to two young adults to unearth the secret of Ember and to lead the way out.",
    "Astérix and Obélix compete at the Olympics in order to help their friend Lovesix marry Princess Irina. Brutus also tries to win the game with his own team and get rid of his father Julius Caesar.",
    "In the island kingdom of Flutterfield, in the wondrous land of Fairytopia, the butterfly-winged fairies fly carefree high into the blue sky. Unfortunately though, Henna, Flutterfield's Queen envious attendant, without remorse, poisons her with the intention to take over the entire kingdom. As a result, the precious shimmering lights that keep safe the helpless and fragile fairies from the claws of the Skeezites, a tribe of ravenous nocturnal flying monsters, are now beginning to flicker, in grave danger of forever going out. Inevitably, knowing that if Queen Marabella perishes, all the fairies will be left unprotected, courageous Mariposa and her trustworthy fairy-friends Rayna and Rayla will have to undertake a perilous journey far away from Fairytopia's protective boundaries in search of a potent antidote. Hurry up fairies.",
    "A 12-year-old boy goes missing in 1978, only to reappear once more in 1986. In the eight years that have passed, he hasn't aged. It is no coincidence that at the time he \"comes back\", a flying saucer is found, entangled in power lines.",
    "Scrat, Manny, Sid, Diego and the rest of your prehistoric pals from Ice Age are back for an all-new hilarious animated adventure! Business is booming at Sid's new egg-sitting service but when the dastardly pirate bunny Squint steals the eggs, Manny, Diego, and the rest of the gang take off on a daring rescue mission that turns into the world's first egg hunt.",
    "Family man Phil Weston, a lifelong victim of his father's competitive nature, takes on the coaching duties of a kids' soccer team, and soon finds that he's also taking on his father's dysfunctional way of relating.",
    "Dizzy Harrison is an unpopular, high school geek going through a hellish senior year. In an attempt to make a new identity for himself, Dizzy gets himself expelled from his high school, learns the technics of being cool from a prison inmate, and enrolls at a new high school under the alias Gil Harris, to make new friends where he soon gains respect from the jocks and geeks alike. Dizzy then gets noticed by the head cheerleader, Danielle, and helps the school football team gain self-respect to win games. But things unknowingly begin to turn sour when Danielle's disgruntled boyfriend begins investigating into \"Gil Harris'\" past to uncover any dirt on him.",
    "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
    "Jim Morris is a Texas high school chemistry teacher and coach of the school's baseball team. He's always loved baseball and as a way of motivating his players, he agrees to go to a professional try-out if they win the championship. He once had aspirations to be a professional baseball player but an injury brought that to an end. Sure enough, the 39 year-old father of three finds himself at a camp for the Tampa Bay Devil Rays and he somehow seems to have regained his pitching arm, easily throwing a 98 mph fastball. Signed to a contract, he toils in the minor leagues while his supportive wife stays home raising their children. He soon finds himself called up to the big club and pitching for Tampa which is in Texas playing the Rangers. Based on a true story.",
    "A retelling of the classic Dickens tale of Ebenezer Scrooge, miser extraordinaire. He is held accountable for his dastardly ways during night-time visitations by the Ghosts of Christmas Past, Present, and future.",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "Some time after the Mousekewitz's have settled in America, they find that they are still having problems with the threat of cats. That makes them eager to try another home out in the west, where they are promised that mice and cats live in peace. Unfortunately, the one making this claim is an oily con artist named Cat R. Waul who is intent on his own sinister plan. Unaware of this, the Mousekewitz's begin their journey west, while their true cat friend, Tiger, follows intent on following his girlfriend gone in the same direction.",
    "Wayne Szalinski is at it again. But instead of shrinking things, he tries to make a machine that can make things grow. As in the first one, his machine isn't quite accurate. But when he brings Nick & his toddler son Adam to see his invention, the machine unexpectedly starts working. And when Adam comes right up to the machine, he gets zapped along with his stuffed bunny. Now, whenever Adam comes near anything electrical, the electricity causes him to grow. Adam soon starts to grow to the height of over 100 feet. And he is now walking through Las Vegas which he thinks is one big play land.",
    "Divorcee Scott Calvin is disgusted to learn that his ex and her husband have tried - and failed - to break it easy to their 6-year-old son Charlie that Santa isn't real. On Christmas Eve, Scott reads The Night Before Christmas... then receives an unexpected visitor on his roof. When he's startled by Scott's calling out and falls, the Santa impersonator disappears, leaving only an 8-reindeer sleigh and a suit with instructions to put it on if he's involved in an accident. Scott does, and is transported around the town dropping gifts through chimneys until he's taken to the North Pole and informed by a group who claim they're elves that he is now Santa. Charlie is proud of his dad's new job, though Scott's convinced it's a dream. Until his hair turns white, his beard refuses to stay shaved, he gains weight inexplicably, even for his sudden love of junk food... Now he's accepted it, there's just one problem: how to keep it secret from his disbelieving family?",
    "A young girl from London moves to Africa with her parents where she befriends a lion cub.",
    "N/A",
    "Phileas Fogg was passionately in love with Belinda Maze, whose uncle, Lord Maze, sternly disapproved of the commoner Fogg marrying his niece. Fogg proposed a wager: if he could travel ...",
    "A group of tenants in an apartment block are being forced to move out so that it can be demolished. The tenants are reluctant to move, so the developers hire a local gang to 'persuade' them to leave. Fortunately, visiting alien mechanical life-forms come to town. When they befriend the tenants, the aliens use their extraterrestrial abilities to defeat the developers.",
    "N/A",
    "Fun and talented animal fairy Fawn believes you can't judge a book by its cover, or an animal by its fangs, so she befriends a huge and mysterious creature known as the NeverBeast. While Tinkerbell and her friends aren't so sure about this scary addition to Pixie Hollow, the elite Scout Fairies set out to capture the monster before he destroys their home. Fawn must trust her heart and take a leap of faith if she hopes to rally the girls to save the NeverBeast.",
    "In a place far, far away, illegal genetic experiment #626 is detected: Ruthless scientist Dr. Jumba Jookiba has created a strong, intelligent, nearly indestructible and aggressive being with only one known weakness: The high density of his body makes it impossible for the experiment to swim in water. The scientist is sentenced to jail by the Grand Council of the Galactic Federation. The experiment is supposed to be transported to a prison asteroid, yet manages to escape Captain Gantu, who was supposed to deliver him there. With a stolen police cruiser (the red one), the destructive being races towards a little and already doomed planet: Earth. Stranded on Hawaii, experiment #626 can't actually do much harm: water all around, no big cities and two well-equipped representatives of the Galactic Federation already following close behind to catch him again. But Dr. Jookiba and the Earth expert Pleakley never could have guessed that earth girl Lilo adopts the experiment as dog, gives him the name Stitch and actually causes an emotional development in the little beast. Her dysfunctional family, consisting only of Lilo and her sister Nani, is about to be ripped apart by social worker Cobra Bubbles. Stitch as the new family member brings quite some action into all their lifes, and after a while, not even Pleakley and Dr. Jookiba can recognize their former target. But how shall they bring the news of failure to the Grand Councilwoman without being punished?",
    "N/A",
    "Dexter Reed, a high-schooler is forced to get a summer job at a fast food restaurant called Good Burger after causing a car wreck by his school teacher Mr. Wheat. So Dexter must pay off his teacher's car by working very hard at Good Burger. Meanwhile things turned worse when Mondo Burger, a mammoth fast-food chain opens across the street, it looks like Good Burger is soon going to be history for good! Now it is up to Dexter and his new friend Ed the not-so bright cashier to save the day, as they develop a delicious special secret sauce that Ed created brings hundreds of new customers to their door and makes their new competition desperate to steal the recipe and all of their customers.",
    "Charlie and Dan have been best friends and business partners for thirty years and their Manhattan public relations firm is on the verge of a huge business deal with a Japanese company. With two weeks to sew up the contract, Dan gets a surprise; a woman he married on a drunken impulse nearly nine years before (annulled the next day) shows up to tell him he's the father of her twins, now seven, and she'll be in jail for 14 days for a political protest. Dan volunteers to keep the tykes, although he's uptight and clueless. With Charlie's help is there any way they can be dad and uncle, meet the kids' expectations, and still land the account?",
    "When Lex Luthor gets elected US President, he uses the threat of an oncoming kryptonite meteor striking Earth as a rationale to frame Superman.",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "A mechanic learns that his daughter, whom he thinks is at college, has dropped out. He tries to call her but, when someone else answers the phone, he goes to where she's staying and finds a photo of his daughter with another girl, so he looks for her and asks her where his daughter is. She says that his daughter hooked up with a guy who's from New Orleans. So they go there to find him. When some men refuse to answer his questions they beat him but he fights back, which the girl is amazed that he can do. Eventually they find the guy who tells them where his daughter might be. While on their way some men shoot at them. He learns that they work for a man named Omar who wants him. He still tries to find his daughter while Omar sends his best men to get him.",
    "The story of the Buckman family and friends, attempting to bring up their children. They suffer/enjoy all the events that occur: estranged relatives, the \"black sheep\" of the family, the eccentrics, the skeletons in the closet, and the rebellious teenagers.",
    "It's night; crickets chirp outside an isolated farmhouse. A bright light from a spacecraft shines through a bedroom window and lifts a sleeping man. However, the light and the small alien controlling it from the ship are unable to pull the man through the window: first it's the glass that impedes them. The alien frets; its supervisor - large, laconic, and green - watches. As the human keeps sleeping, the alien's tries every lever. Just as it looks as if the alien abduction will succeed, something goes wrong. The supervisor steps in.",
    "In Shrek the Halls, it is seen and realized that Shrek has no idea about what Christmas is and makes it clear to donkey that \"Ogres don't celebrate Christmas\",but in the end he gives in and decides to prepare for Christmas in his own \" ogre\" way. With the help of Fiona and their kids, he eventually gets ready for Christmas but there is a twist in the story but finally everything turns out fine",
    "Mumble the penguin has a problem: his son Erik, who is reluctant to dance, encounters The Mighty Sven, a penguin who can fly! Things get worse for Mumble when the world is shaken by powerful forces, causing him to brings together the penguin nations and their allies to set things right.",
    "A bomb-sniffing beagle is fired from the mayor's office for a faux pas. That night a mad scientist dognaps him and injects him with an elixir. The dog escapes, but now has superpowers. He's adopted by a security guard - an ex-cop, who's a widower with a moody teen son, Jack. The boy discovers that the dog, named Shoeshine by dad, has super powers, but it's their little secret. While Underdog saves people in distress, the mad scientist and his underling continue their plot to catch him and take over the city. There's also a girl Jack likes who has a dog that Shoeshine takes a shine to. Will every dog have his day?",
    "As the story begins, an alliance of evil fairy tale-doers, led by Frieda, looks to take over Fairy Tale Land and take control of. But when Ella A.K.A. Cinderella realizes her own evil stepmother is out to ruin her storybook existence, she takes a dramatic turn and blossoms into the leader of the resistance effort.",
    "Admiral Frank Beardsley returns to New London to run the Coast Guard Academy, his last stop before a probable promotion to head the Guard. A widower with eight children, he runs a loving but tight ship, with charts and salutes. The kids long for a permanent home. Helen North is a free spirit, a designer whose ten children live in loving chaos, with occasional group hugs. Helen and Frank, high school sweethearts, reconnect at a reunion, and it's love at first re-sighting. They marry on the spot. Then the problems start as two sets of kids, the free spirits and the disciplined preppies, must live together. The warring factions agree to work together to end the marriage.",
    "The film tells the story of Will Stanton, a young man who learns he is the last of a group of warriors who have dedicated their lives to fighting the forces of the Dark. Traveling back and forth through time, Will discovers a series of clues which lead him into a showdown with forces of unimaginable power. With the Dark once again rising, the future of the world rests in Will's hands.",
    "The Muppets are back into action in another movie based on a novel written by Robert Louis Stevenson. Kermit the Frog and his colleagues go on a warfare against ruthless pirates. They also share their problem-solving journey on sea to rescue a treasure.",
    "The director of _Quest for Fire_ creates yet another film in nature with almost no human dialogue in this picturesque story of an orphaned bear cub who is adopted by an adult male bear and must avoid hunters. Bart the Bear stars in this anthropomorphic fantasy.",
    "Arthur Christmas reveals the incredible, never-before seen answer to every child's question: 'So how does Santa deliver all those presents in one night?' The answer: Santa's exhilarating, ultra-high-tech operation hidden beneath the North Pole. But at the center of the film is a story about a family in a state of comic dysfunction and an unlikely hero, Arthur, with an urgent mission that must be completed before Christmas morning dawns.",
    "Flush with their revival's success, Kermit the Frog and his friends are approached by Dominic Badguy to go on a world tour. Unknown to them, this is all part of the sinister plan of Constantine, the world's most evil frog, to become the greatest thief of all time. After making sure that Kermit is jailed as himself, Constantine impersonates him to use the Muppets' tour as cover for his scheme. While Sam the Eagle and Inspector Jean Pierre Napoleon investigate, the Muppets find their boss seems strangely changed even as Kermit desperately attempts to escape to stop the impostor. Only when Walter, Fozzie and Animal realize the truth is there a chance to prevent Constantine from pulling off the crime of the century.",
    "A young boy named Max has an active imagination, and he will throw fits if others don't go along with what he wants. Max - following an incident with Claire (his sister) and her friends, and following a tantrum which he throws as a result of his Mother paying more attention to her boyfriend than to him - runs away from home. Wearing his wolf costume at the time, Max not only runs away physically, but runs toward a world in his imagination. This world, an ocean away, is inhabited by large wild beasts, including one named Carol who is much like Max himself in temperament. Instead of eating Max like they normally would with creatures of his type, the wild things befriend Max after he proclaims himself a king who can magically solve all their problems.",
    "Dr. Elena Kinder and Dr. Heap work for BABYCO, the world's leading manufacturer in baby products. What the public doesn't know, however, is that Dr. Kinder and Dr. Heap are secretly working on cracking the code to \"baby talk\" which is actually a highly sophisticated language which allows babies to communicate the knowledge of the secrets of the universe with which they are born. Problems arise when Sly, the smartest of the babies, escapes from the lab and unites the babies of the outside world to help free the babies trapped in the lab. Kinder and Heap must find Sly before it is too late.",
    "In 1840s Boston when old man Flagg dies he leaves only debts behind. His grandson, Jack Flagg, dreamy and adventurous plans to run away from home and sneak aboard a sailing ship bound for gold-rich California. When his absence is discovered by his sister Arabella a frantic search ensues. Jack manages to board a California-bound ship where he meets crooked Judge Higgins and other characters. Fortunately for Jack his trusted and loyal butler, Bullwhip Griffin, has followed him on the ship. The two finally disembark in San Francisco and immerse themselves into the crazy world of California's gold rush. Jack Flagg's sister Arabella worries about her brother and decides to go to California herself to find Jack and their butler.",
    "A young boy, recently orphaned, is taken to England by his grandmother. At a hotel in which they are staying, a group of witches have gathered to prepare a plot to rid England of all children.",
    "With one coin to make a wish at the piazza fountain, One Man Band tells the humorously captivating tale of a peasant girl who encounters two competing street performers who'd prefer the coin find its way into their tip jars. As the two one-man bands' rivalry crescendos, the two overly eager musicians vie to win the little girl's attention.",
    "Two stories. The Wind in the Willows: Concise version of Kenneth Grahame's story of the same name. J. Thaddeus Toad, owner of Toad Hall, is prone to fads, such as the newfangled motor car. This desire for the very latest lands him in much trouble with the wrong crowd, and it is up to his friends, Mole, Rat and Badger to save him from himself. - The Legend of Sleepy Hollow: Retelling of Washington Irving's story set in a tiny New England town. Ichabod Crane, the new schoolmaster, falls for the town beauty, Katrina Van Tassel, and the town Bully Brom Bones decides that he is a little too successful and needs \"convincing\" that Katrina is not for him.",
    "A boy named Walter is dropped by his mother Mae at his great-uncles' house. Later,Walter will find out his great-uncles' big secret. And rumors say that Hub & Garth, Walter's great uncles, have stolen much gold & money. (some say they stole it from Al Capone) Did they really steal that money or not?",
    "It's been 5 years since socialite Ursula Stanhope left civilization to marry George, lovable and clumsy King of the Jungle. Now father to George Junior, George finds himself stressed at having to juggle his cherished roles of jungle king, Junior's dad, and Ursula's loving husband. George's stress level goes way up when Really Mean Lion challenges him for leadership of the jungle, and Ursula's mother Beatrice teams up with Ursula's ex-fiance Lyle in a plot to forcibly take away all that George holds most dear.",
    "Gwen has just discovered, that she's the final member of the secret time-traveling Circle of Twelve. Now she has to juggle with constant trips to the past, her relationships with Gideon and figuring out dark secrets surrounding the Circle.",
    "Based on the true story of a small-town Indiana team that made the state finals in 1954, this movie chronicles the attempts of a coach with a spotty past, and the town's basketball-loving drunk to lead their high school team to victory.",
    "A precocious thirteen-year-old boy is forced to keep \"books\" by his accountant father and is pushed to extremes when his dad orders an \"audit\".",
    "A feisty foster kid's outrageous scheme to be reunited with her birth mother has unintended consequences in The Great Gilly Hopkins, an entertaining film for the entire family. Gilly Hopkins (Sophie Nélisse) has seen more than her share of foster homes and has outwitted every family she has lived with. In an effort to escape her new foster mother Maime Trotter's (Kathy Bates) endless loving care, Gilly concocts a plan that she believes will bring her mother running to her rescue. But when the ploy blows up in Gilly's face it threatens to ruin the only chance she's ever had to be part of a real family. Based on the award-winning young-adult novel by Katherine Paterson (Bridge to Terabithia), The Great Gilly Hopkins stars Sophie Nélisse, Kathy Bates, Julia Stiles, Bill Cobbs, Billy Magnussen, with Octavia Spencer and Glenn Close.",
    "A family in route to New Guinea is shipwrecked on a deserted tropical island. They are forced to remain on the island because of the damage to the ship and the pirates that are roaming the islands. They create a home on the island (centering around a huge tree house) and explore the island and its wildlife. Plenty of adventure ensues as the family deals with issues of survival and pirates, and the brothers must learn how to live on the island with an uncertain future.",
    "Kermit and Fozzie are newspaper reporters sent to London to interview Lady Holiday, a wealthy fashion designer whose priceless diamond necklace is stolen. Kermit meets and falls in love with her secretary, Miss Piggy. The jewel thieves strike again, and this time frame Miss Piggy. It's up to Kermit and Muppets to bring the real culprits to justice.",
    "Steven thinks his time defending the Earth is over, but when a new threat comes to Beach City, Steven faces his biggest challenge yet.",
    "When Jane and Michael, the children of the wealthy and uptight Banks family, are faced with the prospect of a new nanny, they are pleasantly surprised by the arrival of the magical Mary Poppins. Embarking on a series of fantastical adventures with Mary and her Cockney performer friend, Bert, the siblings try to pass on some of their nanny's sunny attitude to their preoccupied parents.",
    "An orphaned brontosaurus named Littlefoot sets off in search of the legendary Great Valley. A land of lush vegetation where the dinosaurs can thrive and live in peace. Along the way he meets four other young dinosaurs, each one a different species, and they encounter several obstacles as they learn to work together in order to survive.",
    "All the characters of the warm and fluffy \"Lilo and Stitch\" are back! In \"Stitch! - The Movie\", Stitch, Jumba, and Peakley are all living with Lilo and Nani. But no one knows that Jumba had secretly deactivated all 625 of his other experiments and brought them with him. The ex-captain Gantu, hired by Jumba's former partner, Dr. Jacques Von Hamsterveil, goes to find them, and captures Jumba to interrogate him into telling where they are. Now, Lilo and Stitch have to save Stitch's ohana from being used for chaos. Two experiments are activated in this movie: Experiment 221, \"Sparky\", with the ability to cause big electric surges, and Experiment 625, who has all the abilities of Stitch, but is lazier. At least he makes good sandwiches!",
    "When Shaggy and Scooby win tickets to WrestleMania, the entire gang travels in the Mystery Machine to WWE City to attend the epic event. However, when a mysterious ghostly bear appears and threatens to ruin the show, Scooby, Shaggy, Velma, Daphne and Fred work with WWE Superstars to solve the case.",
    "At night, all around town, Mater the disheveled tow truck is causing havoc, playing tricks, disturbing the peace, and scaring other motor vehicles. At Flo's V-8 café, the local cop car warns Mater about the ghostlight, a legendary orb of blue that haunts these parts. The cop car tells the story and warns one and all that the ghostlight hates the sound of clanking metal. All the cars rush home, leaving only Mater, whistling past the graveyard, alone at his junkyard. Then, a blue light appears; can Mater save himself or is there more to the story?",
    "Teddy Duncan's middle-class family embarks on a plane flight from their Denver home to visit Mrs. Duncan's parents, the Blankenhoopers, in Palm Springs - all except daughter Teddy and mother Amy, for whom a cross country odyssey begins when a chance at free plane fare leads to a curtailed bus ride, a nightmarish experience in a Yugo, hitchhiking with a pair of alien abductees, and peddling through the desert on a tandem bike. All the while, the male Duncans survive a zany Christmas with Grandpa and Grandma Blankenhooper.",
    "Barbie tells on a new story, Thumbelina. A story about a fairy who befriend a human girl, and both cooperate their strength in an attempt to save the fairies trees.",
    "Another planet, another time. 1000 years ago the mysterious Dark Crystal was damaged by one of the Urskeks and an age of chaos has began! The evil race of grotesque birdlike lizards the Skeksis, gnomish dragons who rule their fantastic planet with an iron claw. Meanwhile the orphan Jen, raised in solitude by a race of the peace-loving wizards called the Mystics, embarks on a quest to find the missing shard of the Dark Crystal which gives the Skesis their power and restore the balance of the universe.",
    "This theatrical movie based on the television series (which was also based on a popular multiform robot toyline) did not go over very well at the box office. The movie takes place in 2005, twenty years after the television series, and chronicles the efforts of the heroic Autobots to defend their homeworld Cybertron from the evil Decepticons. Both factions are seething with anger, and that hatred has blinded them to a hideous menace headed their way. That hideous menace is the colossal planet known as Unicron, who has been ready to consume anything that stands in its way. The only thing that can stop Unicron is the Autobot Matrix of Leadership, which is possessed by the Autobots and which the Decepticons, through Unicron's orders, plan to take away from them.",
    "A young boy's wardrobe contains a time hole. Through this hole an assortment of short people (i.e. dwarfs) come while escaping from their master, the supreme being. They take Kevin with them on their adventures through time from Napoleonic times to the Middle Ages to the early 1900s, to the time of Legends and the Fortress of Ultimate Darkness where they confront Evil.",
    "Calvin and his friends, who all live an in orphanage, find old shoes with the faded letters MJ connected to a powerline. One stormy night, they go to get the shoes when Calvin and the shoes are struck by lightning. Calvin now has unbelievable basketball powers and has the chance to play for the NBA.",
    "Sixteen-year-old Zoey Stevens, a skilled dancer and straight-A student, is having a hard time adjusting to a new high school, a new and klutzy dance squad, a new step-dad, three new rowdy step-brothers and an unruly dog, but things change when a dog training app on her smart phone begins to somehow control all the boys around her.",
    "A father and daughter form an unlikely songwriting duo in the summer before she leaves for college.",
    "When Cleatus can't play the school mascot, Pete has to secretly do the job.",
    "The sequel is filled with 'Cheetah-style' adventure, drama and humor. The escapade begins when Galleria enters the group in a Barcelona music festival, and the spirited foursome (escorted by Galleria's protective mom Dorothea and Chanel's mother Juanita) embarks on a journey of a lifetime. But things get way more complicated once the four best friends arrive in España: they meet Marisol, a talented solo singer and her manager/mother Lola, who unknown to the Cheetahs, may lead their group to break up; they are shown the sights by Joaquin, a handsome young tango dancer who falls for Dorinda; the fashion bug bites aspiring designer Aquanette; Chanel questions the future of her mother and Luc's relationship; Galleria begins to lose faith in the Cheetah Credo; and the Cheetahs' dream of becoming stars may be dashed forever when they are informed they've broken a stringent festival rule.",
    "In Sony Pictures Animation's THE STAR, a small but brave donkey named Bo yearns for a life beyond his daily grind at the village mill. One day he finds the courage to break free, and finally goes on the adventure of his dreams. On his journey, he teams up with Ruth, a lovable sheep who has lost her flock and Dave, a dove with lofty aspirations. Along with three wisecracking camels and some eccentric stable animals, Bo and his new friends follow the Star and become accidental heroes in the greatest story ever told - the first Christmas.",
    "Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his beaming honker, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector. They run into the Abominable Snowman and find a whole island of misfit toys. Rudolph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in. But when Santa looks over Rudolph, he gets a very bright idea...",
    "From a riddle-speaking butterfly, a unicorn learns that she is supposedly the last of her kind, all the others having been herded away by the Red Bull. The unicorn sets out to discover the truth behind the butterfly's words. She is eventually joined on her quest by Schmendrick, a second-rate magician, and Molly Grue, a now middle-aged woman who dreamed all her life of seeing a unicorn. Their journey leads them far from home, all the way to the castle of King Haggard...",
    "A man receives a distressing phone call from a woman who has been kidnapped.",
    "From BBC Earth Films, the studio that brought you Earth, comes the sequel - Earth: One Amazing Day, an astonishing journey revealing the awesome power of the natural world. Over the course of one single day, we track the sun from the highest mountains to the remotest islands to exotic jungles. Breakthroughs in filmmaking technology bring you up close with a cast of unforgettable characters. Told with humour, intimacy and a jaw-dropping sense of cinematic splendour, Earth: One Amazing Day highlights how every day is filled with more wonders than you can possibly imagine- until now.",
    "Disney version of fairy tale \"Jack and the Beanstalk\", featuring Mickey, Donald, and Goofy in the main roles. Also contains another short film, re-released as \"Bongo\".",
    "One year later, agent Cody Banks is back for another awesome adventure but this time he must track down a former instructor who's gone rogue with a mind-control microchip. Banks masquerades as a musical prodigy to get close to a snobby, egocentric scientist in London who's the only person who can make the microchip work. Along the way Banks hooks up with a demoted agent and a cute-as-a-bug Scotland Yard operative. When Agent Cody Banks heads to England to catch an evil scientist who's stolen a mind-control device for his plot to rule the world and turning the world leaders into zombies!",
    "A comedy/sci-fi/adventure about three high school kids who invent a 10 minute time machine to spare others just like them from the humiliation they've endured.",
    "Jack Conroy is a young gold hunter, who seeks gold in the enormous and the snowy deserts of Alaska. One day, he saved a mixed dog-wolf from the hands of a cruel man, and a brave friendship develops between the two. The dog-wolf, who is named \"the white fang\" for it's sharp and white teeth, was left alone after his mother was killed by a hunter. After a while, the white fang was taken from Jack, by a man who put him in an illegal dog fighting pen to fight other dogs. White Fang becomes a professional, experienced and a cruel killer. But unexpectedly after a long time Jack meets him again and they renew their friendship. When a group of criminals wants to steal Jack's gold, White Fang is the only one who can help him to fight them off.",
    "Batman, the costumed crime-fighter who prowls the night skies in Gotham City, soon finds there's another vigilante in town knocking off prominent mob figures. Despite the scythe-like blade for a hand, a mechanical voice and the cloud of smoke that follows the figure wherever it goes, the police and outraged officials mistake the homicidal crusader for Batman himself and demand that the city's longtime hero be brought to justice. Meanwhile, Andrea Beaumont returns to town. She is the lost love of Bruce Wayne, the billionaire playboy who is Batman's alter ego, and was an integral part of Wayne's decision ten years earlier to don the cape and cowl. Now, she is back in his life and is no less a disruption than the return of his old archenemy, The Joker, who has a stake in seeing the annihilation of this new vigilante, whoever it proves to be.",
    "During a championship baseball match, the three brothers hear that their grandfather in Japan is in trouble, and head out to help him, conceding the match. When they arrive in Japan, they must use all their powers to defend him against his ancient enemy, who has returned to exact revenge.",
    "The Viking town of Berk, now enjoying its new alliance with the dragons, is preparing for its annual winter holiday of Snoggletog. However, that spirit is threatened when all the dragons, except Toothless who needs Hiccup to help him, suddenly fly away for some reason. While Astrid ineffectually tries to salvage the occasion, Hiccup decides to build Toothless a new prosthetic to allow him to fly independently, only to have the dragon take off as well. However, as the holiday approaches, Hiccup finds himself swept up to learn the dragons' secret the hard way and to find a solution to bring them home early.",
    "A struggling but talented photographer inherits an antique holiday advent calendar, the contents of which seem to predict the future. Will this magical calendar lead her to love this holiday season?",
    "The story of Fahim Mohammad, world junior chess champion, born in Bangladesh in 2000, and currently playing in France.",
    "In this high-adventure sequel the baby geniuses find themselves at the center of a nefarious scheme led by powerful media mogul Bill Biscane. Joining the babies in their battle against evil is a legendary baby named Kahuna. Part ultra-cool spy, part superhero, Kahuna joins babies Archie, Finkleman, Alex and Rosita in a race against time to stop the villainous Biscane from using his state-of-the-art satellite system to control the minds of the world's population.",
    "In the third episode of this series, the Ducks get scholarships to Eden Hall Academy, a high ranking prep school. But as freshmen, they will have to face the snob varsity team...",
    "When Sid accidentally destroys Manny's heirloom Christmas rock and ends up on Santa's naughty list, he leads a hilarious quest to the North Pole to make things right and ends up making things much worse. Now it's up to Manny and his prehistoric posse to band together and save Christmas for the entire world.",
    "A family film about a mouse that lives in an old house where the geriatric owner dies, and Ernie and Lars Smuntz have plans for, but they have trouble getting rid of the mouse. It's like Home Alone with a mouse.",
    "As an idle, good-natured bachelor, Uncle Buck is the last person you would think of to watch the kids. However, during a family crisis, he is suddenly left in charge of his nephew and nieces. Unaccustomed to suburban life, fun-loving Uncle Buck soon charms his younger relatives Miles and Maizy with his hefty cooking and his new way of doing the laundry. His carefree style does not impress everyone though - especially his rebellious teenage niece, Tia, and his impatient girlfriend, Chanice. With a little bit of luck and a lot of love, Uncle Buck manages to surprise everyone in this heartwarming family comedy.",
    "Melanie Porter (Raven-Symone)is a talented high school graduate who has selected a University 800 miles from home. Her over protective father, James (Martin Lawrence) doesn't want her to be so far away, so he cooks up a plot to try to convince her to go to a local University. On the guise of going to her selected university, he forces a visit to his preferred (close to home) school. This is a typical road trip movie with lost cars, bumming rides on buses and planes, covering that difficult time of life when a father loses control of his daughter.",
    "A self-trained dancer from the streets of Detroit finds her way after auditioning for the most prestigious ballet academy in New York.",
    "An alien couple known as Beldar and Prymatt with cone-shaped heads from the planet called Remulak is mistakingly ditched on earth, during a scouting mission for planet conquest. While here, they dodge the INS, have a child and discover that life on Earth is quite good. But unfortunately they are being chased by the government who knows something is not quite right with the Conehead family. After they are rescued and taken back to their planet, Belder vows to return to earth and conquer it!",
    "During a nightly Porsche ride with his doting rascal Xan, white South African farmer Peter finds and adopts an orphaned cheetah cub, dubbed Duma (just Swahili for cheetah). It becomes the boy's inseparable playmate, even taking it to bed. Peter made clear from the start that the cheetah should be returned to the wild before its full adulthood. But the father is stricken down with a disease just before the cheetah could be returned. Xan's mother sells the farm and moves in with a city aunt. The cheetah escapes, but finds Xan at school, where the new boy is bullied. He decides to run away to the mountains with Duma. On the way they face countless perils, which courage, Xan's intelligence and Duma's instinct overcome.",
    "When Miami dentist Ted Brooks learns that his birth mother has passed away and that he was named in her will, he travels to Alaska to claim his inheritance. Rather than the large chunk of change that many people would expect, Ted instead receives his mother's pack of rowdy sled dogs and her property. Although the dogs seemingly have it in for Ted, he decides to keep the dogs and race them in the local race, the Arctic Challenge, spiting a mountain man who wants the dogs. What follows is a comedy detailing Ted's adventures in learning to run the sled dogs.",
    "Bill Dancer and his young companion Curly Sue are the classic homeless folks with hearts of gold. Their scams are aimed not at turning a profit, but at getting enough to eat. When they scam the rich and beautiful Grey Ellison into believing she backed her Mercedes into Bill, they're only hoping for a free meal. But Grey is touched, and over the objections of her snotty fiance, insist on putting the two up for the night. As they get to know each other, Bill becomes convinced that this is where Curly Sue belongs - in a home, cared for by someone that can give her the advantages that his homeless, nomadic existence lacks. He plans to leave the young girl in the care of Grey and take off.... but Curly Sue has other ideas!",
    "A ruthless destructive vigilante posing as Batwoman is wreaking havoc in Gotham City. While she sets her sights on thwarting Penguin's evil plans, Batman concentrates on discovering this mysterious imposter's true identity. But when she's captured by the vicious Bane, it falls upon the caped crusader to rescue her, defeat Bane and foil the Penguin's devious plot himself.",
    "A goofy stork mistakenly delivers a baby panda to the wrong door. A bear, a moose, a tiger and a rabbit set on an arduous but fun filled adventure through wilderness to return the panda to its rightful home.",
    "Joe Kingman is a huge football star. He's got women, money, and a good career. Everything is perfect for him. Then one day an 8 year old girl shows up at his door telling him that she's his daughter from a past relationship. Once he has proof that she is for a fact his, he tries but fails miserably at \"parenting.\" From problems such as his super speedy car with no backseat, to leaving her in a bar at 3 am, he's got a lot to deal with. Eventually though, she gets him, (and his football team) wrapped around her finger. When she has a near-death experience and Joe finds out her mother died early that year, he wants her to move and live with him. Her aunt though disagrees and takes her home. Joe has to play the game of his life and when he's injured, and things don't look good for him, his daughter comes out and gets him right back on the field.",
    "Jules Daly is struggling to raise her orphaned niece and nephew (Maggie and Milo) alone, but it isn't easy after getting downsized out of her antique sales job while Milo rebels against the death of his parents through petty theft. With things looking bleak for Christmas, an English butler named Paisley arrives with an invitation for all to come see the kids' emotionally distant grandfather who lives in Castlebury Hall, somewhere near Liechtenstein. With nothing to hold them back, they go, but the grandfather - Edward, Duke of Castlebury - is rather cold over their visit to his castle. So is his other surviving son, Ashton, Prince of Castlebury. Before long, they're all having a good time and looking forward to hosting a Christmas Eve ball, but Jules overhears a conversation from which she draws a wrong conclusion.",
    "Hoping to make enough money through an overseas employer to live comfortably, Real Estate Developer Dan Sanders manages to convince his son, Tyler, and wife, Tammy, to re-locate in a remote corner of Oregon. Tyler does seem content after he meets with lovely Amber, but Tammy is concerned about her husband when he near-hysterically claims that local creatures, including beavers, ravens, bears, fox, etc. have joined forces to sabotage his project.",
    "Spoiled rich sisters, Taylor and Courtney Callum, have had it made. Their father owns a successful dairy that allows them to live comfortably. They can have anything they want: the latest designer clothes, cool cars, and an endless supply of money to spend. One day, the sisters end up ruining their house kitchen and their father has had enough. He sends the two to work a summer job at his dairy hoping it'll teach them responsibility and the value of a dollar. However, problems emerge when the dairy goes broke and it's up to the girls to decide: give up their selfish ways and save the dairy? or sit back and watch the company fall to pieces?",
    "An obese boy named Fat Albert and his friends Rudy, Mushmouth, Bill, Dumb Donald, Russell, and Weird Harold, pulls into trouble when they \"fall\" out of their TV world into the real world, where Fat Albert tries to help a young girl, Doris, make friends. However, the simple life of the group is interrupted when Fat Albert falls for Doris' older sister, Lauri, sparking his friends to worry that their leader may never want to return to his cartoon world again.",
    "Mr.Magoo is an eccentric millionaire with very bad eyesight who refuses to use eyeglasses and therefore always gets into trouble. During the museum robbery he accidentally gets a priceless gem called the Star of Kurdistan, and begins to trace the way for the arch-criminals whose idea was to steal the gem - Austin Cloquet and Ortega \"The Piranha\" Peru, while two federal agents Stupak and Anders lead the manhunt for Mr.Magoo himself.",
    "A tribe of cats called the Jellicles must decide yearly which one will ascend to the Heaviside Layer and come back to a new Jellicle life.",
    "Meet Howard Langston, a salesman for a mattress company is constantly busy at his job, and he also constantly disappoints his son, after he misses his son's karate exposition, he tries hard to come up with a way to make it up to him, this is when his son tells Howard that he wants for Christmas is an action figure of his son's television hero, Turbo Man. Unfortunately for Howard, it is Christmas Eve, and every store is sold out of Turbo Man figures, now Howard must travel all over town and compete with everybody else including a mail man named Myron to find a Turbo Man action figure, and to make it to the Wintertainment parade which will feature Turbo Man.",
    "It's the Chipmunks' third and final full-length feature! Alvin is struggling with nightmares of werewolves. Alvin believes that the new next-door neighbor Mr. Talbot is a werewolf. Of course, no one believes him. Meanwhile, the boys are working on the school production of Dr. Jekyll & Mr. Hyde. When Alvin blows up the school auditorium, he is expelled from the production. Theodore is put in to rise his lack of confidence. Alvin and Simon are trying to discover the secret of Mr. Talbot. Will the play go as planned or will the Chipmunks mess it up?! And is Mr. Talbot a werewolf?",
    "A young boy named Yankee Irving finds himself at an extraordinary crossroads: He has a chance to be a hero - and make a difference against incredible odds - or he can play it safe. With faith in himself instilled by his family, he teams up with a sassy young girl and some off-the-wall sidekicks and embarks on a sometimes perilous, often funny, cross-country quest. In the process, he restores his family's honor, befriends the world's biggest sports superstar, and reveals the hero within.",
    "Stuart Little's back in an all-new, adventure! School's out for the summer and the Little Family is spending their big vacation at a beautiful lakeside cabin near Lake Garland. But meanwhile, there is something lurking in the forest who could spoil all the fun: the Beast; a mean and isolated forest terror who rules the local animals with an iron paw. When Snowbell is taken prisoner, a Little bravery goes a long way as Stuart, along with his new skunk friend, named, Reeko, who heroically rescues Snowbell, frees the other woodland creatures and outwits the wily Beast.",
    "From Mark Osborne comes the first-ever animated feature film adaptation of Antoine de Saint-Exupéry's iconic masterpiece, The Little Prince. At the heart of it all is The Little Girl, who's being prepared by her mother for the very grown-up world in which they live - only to be interrupted by her eccentric, kind-hearted neighbor, The Aviator. The Aviator introduces his new friend to an extraordinary world where anything is possible. A world that he himself was initiated into long ago by The Little Prince. It's here that The Little Girl's magical and emotional journey into her own imagination - and into the universe of The Little Prince - begins. And it's where The Little Girl rediscovers her childhood and learns that ultimately, it's human connections that matter most, and that what's truly essential can only be seen with the heart.",
    "Jake Bouchard, a shy 17-year-old, has finally scored a date with the incredibly wonderful Angie. When Angie gets kidnapped, the truth about Grandpa comes out. In a last ditch effort to rescue Angie, Grandpa re-enlists \"The Devil's Scum\", his old special ops unit who band together with Jake to go on one last mission.",
    "The film is an edited version of three different Japanese short films, which have been combined together. There is narration by a continuing character, Kari. The first segment of the film revolves around the first encounter with a digimon and a fight that occurs between their digimon and another. The two kids, Kari and Tai, raise a fast-growing digimon from an egg to a large, dinosaur-like digimon, which escapes from their house and then has an encounter and a battle with a parrot-like digimon. The second segment mainly involves Tai and another digiDestined friend of his, Izzy. A computer virus sweeps across the internet, effecting a digiEgg, and thus creating an infected digimon. This infected digimon begins to start eating computer information and data, and the two protagonists attempt to stop the digimon, but fail. After the infected digimon manages to get into the American information system and launch two nukes, one at japan and one at Colorado, Tai and Izzy get help from teammates Matt and his little brother T.K. They successfully overcome the infected digimon and prevent the nukes from detonating. The third and final segment involves Kari and T.K., now years older, as they see a kid and two digimon fighting whilst in New York. Kari and T.K decide to follow the child, who turns out to be the creator of the virus, and, after meeting up with friends, they manage to defeat the evil digimon, who turns out to be one of Willis' twin digimon that was affected by the virus following the actions of the second segment. Together they fight against this infected digimon, and destroy the virus that was affecting Willis' digimon.",
    "Seiji Iwahashi is released early from a 10-year prison sentence for killing the boss of a rival. He returns to find the two rival gangs finalizing a merger. When a pattern of corruption is revealed he can no longer sit back and let it continue.",
    "Scooby-Doo and the gang must track down the last of thirteen ghosts they had hunted years ago.",
    "July, 1899: When Joseph Pulitzer and William Randolph Hearst raise the distribution price one-tenth of a cent per paper, ten cents per hundred, the newsboys, poor enough already, are outraged. Inspired by the strike put on by the trolley workers, Jack \"Cowboy\" Kelly (Christian Bale) organizes a newsboys' strike. With David Jacobs (David Moscow) as the brains of the new union, and Jack as the voice, the weak and oppressed found the strength to band together and challenge the powerful.",
    "In Manhattan, Ashley Albright is a lucky woman and very successful in the agency where she works. The clumsy Jake Hardin is an unlucky aspirant manager of the rock band McFly, who is unsuccessfully trying to contact the entrepreneur Damon Phillips to promote his band. When Ashley meets Jake in a masquerade party, they kiss each other, swapping her fortune with his bad luck.",
    "Buddy was a baby in an orphanage who stowed away in Santa's sack and ended up at the North Pole. Later, as an adult human who happened to be raised by elves, Santa allows him to go to New York City to find his birth father, Walter Hobbs. Hobbs, on Santa's naughty list for being a heartless jerk, had no idea that Buddy was even born. Buddy, meanwhile, experiences the delights of New York City (and human culture) as only an elf can. When Walter's relationship with Buddy interferes with his job, he is forced to reevaluate his priorities.",
    "While out fighting off ninja pirates, Puss stumbles on a fairy tale book. When he opens it, the adventure begins, as the viewer must choose each outcome, eventually freeing Puss from the book.",
    "In this, the third film, it's the pets who do the talking. The Ubriacco's find themselves the owners of two dogs, Rocks, a street wise cross breed, and Daphne, a spoiled pedigree poodle. James has a new job, pilot to the sexy and lonely Samantha. Mollie's just lost hers and is stuck at home.",
    "A sweet-natured Italian waiter named Pistachio Disguisey at his father Fabbrizio's restaurant, who happens to be a member of a family with supernatural skills of disguise. But moments later the patriarch of the Disguisey family is kidnapped Fabbrizio's former arch-enemy, Devlin Bowman, a criminal mastermind in an attempt to steal the world's most precious treasures from around the world. And it's up to Pistachio to track down Bowman and save his family before Bowman kills them!",
    "Gotham City is terrorized not only by recent escapees Joker and Penguin, but by the original creature of the night, Dracula! Can Batman stop the ruthless vampire before he turns everyone in the city, including The Caped Crusader, Joker and Penguin, into his mindless minions?",
    "Based on Gail Carson Levine's award winning novel, this is the story of Ella, a young woman who was given a \"gift\" of obedience by a fairy named Lucinda. She must obey anything anyone tells her to do. When her mother passes away, she is cared for by her thoughtless and greedy father who remarries a loathsome woman with two treacherous daughters. This modern-day, fantasy Cinderella story features fairies, ogres and elves...as well as a hero in the guise of Prince Charmont, whom Ella falls in love with. Unlike Cinderella though, she must depend on herself and her intelligence to get her through her troubles and find Lucinda in order for her \"curse\" to be broken!",
    "It's another variation of the classic Scooby-Doo plot device with the gang investigating a snow creature, but this time, it's on Mount Everest with the Abominable Snowman. Shaggy and Scooby-Doo wind up on the wrong flight and wind up going to India, ruining the Mystery Inc. gang's vacation in Paris. They learn about the Snowman and are really afraid, of course. Then it becomes a huge mystery to solve when Fred, Daphne and Velma try to find Scooby and Shaggy, as well as the snow creature.",
    "When heavy rains create a mysterious \"new water\", Littlefoot sets off to explore the Great Valley. He quickly becomes friends with Mo, a prank-playing dolphin-like creature who can't find his way back to the Big Water. Littlefoot and his pals come to the rescue and prove the value of courage, friendship, and diversity.",
    "The siblings Noah and Emma travel with their mother Jo from Seattle to the family cottage in Whidbey Island to spend a couple of days while their workaholic father David Wilder is working. They find a box of toys from the future in the water and bring it home, and Emma finds a stuffed rabbit called Mimzy, and stones and a weird object, but they hide their findings from their parents. Mimzy talks telepathically to Emma and the siblings develop special abilities, increasing their intelligences to the level of genius. Their father becomes very proud when Noah presents a magnificent design in the fair of science and technology, and his teacher Larry White and his mystic wife Naomi Schwartz become interested in the boy when he draws a mandala. When Noah accidentally assembles the objects and activates a powerful generator creating a blackout in the state, the FBI arrests the family trying to disclose the mystery. But Emma unravels the importance to send Mimzy back to the future.",
    "Would-be painter Gertrude 'Trudie' Chandler loses her waitress job and boyfriend Nick on Christmas Eve - her only shot not to feel like her family's black sheep. To replace the ideal son-in-law with even hunkier dream-prince, David Martin, she kidnaps him at gunpoint to attend the family holidays in a secluded luxurious log cabin. Crazy lies prevent David from convincing the Chandler family he's not Nick and from escaping. After finally passing a rescue call to his spoiled fiancée, David decides to play the perfect catch to make her undoing worse. Before the police rescue him, he and the family realize they adore each other, the others all prove imperfect, and David and Trudy reassess their relationship after getting to know each other.",
    "Shanghai. 1936. Crossroads of the world and into this city of political intrigue comes Sofia, a Russian Countess who, with the remains of her family, has been left stateless by the Revolution. Forced by her reduced circumstances to support herself and her family as a bar-girl and taxi dancer, Sofia forms a relationship with Jackson, a blind former diplomat who opens an elegant bar; The White Countess. Their curious relationship matures but they are caught up in the fall of the city to the Japanese invaders.",
    "\"Get a Clue\" follows the exploits of a young girl, Lexy, who is a privileged twelve year old who has spent her entire life amongst the wealthy and elite of Manhattan. Clad in Prada, she prides herself on her ability to get the scoop and serve it up in her school's gossip column. When a photo she has taken of her teachers is published in the city's daily paper, things start getting weird. A teacher goes missing and she along with her working class family friend, Jack, set out to solve the mystery. What follows is an action-packed adventure laced with mystery and drama.",
    "11-year-old Gerald \"Gerry\" Garner lives in Long Island, New York, and he's overweight. Gerry's parents Maury and Mrs. Garner decide to send Gerry to Camp Hope, a camp for overweight boys. The camp is owned by kindly Harvey Bushkin and his equally kind wife Alice Bushkin. When the Bushkins file for bankruptcy the camp has to be sold, it is bought by a wacko named Tony Perkis. Tony plans to force the campers to lose as much weight as they can, and he also intends to document the marathon shedding of weight and use it for an infomercial for his slenderizing program. In the eyes of the campers, Tony has made Camp Hope a living hell. As Gerry and counselor Pat Finley lead the efforts to overthrow Tony, the campers prepare for the Apache Relay against arch rival Camp MVP. The Apache Relay is a kind of race in which Camp Hope has never defeated Camp MVP before.",
    "The gang goes on a trip to check on Velma's younger sister, Madelyn. She's been studying stage magic at the Whirlen Merlin Magic Academy, where apparently there have been sightings of a giant griffin. The gang decides to investigate.",
    "Welcome to the real Hogwarts. To cope with the pressures of growing up, magic-obsessed kids congregate at the one place where they can be themselves: Tannen's Magic Camp, the most prestigious magic institution in the world.",
    "Dignity. Poise. Mystery. We expect nothing less from the great, turn-of-the-century magician, Presto. But, when Presto forgets to feed his rabbit one too many times, well, there's really no telling what to expect! Follow the escalating high jinx of the amazing Presto, his rabbit Alec, and what happens onstage when a star magician's ego provokes some clever revenge from his neglected costar.",
    "Roberta, Teeny, Samantha and Chrissy have been busy growing up, but they always remembered the promise they made to be there for each other. Now they're together again to relive the greatest summer of their lives.",
    "Ring in the season with Winnie The Pooh in a holiday adventure.",
    "After wrecking their house during a chase, Tom and Jerry enter a race around the world where the winner gets a new fancy house.",
    "The mystery inc. head to Chicago for a show called Talent Star, hosted by Brick Pimiento. Upon arrival, they discovered that the opera house in which the show will be held is haunted by a ghost called The Phantom, who is intensely lauding one of the finalist to win.",
    "On Christmas Eve, Private slips out of the zoo for some last-minute shopping. In the city he's mistaken as a cute chew toy by a mean old woman named Nana, who gives Private to her vicious dog, Mr. Chew. On a mission to rescue their penguin pal, Skipper, Kowalski and Rico risk life and flipper as they take on Nana and Mr. Chew with an explosive solution that will leave you laughing out loud.",
    "Mike has a surprise for his pal Sullivan: Mike's gotten a new car, one with six-wheel drive. He invites Sullivan to hop in and they'll go for a spin. At that point, problems arise: first Sullivan's cramped, then Mike has a seat belt problem, gets locked out, and suffers indignities before Sullivan figures out how to unlock the car to let him back in. All sorts of gadgets misfire, until finally Mike has the car in gear, ready to roll. What was it again that was wrong with his old car?",
    "In the depths of the 1930's, Annie is a fiery young orphan girl who must live in a miserable orphanage run by the tyrannical Miss Hannigan. Her seemingly hopeless situation changes dramatically when she is selected to spend a short time at the residence of the wealthy munitions industrialist, Oliver Warbucks. Quickly, she charms the hearts of the household staff and even the seemingly cold-hearted Warbucks cannot help but learn to love this wonderful girl. He decides to help Annie find her long lost parents by offering a reward if they would come to him and prove their identity. However, Miss Hannigan, her evil brother, Rooster, and a female accomplice, plan to impersonate those people to get the reward for themselves which put Annie in great danger.",
    "Fishermen separate a young orca whale (Willy) from his parents and he ends up in a fish bowl at a marina. Meanwhile, a street kid runs afoul of the law and gets caught vandalising the marina, but his social worker gets him off the hook (so to speak) provided he cleans up his mess at the marina. While there, he befriends the whale and teaches him tricks, something the trainer hasn't been able to do. But when Willy is a dud in front of the audience, the marina owner plans some bad things, and the boy and his friends must try to (*** MAJOR SPOILERS ***) free Willy.",
    "In the tradition of Hachi: A Dog's Tale (2009), this is the story of a legendary, lovable red dog who roamed the outback looking for his original master, finding his way into the hearts of everyone he meets, bringing people and communities together, some who find love, and others who find themselves. Based on true events.",
    "OPEN SEASON: SCARED SILLY opens with Elliot telling a campfire story about the legend of the Wailing Wampus Werewolf that lives in Timberline National Forest. Domesticated Boog is terrified by the story and decides to \"chicken out\" of their annual summer camping trip until he knows the werewolf is gone. Determined to help Boog overcome his fears, Elliot and their woodland friends band together to scare the fear out of Boog and uncover the mystery of the Wailing Wampus Werewolf.",
    "In a remote bar, a newcomer advises the customers to seal the place up, as hungry monsters will soon attack them. The customers must quickly organize a strategy to defend themselves from the deadly creatures.",
    "Jake Russell, the friendly police chief in town so small initially worries about mysterious outsider heiress Cassandra 'Cassie' Nightingale, who moved into the house held to be haunted by the 'grey lady', and opens a strange gift shop full with attributes of occultism, soon causing the rumor she's a wicked witch. After Cassie kindly helps his brave son Brandon (and his sissy sister Lori) with a dog, bully Kyle -abused by his own poor dad- and their own fears, Jake soon makes friends with her, even romantically interested. Yet the 'chief' is professionally obliged to handle a flood of complaints and harassment started by the mayor's haughty wife, her busy bodies-bunch, and teenage brats. Finally Derek Sanders, Jakes's only deputy, hits on Cassie's hidden background.",
    "Professional daredevil and white-suited hero, The Great Leslie, convinces turn-of-the-century auto makers that a race from New York to Paris (westward across America, the Bering Straight and Russia) will help to promote automobile sales. Leslie's arch-rival, the mustached and black-attired Professor Fate vows to beat Leslie to the finish line in a car of Fate's own invention. The Blake Edwards style of slapstick and song originated with this movie. A dedication to Laurel and Hardy appears at the beginning of the film. Edwards' tribute to Stan and Ollie can be seen most clearly in the interaction between Professor Fate and his cohort Max, as well as in the operatic Pottsdorf pie fight.",
    "Wallace and Gromit have a brand new business. The conversion of 62 West Wallaby Street is complete and impressive, the whole house is now a granary with ovens and robotic kneading arms. Huge mixing bowls are all over the place and everything is covered with a layer of flour. On the roof is a 'Wallace patent-pending' old-fashioned windmill. The transformation is perfect. Although business is booming, Gromit is concerned by the news that 12 local bakers have 'disappeared' this year - but Wallace isn't worried. He's too distracted and 'dough-eyed' in love with local beauty and bread enthusiast, Piella Bakewell, to be of much help. While they enjoy being the 'Toast of the Town', Gromit, with his master's life in jeopardy, must be the sleuth and solve the escalating murder mystery - in what quickly becomes a 'Matter of Loaf and Death'.",
    "Bilbo Baggins the Hobbit was just minding his own business, when his occasional visitor Gandalf the Wizard drops in one evening . One by one, a whole group of dwarves drop in, and before he knows it, Bilbo has joined their quest to reclaim their kingdom, taken from them by an evil dragon named Smaug. The only problem is that Gandalf has told the dwarves that Bilbo is an expert burglar, but he isn't....",
    "While attending college in Cape Town, Melea Martin feels constrained by the school's strict policies, and decides to set out on her own. Searching for a way to use her talents as a dancer and inspire the community around her, Melea rents a failing theater in order to put on a Hip-Hop Romeo and Juliet performance. But much like the Capulets and Montagues, conflicts between cast members threaten to bring the whole performance to a halt...",
    "Based on the true life story of California gymnast Ariana Berlin. As she zoned in on her Olympic goals, 14 year old Ariana Berlin's life took a sharp turn when she was involved in a debilitating car accident. Gaining her confidence and movement back through learning hip hop dance, she unexpectedly found herself called back to the gymnastics world thanks to world renowned UCLA Coach Valorie Kondos Field. With Val's help, Ariana was eventually able to secure a spot on the UCLA gymnastics team and win an NCAA championship, a lifelong goal that she had always dreamed of. This is a wonderfully inspiring story of persistence, confidence, and the heart and courage to make a somewhat impossible comeback in life.",
    "Ryu Seung-Ryong comes back as a fool for his daughter. Outsiders not allowed, in room number 7 of the prison where all kinds of criminals are gathered, comes Yong-goo, a father with the sense of a 6-year-old, and Ye-seung, his 7-year-old daughter. The mission of these criminals in room number 7 is to protect these two who can never stay apart for a single moment. Will they succeed?",
    "Velma discovers she's inherited her great-great-uncles' cursed castle in Transylvania, Pennsylvania. This Scooby-Doo adventure has enough spooky fun to make the whole family come alive!",
    "Benjamin has lost his wife. In a bid to start his life over, he purchases a large house that has a zoo. This is welcome news for his daughter, but his son is not happy about it. The zoo is in need of renovation and Benjamin sets about the work with the head keeper, Kelly, and the rest of the zoo staff. But, the zoo soon runs into financial trouble. The staff must get the zoo back to its former glory, pass a zoo inspection, and get it back open to the public.",
    "Palaeontologist Rick Marshall takes Will and Holly into a new world of danger, dinosaurs and big bug-eyed lizard people while trying to find their way back home and, too, save the universe and in doing so saving his reputation. With the dinosaur with brains, brawn and personality and the adventure of scientific advancement and exotic beasts in a far away land, it all adds up to time traveling fun and frolics.",
    "Upon the destruction of their ship, Willy is separated from his parents. He lands on a wild and unexplored planet and with the help of Buck, a survival robot, he will have to hold until the arrival of a rescue mission.",
    "Beethoven becomes a father. But the puppies owner wants to use them and the mother in her divorce bargaining. But the Newton kids steal the puppies. Will they be allowed to keep them? And will they be able to rescue the puppies mother and re-unite her with her family?",
    "Sara Newton and Beethoven spends summer with Freddy Kablinski in Quicksilver, a weird town.",
    "Follows high school sophomores Mae Hartley and Gabby Harrison, two tech-savvy best friends who devise a plan to create the perfect boyfriend with just a few strokes of the keyboard and a wireless connection. What Gabby and Mae don't realize is that the computer they use is set up to generate a robotic super soldier, which they have inadvertently activated in the form of Albert, a macho yet sensitive super cute boy.",
    "The Legion of Doom are attempting to use space satellites to freeze the Earth's oceans, creating more land mass at the coastal regions for which they own. The JLA quickly arrive and the two teams engage in a classic battle of wills. This clash leads to Lex Luthor becoming trapped in a glacier of ice. In the 31st century Legion of Superheroes trainees; Dawnstar and Karate Kid are tasked with minding the Legion's museum. Their tour leads them to Lex Luthor's memorial; his body still encased in a large chuck of ice discovered in the 29th century. Karate Kid Inadvertently frees Luthor who secretly explores the museum himself, and soon uncovers the shrine to his greatest nemesis Superman. There he learns of the Kent's involvement in Kal-El's discovery. Luthor following the voices of Dawnstar and Karate Kid takes possession of an hourglass which holds the Time Trapper within. Whoever holds the hourglass controls this entity who is the master of time. Luthor returns to the 21st century, but not without the young Legionaries close behind. The Legion of Doom regroups with a new plan in place; they will prevent the Kent's from ever raising Kal-El, and with no Superman the JLA will cease to exist as well. The JLA arrive but Luthor's efforts prove to be successful, and the Time Trapper causes the time paradoxes to vanish from this reality. Now it's up to Dawnstar and Karate Kid to stop Luthor's plans for worldwide dominance. They find a loophole freeing the Time Trapper from Luthor's control, but now nothing is preventing him from wrecking chaos throughout reality. The JLA return, but well their power combined with Dawnstar and Karate Kid prove to be enough to stop this new menace, or has our time just run out?",
    "Meet Jim Douglas, a down-on-his-luck race car driver who lives in an old run-down fire house in San Francisco with his friend Tennessee Steinmetz, a occasional drunk mechanic. One day, Jim went to a luxury car dealer and surprisingly seen a strange Volkswagon Beetle with a unusual problem, it tends to drive on it's own almost having its own mind. Then this car drove all the way to Jim's home. Believing that the owner of the car dealership Peter Thorndyke, planted the car on him. Then, Jim wanted to try out the car for himself, then, he experienced the nature of the car for himself. Then, Jim fixed it and now is in more control. Tennessee dubbed the car \"Herbie\". Then, Jim used Heribe for races. Jim then, was rising to fame and becoming more successful in racing, Then, Thorndyke wants Herbie back, but Jim refuses and Thorndyke wanted to compete against Jim in the races, then Thorndyke sabotaged Herbie before a race so, he can win. then, a big race known as the \"El Dorado\" was coming up and Jim and Tennessee along with Thorndyke's former assistant (and ex-Girlfriend) Carrol Bennet, repaired Herbie before the El Dorado. The trio are determined to beat Thorndyke in the El Dorado, who will swindle and cheat to make sure that they do not win.",
    "Musical adaptation of Charles Dickens's classic tale of an orphan who runs away from the orphanage and hooks up with a group of boys trained to be pickpockets by an elderly mentor.",
    "This is the story of a young boy named Richard Tyler, who spouts statistics about the possibility of accidents. So much so, he is scared to do anything that might endanger him, like riding his bike, or climbing into his treehouse. While riding his bike home, Richard finds shelter from a storm inside a nearby library. Richard slips and is knocked unconscious while exploring a rotunda in the library. Upon awakening, he is led on a journey through conflicts and events that resemble fictional stories, keeping him from finding the exit from the library.",
    "A Christmas themed, three-part anthology-style video. The first part, \"Donald Duck: Stuck on Christmas\", is essentially a retelling of Groundhog Day (1993), with Huey, Dewey, and Louie reliving Christmas ad infinitum. Next is \"A Very Goofy Christmas\", in which Goofy tries to overcome his son's skepticism about Santa Claus. Finally, \"Mickey & Minnie's Gift Of The Magi\" recreate the classic tale of ironic Christmas selflessness. The stories are linked together by narration by Kelsey Grammer.",
    "Wishes come true in Rugrats in Paris The Movie, and love makes its way into the hearts of those young, old and overseas. Chuckie's dad, Chazz, starts dating again, and it's Chuckie's wish to find a new mom. When Stu Pickles is summoned to Reptarland, an amazing new amusement park in Paris, to work on his Reptar invention, Tommy, Chuckie, Angelica, Phil, Lil, Dil, Didi and the whole gang tag along to the city of romance. But the Rugrats' big adventure turns out to be more than glamour, fashion and smelly cheese. Chuckie learns that when it comes to princesses and potential mommies, things are not always what they seem, and for Chazz, finding the right woman can be difficult in any language. As the Rugrats' travels take them from the Eiffel Tower to Notre Dame and everywhere in between, the world's favorite babies learn new lessons about courage, loyalty, trust and above all, true love.",
    "In a 1950's mining town called Coalwood, Homer Hickam is a kid with only one future in sight, to work in the local coal mine like his father. However in October 1957, everything changes when the first artificial satellite, Sputnik goes into orbit. With that event, Homer becomes inspired to learn how to build rockets. With his friends and the local nerd, Homer sets to do just that by trial and a lot of error. Unfortunately, most of the town and especially Homer's father thinks that they are wasting their time. Only one teacher in the high school understands their efforts and lets them know that they could become contenders in the national science fair with college scholarships being the prize. Now the gang must learn to perfect their craft and overcome the many problems facing them as they shoot for the stars.",
    "The Smurfs version of the Christmas carol, Christmas has arrived and all the village is excited except for one Smurf, Grouchy. who behave badly to everyone and everything that involve Christmas. and only the ghosts of Christmas \"past\" \"present\" and \"future\" might change his mind.",
    "A snow globe snowman wants to join the other travel souvenirs in a hot party, but the glass dome that surrounds him gets in his way, despite all his efforts.",
    "Popular animated hero Asterix and his faithful sidekick Obelix travel to ancient Egypt to help Cleopatra build a new summer home. Cleopatra and Julius Caesar have made a bet, with Caesar wagering the project cannot be completed in a few weeks time. With the help of a magic potion, Asterix comes to the rescue of the Queen of the Nile as Caesar and an angry architect plot against them.",
    "After another raid in an empty village, the chief of the Vikings Timandahaf misunderstands the explanation of his druid Cryptograf that \"fear gives wings to the dwellers\" and believes that fear actually makes the villagers fly. They decide to chase the champion of fear in Gaul to learn how to fly and make them invincible warriors. Meanwhile, the nephew of Vitalstatistix, Justforkix, is sent from Parisium to the Gaulish village to become a man and Asterix and Obelix are assigned to train the youngster. The stupid son of Cryptograf, Olaf, listens to a conversation of the coward Justforkix with Asterix and Obelix and kidnaps him. While returning to the Viking village, Justforkix meets Abba, the daughter of Timandahaf, and they fall in love for each other. But the Machiavellian and ambitious Cryptograf plan to marry his son Olaf with Abba and become powerful. In the end, Asterix realizes that it is not fear that gives wings, it is love.",
    "In this movie Rocky, Colt and TumTum must battle an evil wealthy toxic waste dumper in order to save a local Indian tribe and their friend Joe. The 3 Ninjas must help find Joe's father and find a secret disk that contains evidence that could stop the toxic landfill that is destroying the Indian community. However the town is owned by the rich man and he controls the police and even the mayor. They must fight a motorcycle gang and renegade cowboys in this non-stop ninja adventure.",
    "When a wind-up one-man band toy looks up and sees just how boisterous, BIG, and destructive the baby can be, he does everything he can to flee--even if it means hiding under the couch. But when the baby falls down and gets hurt, the tin toy has to decide on survival, or doing what a toy's got to do.",
    "For the first time ever, see the world of LEGO come to life in the all-new feature-length DVD movie adventure with Clutch Powers, the best builder and explorer in the LEGO universe.",
    "Tom and Jerry are the faithful servants of Jack, the owner of a struggling storybook amusement park that gets a much-needed boost thanks to some mysterious magical beans",
    "Disney's pups are back and take one small step for dog and one giant leap for dogkind.",
    "Secret aspirations between a failed restaurateur and a celebrity chef threaten their blossoming Christmas romance.",
    "Orphan Mary Katherine Gallagher, an ugly duckling at St. Monica High School, has a dream: to be kissed soulfully. She decides she can realize this dream if she becomes a superstar, so her prayers, her fantasies, and her conversations with her only friend focus on achieving super-stardom. Her big chance is a school talent contest; her main competition is Evian, the school beauty, who is dancing with Sky, the object of Mary Katherine's kiss dream. Mary Katherine gets some talent-show help from her fellow special education students, her grandma, and Jesus, and inspiration from secrets in her past. Watching are Sky, Evian, and a silent classmate.",
    "It's an action adventure/adventure comedy. They play estranged twins with very opposite personalities. Lizzie is very focused and driven, while Shane is more relaxed, but concerned about the environment. Both girls are chosen for a Survivor-like popular game show with college scholarships as the prize.",
    "A teen cruise to Hawaii on the S.S. Tipton sounds like every teenager's dream. So it's no surprise that Justin (Wizards of Waverly Place) entered an essay contest and won a trip for himself and his siblings, and that Miley Stewart and her best friend Lily (Hannah Montana) booked the cruise as transportation to Hawaii for Hannah Montana's concert appearance.",
    "When the dinosaur families get trapped in a valley by an ice storm, one family of \"spike tail\" dinosaurs volunteers to leave since they consume more food than the others. Meanwhile, the young dinos and a new adult dinosaur named Mr. Thicknose, head out to bring back their friend Spike, who has left his friends to be with members of his own species.",
    "When the Queen of the Trolls, Poppy, finds out that the Bergens do not have holidays, she enlists help from her friends, Branch and the Snack Pack, to help her bring holidays to the Bergens.",
    "The Towani family civilian shuttlecraft crashes on the forest moon of Endor. The four Towani's are separated. Jermitt and Catarine, the mother and father are captured by the giant Gorax, and Mace and Cindel, the son and daughter, are missing when they are captured. The next day, the Ewok Deej is looking for his two sons when they find Cindel all alone in the shuttle (Mace and Cindel were looking for the transmitter to send a distress call), when Mace appears with his emergency blaster. Eventually, the four-year old Cindel is able to convince the teenage Mace that the Ewoks are nice. Then, the Ewoks and the Towani's go on an adventure to find the elder Towanis.",
    "The man-cub Mowgli flees The jungle after a threat from the Tiger Shere Khan. Guided by Bagheera the panther and the bear Baloo, Mowgli embarks on a journey of self-discovery, though he also meets creatures who don't have his best interests at heart.",
    "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called \"Underland,\" she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
    "The movie is about the life of Tarzan. Tarzan was a small orphan who was raised by an ape named Kala since he was a child. He believed that this was his family, but on an expedition Jane Porter is rescued by Tarzan. He then finds out that he's human. Now Tarzan must make the decision as to which family he should belong to...",
    "Ten-year-old Sophie is in for the adventure of a lifetime when she meets the Big Friendly Giant. Naturally scared at first, the young girl soon realizes that the 24-foot behemoth is actually quite gentle and charming. As their friendship grows, Sophie's presence attracts the unwanted attention of Bloodbottler, Fleshlumpeater and other giants. After traveling to London, Sophie and the BFG must convince Queen Elizabeth to help them get rid of all the bad giants once and for all.",
    "In the depths of the 1930's, Annie is a fiery young orphan girl who must live in a miserable orphanage run by the tyrannical Miss Hannigan. Her seemingly hopeless situation changes dramatically when she is selected to spend a short time at the residence of the wealthy munitions industrialist, Oliver Warbucks. Quickly, she charms the hearts of the household staff and even the seemingly cold-hearted Warbucks cannot help but learn to love this wonderful girl. He decides to help Annie find her long lost parents by offering a reward if they would come to him and prove their identity. However, Miss Hannigan, her evil brother, Rooster, and a female accomplice, plan to impersonate those people to get the reward for themselves which put Annie in great danger.",
    "Dr. John Dolittle has the world in his hands: A beautiful wife at his side, two adorable daughters and a career that could not go better. One night, he nearly runs over a dog with his car. The dog yells \"bonehead\" and disappears. From then on, his childhood ability is back: To communicate with animals. Unfortunately, the word of Dolittle's ability is spreading quickly. Soon, many animals from rat to horse flock to his place to get medical advice. But his colleagues suspect he's going mad, and as the clinic Dolittle used to work for is about to being taken over for a huge amount of money, many decisions have to be made. Believe him? Put him into a mental institution? Sell the clinic? But also his family is close to breaking apart. Until a circus tiger falls seriously ill.",
    "When young Victor's pet dog Sparky (who stars in Victor's home-made monster movies) is hit by a car, Victor decides to bring him back to life the only way he knows how. But when the bolt-necked \"monster\" wreaks havoc and terror in the hearts of Victor's neighbors, he has to convince them (and his parents) that despite his appearance, Sparky's still the good loyal friend he's always been.",
    "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish that Pinocchio be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "Professor Trevor Anderson receives his teenager nephew Sean Anderson. He will spend ten days with his uncle while his mother, Elizabeth, prepares to move to Canada. She gives a box to Trevor that belonged to his missing brother, Max, and Trevor finds a book with references to the last journey of his brother. He decides to follow the steps of Max with Sean and they travel to Iceland, where they meet the guide Hannah Ásgeirsson. While climbing a mountain, there is a thunderstorm and they protect themselves in a cave. However, a lightening collapses the entrance and the trio is trapped in the cave. They seek an exit and falls in a hole, discovering a lost world in the center of the Earth.",
    "From Mark Osborne comes the first-ever animated feature film adaptation of Antoine de Saint-Exupéry's iconic masterpiece, The Little Prince. At the heart of it all is The Little Girl, who's being prepared by her mother for the very grown-up world in which they live - only to be interrupted by her eccentric, kind-hearted neighbor, The Aviator. The Aviator introduces his new friend to an extraordinary world where anything is possible. A world that he himself was initiated into long ago by The Little Prince. It's here that The Little Girl's magical and emotional journey into her own imagination - and into the universe of The Little Prince - begins. And it's where The Little Girl rediscovers her childhood and learns that ultimately, it's human connections that matter most, and that what's truly essential can only be seen with the heart.",
    "The beautiful and kindhearted princess Snow White charms every creature in the kingdom except one - her jealous stepmother, the Queen. When the Magic Mirror proclaims Snow White the fairest one of all, she must flee into the forest, where she befriends the lovable seven dwarfs - Doc, Sneezy, Grumpy, Happy, Bashful, Sleepy and Dopey. But when the Queen tricks Snow White with an enchanted apple, only the magic of true love's kiss can save her!",
    "At the turn of the century on Prince Edward Island, Matthew Cuthbert and his sister Marilla decide to take on an orphan boy as help for their farm. But they get an unexpected jolt when they're mistakenly sent a girl instead: Anne Shirley. Anne's a dreamer with an unusual point of view, far removed from Marilla's pragmatic ways, and it's only on trial that Marilla agrees to keep Anne...if Anne can keep out of trouble, only Anne has a positive genius for it. As Anne falls into a series of scrapes (and off a roof), makes a bosom friend, searches (and finds) several kindred spirits, Matthew and Marilla discover that their lives have become a great deal richer, now that Anne is at Green Gables.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "Jack Frost is a singer who's on the road most of the time so he can't spend a lot of time with his son Charlie, although they love each other very much. When Jack dies in a car accident, Charlie becomes a very sad young man, until... Jack returns as a snowman! Now they can do all the things they've missed when Jack was human, but what will people think when they see Charlie talking to a snowman and what will happen when the weather gets warmer?",
    "Jack Conroy is a young gold hunter, who seeks gold in the enormous and the snowy deserts of Alaska. One day, he saved a mixed dog-wolf from the hands of a cruel man, and a brave friendship develops between the two. The dog-wolf, who is named \"the white fang\" for it's sharp and white teeth, was left alone after his mother was killed by a hunter. After a while, the white fang was taken from Jack, by a man who put him in an illegal dog fighting pen to fight other dogs. White Fang becomes a professional, experienced and a cruel killer. But unexpectedly after a long time Jack meets him again and they renew their friendship. When a group of criminals wants to steal Jack's gold, White Fang is the only one who can help him to fight them off.",
    "A new dark force threatens Ponyville, and the Mane 6 Twilight Sparkle, Applejack, Rainbow Dash, Pinkie Pie, Fluttershy, and Rarity embark on an unforgettable journey beyond Equestria where they meet new friends and exciting challenges on a quest to use the magic of friendship and save their home.",
    "It's night; crickets chirp outside an isolated farmhouse. A bright light from a spacecraft shines through a bedroom window and lifts a sleeping man. However, the light and the small alien controlling it from the ship are unable to pull the man through the window: first it's the glass that impedes them. The alien frets; its supervisor - large, laconic, and green - watches. As the human keeps sleeping, the alien's tries every lever. Just as it looks as if the alien abduction will succeed, something goes wrong. The supervisor steps in.",
    "The Bakers, a family of 14, move from small-town Illinois to the big city after Tom Baker gets his dream job to coach his alma mater's football team. Meanwhile, his wife also gets her dream of getting her book published. While she's away promoting the book, Tom has a hard time keeping the house in order while at the same time coaching his football team, as the once happy family starts falling apart.",
    "After the disappearance of her scientist father, three peculiar beings send Meg, her brother, and her friend to space in order to find him.",
    "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
    "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "Fatima lives on her own with two daughters to support: 15-year old Souad, a teenager in revolt, and 18-year old Nesrine, who is starting medical school. Fatima speaks French poorly and is constantly frustrated by her daily interactions with her daughters. Her pride and joy, they are also a source of worry. To ensure the best possible future for them, she works odd hours as a cleaning woman. One day, she takes a fall on the stairs. On leave, Fatima begins to write to her daughters in Arabic that which she has never been able to express in French.",
    "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
    "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish that Pinocchio be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble.",
    "Sam the snowman tells us the story of a young red-nosed reindeer who, after being ousted from the reindeer games because of his beaming honker, teams up with Hermey, an elf who wants to be a dentist, and Yukon Cornelius, the prospector. They run into the Abominable Snowman and find a whole island of misfit toys. Rudolph vows to see if he can get Santa to help the toys, and he goes back to the North Pole on Christmas Eve. But Santa's sleigh is fogged in. But when Santa looks over Rudolph, he gets a very bright idea...",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "Having lived a life in selfishness, a young prince is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Years later, his chance shows itself when a young maiden named Belle offers to take her ill father's place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, an unscrupulous hunter has his own plans for Belle.",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
    "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
    "A young boy named Max has an active imagination, and he will throw fits if others don't go along with what he wants. Max - following an incident with Claire (his sister) and her friends, and following a tantrum which he throws as a result of his Mother paying more attention to her boyfriend than to him - runs away from home. Wearing his wolf costume at the time, Max not only runs away physically, but runs toward a world in his imagination. This world, an ocean away, is inhabited by large wild beasts, including one named Carol who is much like Max himself in temperament. Instead of eating Max like they normally would with creatures of his type, the wild things befriend Max after he proclaims himself a king who can magically solve all their problems.",
    "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
    "A girl no bigger than her mother's thumb feels all alone in the world knowing she is the only person her size. Her wish for a companion at last comes true when the prince of the fairy's arrives at her window sill. However, the naive Thumbelina's life goes downward from there when a toad kidnaps her. While she tries to find a way home, she begins to grow up and learns about hope with the help of the friends she always wanted.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "A bomb-sniffing beagle is fired from the mayor's office for a faux pas. That night a mad scientist dognaps him and injects him with an elixir. The dog escapes, but now has superpowers. He's adopted by a security guard - an ex-cop, who's a widower with a moody teen son, Jack. The boy discovers that the dog, named Shoeshine by dad, has super powers, but it's their little secret. While Underdog saves people in distress, the mad scientist and his underling continue their plot to catch him and take over the city. There's also a girl Jack likes who has a dog that Shoeshine takes a shine to. Will every dog have his day?",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called \"Underland,\" she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "In this charming film based on the popular L. Frank Baum stories, Dorothy and her dog Toto are caught in a tornado's path and somehow end up in the land of Oz. Here she meets some memorable friends and foes in her journey to meet the Wizard of Oz who everyone says can help her return home and possibly grant her new friends their goals of a brain, heart and courage.",
    "In this charming film based on the popular L. Frank Baum stories, Dorothy and her dog Toto are caught in a tornado's path and somehow end up in the land of Oz. Here she meets some memorable friends and foes in her journey to meet the Wizard of Oz who everyone says can help her return home and possibly grant her new friends their goals of a brain, heart and courage.",
    "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called \"Underland,\" she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
    "Black Beauty, a beautiful black stallion in 1870s England, recalls his life from his birth through his carefree life as a colt to the many hardships he suffered after achieving maturity. He goes through many owners, both good and bad, until he finally finds happiness and contentment.",
    "At the turn of the century on Prince Edward Island, Matthew Cuthbert and his sister Marilla decide to take on an orphan boy as help for their farm. But they get an unexpected jolt when they're mistakenly sent a girl instead: Anne Shirley. Anne's a dreamer with an unusual point of view, far removed from Marilla's pragmatic ways, and it's only on trial that Marilla agrees to keep Anne...if Anne can keep out of trouble, only Anne has a positive genius for it. As Anne falls into a series of scrapes (and off a roof), makes a bosom friend, searches (and finds) several kindred spirits, Matthew and Marilla discover that their lives have become a great deal richer, now that Anne is at Green Gables.",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "Professor Trevor Anderson receives his teenager nephew Sean Anderson. He will spend ten days with his uncle while his mother, Elizabeth, prepares to move to Canada. She gives a box to Trevor that belonged to his missing brother, Max, and Trevor finds a book with references to the last journey of his brother. He decides to follow the steps of Max with Sean and they travel to Iceland, where they meet the guide Hannah Ásgeirsson. While climbing a mountain, there is a thunderstorm and they protect themselves in a cave. However, a lightening collapses the entrance and the trio is trapped in the cave. They seek an exit and falls in a hole, discovering a lost world in the center of the Earth.",
    "Miser Ebenezer Scrooge is awakened on Christmas Eve by spirits who reveal to him his own miserable existence, what opportunities he wasted in his youth, his current cruelties, and the dire fate that awaits him if he does not change his ways. Scrooge is faced with his own story of growing bitterness and meanness, and must decide what his own future will hold: death or redemption.",
    "A young British girl born and raised in India loses her neglectful parents in an earthquake. She is returned to England to live at her uncle's estate. Her uncle is very distant due to the loss of his wife ten years before. Neglected once again, she begins exploring the estate and discovers a garden that has been locked and neglected. Aided by one of the servants' brothers, she begins restoring the garden, and eventually discovers some other secrets of the manor.",
    "At the Macy's Department Store Thanksgiving Day parade, the actor playing Santa is discovered to be drunk by a whiskered old man. Doris Walker, the no nonsense special events director, persuades the old man to take his place. The old man proves to be a sensation and is quickly recruited to be the store Santa at the main Macy's outlet. While he is successful, Ms. Walker learns that he calls himself Kris Kringle and he claims to be the actual Santa Claus. Despite reassurances by Kringle's doctor that he is harmless, Doris still has misgivings, especially when she has cynically trained herself, and especially her daughter, Susan, to reject all notions of belief and fantasy. And yet, people, especially Susan, begin to notice there is something special about Kris and his determination to advance the true spirit of Christmas amidst the rampant commercialism around him and succeeding in improbable ways. When a raucous conflict with the store's cruelly incompetent psychologist erupts, Kris finds himself held at Bellevue where, in despair, he deliberately fails a mental examination to ensure his commitment. All seems lost until Doris' friend, Fred Gaily, reassures Kris of his worth and agrees to represent him in the fight to secure his release. To achieve that, Fred arranges a formal hearing in which he argues that Kris is sane because he is in fact Santa Claus. What ensues is a bizarre hearing in which people's beliefs are reexamined and put to the test, but even so, it's going to take a miracle for Kris to win.",
    "Enter the land of Tinker Bell and her four best fairy friends.",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "Having lived a life in selfishness, a young prince is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Years later, his chance shows itself when a young maiden named Belle offers to take her ill father's place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, an unscrupulous hunter has his own plans for Belle.",
    "Birth of a legend. Following King Richard's death in France, archer Robin Longstride, along with Will Scarlett, Alan-a-Dale and Little John, returns to England. They encounter the dying Robert of Locksley, whose party was ambushed by treacherous Godfrey, who hopes to facilitate a French invasion of England. Robin promises the dying knight he will return his sword to his father Walter in Nottingham. Here Walter encourages him to impersonate the dead man to prevent his land being confiscated by the crown, and he finds himself with Marian, a ready-made wife. Hoping to stir baronial opposition to weak King John and allow an easy French take-over, Godfrey worms his way into the king's service as Earl Marshal of England and brutally invades towns under the pretext of collecting Royal taxes. Can Robin navigate the politics of barons, royals, traitors, and the French?",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "An adaptation of J. M. Barrie's story about a boy who never grew up. The three children of the Darling family receive a visit from Peter Pan, who takes them to Never Land, where an ongoing war between Peter's gang of rag-tag runaways and the evil Pirate Captain Hook is taking place.",
    "Optometrist Steve Finch loves those Christmas traditions he has set up with his family and his town. As such, he has a schedule of activities for his family starting on December 1st, and is the official unofficial consultant for anything Christmas related in his town of Cloverdale, Massachusetts. During the Christmas season, the Halls move in to the house across the street from the Finch's. The Halls in general are different in outlook and temperament than the Finches. Unlike Steve, Buddy Hall scams his way through life and never follows through with anything he starts. While Kelly Finch and Tia Hall - Steve's wife and Buddy's wife respectively - and their children begin friendships based largely on those differences, Steve and Buddy butt heads based on those differences. It begins with Buddy striving to have his house seen from outer space by decorating it as lavishly and brightly as possible. One of the results of Buddy's task his that he becomes the new go to guy for anything Christmas related in Cloverdale, usurping Steve's coveted position. As Steve and Buddy's open animosity grows, they may threaten the joy of Christmas for all, most specifically their families who have their own ideas of what they would like to do over the Christmas season.",
    "Conrad and Sally Walden (Spencer Breslin and Dakota Fanning) are home alone with their pet fish. It is raining outside, and there is nothing to do. Until The Cat in the Hat ('Mike Myers') walks in the front door. He introduces them to their imagination, and at first it's all fun and games, until things get out of hand, and The Cat must go, go, go, before their parents get back.",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "Years before meeting Shrek and Donkey, the adorable but tricky Puss in Boots must clear his name from all charges making him a wanted fugitive. While trying to steal magic beans from the infamous criminals Jack and Jill, the hero crosses paths with his female match, Kitty Softpaws, who leads Puss to his old friend, but now enemy, Humpty Dumpty. Memories of friendship and betrayal enlarges Puss' doubt, but he eventually agrees to help the egg get the magic beans. Together, the three plan to steal the beans, get to the Giant's castle, nab the golden goose, and clear Puss' name.",
    "Hercules, son of the Greek God, Zeus, is turned into a half-god, half-mortal by evil Hades, God of the Underworld, who plans to overthrow Zeus. Hercules is raised on Earth and retains his god-like strength, but when he discovers his immortal heritage Zeus tells him that to return to Mount Olympus he must become a true hero. Hercules becomes a famous hero with the help of his friend Pegasus and his personal trainer, Phil the satyr. Hercules battles monsters, Hades and the Titans, but it is his self-sacrifice to rescue his love Meg which makes him a true hero.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "This is the Disney animated tale of the romance between a young American Indian woman named Pocahontas and Capt. John Smith, who journeyed to the New World with other settlers to begin fresh lives. Her powerful father, Chief Powhatan, disapproves of their relationship and wants her to marry a native warrior. Meanwhile, Smith's fellow Englishmen hope to rob the Native Americans of their gold. Can Pocahontas' love for Smith save the day?",
    "From Mark Osborne comes the first-ever animated feature film adaptation of Antoine de Saint-Exupéry's iconic masterpiece, The Little Prince. At the heart of it all is The Little Girl, who's being prepared by her mother for the very grown-up world in which they live - only to be interrupted by her eccentric, kind-hearted neighbor, The Aviator. The Aviator introduces his new friend to an extraordinary world where anything is possible. A world that he himself was initiated into long ago by The Little Prince. It's here that The Little Girl's magical and emotional journey into her own imagination - and into the universe of The Little Prince - begins. And it's where The Little Girl rediscovers her childhood and learns that ultimately, it's human connections that matter most, and that what's truly essential can only be seen with the heart.",
    "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish that Pinocchio be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble.",
    "Long ago in a land with an ailing king, there was a pair of boys who looked exactly alike, a pauper called Mickey and the other, the Crown Prince. Mickey dreamed of plenty and an easy life as Royalty and the Prince dreamed of the freedom as a subject. Happenstance throws them together and their mutual resemblence inspires the pair to switch identities to see how the other lives. To their surprise, Mickey learns of the duties and responsibilties of royalty while the Prince learns to his horror that the Royal Captain of the Guard has taken advantage of the existing power vacuum to inflict brutal tyranny on the subjects. Now the Prince must react to this evil, unaware that the Captain knows about the identity swap and is using it to his own advantage while dominating Mickey who play the Heir to the Throne.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "The beautiful and kindhearted princess Snow White charms every creature in the kingdom except one - her jealous stepmother, the Queen. When the Magic Mirror proclaims Snow White the fairest one of all, she must flee into the forest, where she befriends the lovable seven dwarfs - Doc, Sneezy, Grumpy, Happy, Bashful, Sleepy and Dopey. But when the Queen tricks Snow White with an enchanted apple, only the magic of true love's kiss can save her!",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "In Disney's beguiling animated romp, rebellious 16-year-old mermaid Ariel is fascinated with life on land. On one of her visits to the surface, which are forbidden by her controlling father, King Triton, she falls for a human prince. Determined to be with her new love, Ariel makes a dangerous deal with the sea witch Ursula to become human for three days. But when plans go awry for the star-crossed lovers, the king must make the ultimate sacrifice for his daughter.",
    "A girl no bigger than her mother's thumb feels all alone in the world knowing she is the only person her size. Her wish for a companion at last comes true when the prince of the fairy's arrives at her window sill. However, the naive Thumbelina's life goes downward from there when a toad kidnaps her. While she tries to find a way home, she begins to grow up and learns about hope with the help of the friends she always wanted.",
    "A girl no bigger than her mother's thumb feels all alone in the world knowing she is the only person her size. Her wish for a companion at last comes true when the prince of the fairy's arrives at her window sill. However, the naive Thumbelina's life goes downward from there when a toad kidnaps her. While she tries to find a way home, she begins to grow up and learns about hope with the help of the friends she always wanted.",
    "Years before meeting Shrek and Donkey, the adorable but tricky Puss in Boots must clear his name from all charges making him a wanted fugitive. While trying to steal magic beans from the infamous criminals Jack and Jill, the hero crosses paths with his female match, Kitty Softpaws, who leads Puss to his old friend, but now enemy, Humpty Dumpty. Memories of friendship and betrayal enlarges Puss' doubt, but he eventually agrees to help the egg get the magic beans. Together, the three plan to steal the beans, get to the Giant's castle, nab the golden goose, and clear Puss' name.",
    "Alice, an unpretentious and individual 19-year-old, is betrothed to a dunce of an English nobleman. At her engagement party, she escapes the crowd to consider whether to go through with the marriage and falls down a hole in the garden after spotting an unusual rabbit. Arriving in a strange and surreal place called \"Underland,\" she finds herself in a world that resembles the nightmares she had as a child, filled with talking animals, villainous queens and knights, and frumious bandersnatches. Alice realizes that she is there for a reason--to conquer the horrific Jabberwocky and restore the rightful queen to her throne.",
    "Having lived a life in selfishness, a young prince is cursed by a mysterious enchantress to having the appearance of a monstrous beast. His only hope is to learn to love a young woman and earn her love in return in order to redeem himself. Years later, his chance shows itself when a young maiden named Belle offers to take her ill father's place as his prisoner. With help from the castle's enchanted staff, Belle learns to appreciate her captor and immediately falls in love with him. Back in the village however, an unscrupulous hunter has his own plans for Belle.",
    "Lemuel Gulliver has been working in the mail room of a New York daily newspaper for the past ten years. Afraid to put himself out there, he considers himself a loser, as do all his peers. One day, after having finally had enough, he decides to declare his flame to the beautiful Darcy Silverman, the newspaper's travel editor and one of Gulliver's only friends...only to chicken out at the last minute and instead tell her that he'd like to try his hand at writing a column. Darcy accepts and sends him on an assignment to the Bermuda Triangle. There, Gulliver becomes shipwrecked and ends up on the island of Liliput, where he is twelve taller than the tallest man. For the first time, Gulliver has people looking up to him...",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "Based on the New York Times bestseller, WONDER tells the incredibly inspiring and heartwarming story of August Pullman. Born with facial differences that, up until now, have prevented him from going to a mainstream school, Auggie becomes the most unlikely of heroes when he enters the local fifth grade. As his family, his new classmates, and the larger community all struggle to discover their compassion and acceptance, Auggie's extraordinary journey will unite them all and prove you can't blend in when you were born to stand out.",
    "In 15th century Paris, Clopin the puppeteer tells the story of Quasimodo, the misshapen but gentle-souled bell ringer of Notre Dame, who was nearly killed as a baby by Claude Frollo, the Minister of Justice. But Frollo was forced by the Archdeacon of Notre Dame to raise Quasimodo as his own. Now a young man, Quasimodo is hidden from the world by Frollo in the belltower of the cathedral. But during the Festival of Fools, Quasimodo, cheered on by his gargoyle friends Victor, Hugo, and Laverne, decides to take part in the festivities, where he meets the lovely gypsy girl Esmeralda and the handsome soldier Phoebus. The three of them find themselves ranged against Frollo's cruelty and his attempts to destroy the home of the gypsies, the Court of Miracles. And Quasimodo must desperately defend both Esmeralda and the very cathedral of Notre Dame.",
    "The animated story of Bambi, a young deer hailed as the 'Prince of the Forest' at his birth. As Bambi grows, he makes friends with the other animals of the forest, learns the skills needed to survive, and even finds love. One day, however, the hunters come, and Bambi must learn to be as brave as his father if he is to lead the other deer to safety.",
    "A girl named Ella (Cinderella) has the purest heart living in a cruel world filled with evil stepsisters and an evil stepmother out to ruin Ella's life. Ella comes one with her pure heart when she meets the prince and dances her way to a better life with glass shoes, and a little help from her fairy godmother, of course.",
    "Inventor Gepetto creates a wooden marionette called Pinocchio. His wish that Pinocchio be a real boy is unexpectedly granted by a fairy. The fairy assigns Jiminy Cricket to act as Pinocchio's \"conscience\" and keep him out of trouble. Jiminy is not too successful in this endeavor and most of the film is spent with Pinocchio deep in trouble."
]